{"post_id": "1lcftjz", "title": "Got my mom her green card by enlisting in the military (ARNG)", "author": "u/SuperiorT", "score": 4159, "num_comments": 537, "created": "2025-06-16T00:52:02+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lcftjz/got_my_mom_her_green_card_by_enlisting_in_the/", "is_self": false, "image_urls": [], "selftext": "Well that's a wrap. On June 12, 2025 my mom finally got her green card. I was able to get my mom her permanent residency card by enlisting in the military (Army National Guard). I swore into the ARNG on May 31st, 2024 so it's only been a year since I started this journey. During the I-485 interview, not much had to be said, the interviewer said that our case was pretty straightforward. When entering the building, we had to be checked like at an airport. After that I only had to show the desk clerk our interview notice and my mom's form of ID, as well as my CAC to verify the method in which how we got the GC interview notice. The interview lasted around 25 minutes or so and we were approved on the spot. So for anyone questioning whether joining the National Guard can fix their parents' undocumented status, yes, yes it can and very quickly too! My mom had no criminal charges and only trespassed once and remained in the USA for over 30 yrs. 💚🎉 It feels amazing when things work out and when you worked for it too! 💪🏼", "subreddit": "USCIS"}
{"post_id": "1grmeq4", "title": "Today I became a US citizen", "author": "u/adepojus", "score": 3873, "num_comments": 261, "created": "2024-11-15T02:45:34+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1grmeq4/today_i_became_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/j2iwqcb0bz0e1.jpeg"], "selftext": "I came into United States as an F-1 student in August 2015. I graduated in May 2017 and I started working June 2017. I got a job in the tech industry and my employer filed for my green card. I got my green card Oct 2019. \nApplied for citizenship, N400,July 31st 2024 online. I got the receipt notice same day and also a note that my previous biometrics would be used.\nApplied July 31st 2024\nReceipt notice: July 31st 2024\nBiometric reuse: July 31st 2024\nInterview scheduled: Oct 9th 2024\nInterview date: Nov 14th 2024\nCivics test, written and spoken test done Nov. 14 2024. Approved afterwards. Asked if I wanted to do oath taking and I said yes. Oath taking done an hour later. \nWishing everyone on this immigration journey success. ", "subreddit": "USCIS"}
{"post_id": "1gkfbph", "title": "Today I became a US citizen", "author": "u/Asteroids19_9", "score": 3688, "num_comments": 142, "created": "2024-11-05T19:40:39+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gkfbph/today_i_became_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/ejtng9ozy4zd1.jpeg"], "selftext": "I am a 19 year old student at college. It took me 12 years of wait time in India to get green-card approved by my grandma. On top of that, 5.7 additional years for N400, totaling roughly 18 years into the journey which has came to an end as my birth of citizenship has began on this wonderful day. Equivalent to Leclerc winning Monaco in 2024. \n\n\nKey notes about interview process: \n\nApril 5th submission\nApril 27th Biometrics appointment\nOctober 1st interview notice\nNovember 5th interview + oath\n\nI am open to any questions if you guys have!", "subreddit": "USCIS"}
{"post_id": "1glflxy", "title": "So, what now? An immigration attorney perspective ", "author": "u/Honest-Grape-9352", "score": 2898, "num_comments": 714, "created": "2024-11-07T02:01:16+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1glflxy/so_what_now_an_immigration_attorney_perspective/", "is_self": true, "image_urls": [], "selftext": "(Before I begin, I kindly ask that I not be DM'd for consultations. I am happy to provide firm or probono recommendations via DM, but nothing more). \n\nHi all, \n\nUsing a throwaway. I have been lurking here for a while without commenting anything, but I feel like I need to give my two cents given the amount of posts on this sub. Excuse any typos or grammatical errors. I am typing this while I am highly caffeinated and dealing with my own caseload. \n\nFellow immigration attorneys, please correct me if I'm wrong on any points. If you're not a legal professional, I do not want to hear it. \n\nFinally, none of this is legal advice. Please always consult with an attorney before making any decisions on your specific case. \n\n\n**1. Will DACA be taken away?**\n\nRemember, nothing can be guaranteed. Genuinely, no one knows what will happen. \n\nI will say that in my opinion, likely no-- the economy makes way too much money from DACA folks. I do believe that they will dangle it like a carrot to appease right-wing voters. Major corporations employ DACAmented folks. The SSN from work permits have allowed more tax revenue to come in. Too much is at stake. Legally, the legal arguments at the courts surrounding DACA involve constitutional rights, which themselves aren't going anywhere anytime soon. It's honestly just a topic that is often talked about, but hardly understood by many. \n\n**2. What about I-131F PIP?**\n\nAs of today (11/7), this has been revoked. \n\n**3. Will the mass deportations actually happen? Is it actually feasible?**\n\nI want to put this into perspective. There are 11 million undocumented immigrants in the US. Currently, DHS has about 92,000 officers, and ICE has about 21,000 officers. It is asinine to try to achieve this. \n\nLet's say it actually does begin and people are getting rounded up. Guess what? Not all undocumented folks are just undocumented-- many have TPS, pending asylum applications, pending T/U Visas, and work permits (see my point regarding #1). Unless a migrant has an expedited removal (not likely), DHS/ICE still needs to process each deportee, assign them A#s, and follow basic procedures. If they don't? That's a very easy way to reverse a deportation order. It's the equivalent of convicting someone of murder using a confession made under a very obvious 4/5th amendment violation. Slam dunk case. \n\nOh, and you know who has to handle all of these deportation cases? Federal DHS attorneys. They're already overworked, and they tend to exercise discretion. If no discretion, the overworked ones tend to gloss over cases and provide weak arguments. Only major attention is paid to serious crimes. You'd be surprised the amount of times DHS attorneys have gotten my clients' names wrong or made procedurally embarrassing typos. \n\n**4. What about ICE roundups?**\n\nThey still happen. Still need to follow procedures. If not, lawsuits and lots of deportation reversals. \n\n**5. Will there be a plan to denaturalize? Is it actually feasible? What about birthright citizenship?**\n\nSee #1 and #3. \n\n**6. What is likely to happen coming January?**\n\nIMO, the end of prosecutorial discretion in deportation proceedings will likely happen immediately. This means that DHS attorneys will have to prosecute all cases. However, see my point for #3. \n\n**7. What will happen to my pending USCIS case? What will USCIS do now?**\n\nVaries. USCIS is highly understaffed right now, and the backlogs are ridiculous. My guess is that between now and December, there will be a push to try to get as many I-485/N400s adjudicated before January. This may result in fees increasing for future applications. \n\n**8. Should I try to file my [insert case here] with the USCIS?**\n\nI cannot answer this. I highly recommend an attorney. Unless your case involves a complex immigration history (think border apprehensions, previous deportations, court hearings or USCIS interviews), probono organizations may be able to take your case. \n\n**9. Can greencards be taken away?**\n\nGreencard refers to lawful permanent resident status (aka \"LPR\"). LPR status is given under a plethora amount of reasons-- each have their own statutory and common law requirements. Yes, theonewhoshallnotbenamed definitely enacted policies that made obtaining these harder, but not impossible. Again though, to take an LPR status, the USCIS is required to issue a Notice of Intent to Rescind, and it would allow you to argue your case. \n\nAgain, USCIS is backlogged. When backlogs continue, immigration attorneys threaten mandamus lawsuits. Who has to handle these? US Attorneys. Guess what they will try to do? Try to dismiss as quickly and easily as possible, bringing the process back to square one. What do lawyers hate (among many things)? Their success ratings going down. \n\n**10. I legit think that they're gonna throw the whole rulebook away and just try to remove DACA, deport people, and do whatever erratically.**\n\nThen we'll cross that bridge if we get to it. IMO, I never underestimated THAT ONE and his team. They are strategic and play the irrational and ludicrous card very well. Do I think they actually want to achieve the above? Definitely. However, I don't think it will come from the White House necessarily. They'll try to slowly change the social and political atmosphere, beginning at home. \n\nThis means that the revolution starts at home. It starts in how we educate ourselves and each other. It starts by breaking generational curses and preventing history from repeating itself. It means raising our children better. It means being in community. \n\n**11. I want to leave the US.**\n\nI can't blame you. I cannot give any information on this, and this is beyond the scope of this subreddit. \n\n**12. So, what now?**\n\nAs naive as it is for me to say, I think good always wins. The right is banking on your apathy, despair, and helplessness. \n\n**13. I'm glad that this is all happening. We need stricter immigration laws.**\n\nWhy are you in this sub? Let me know when you've joined the Olympics though, because the amount of mental gymnastics you are doing to justify your ignorance should be enough to give you a gold medal. \n\n\nEDIT: WOW. Lots of questions. I promise to try to get to as many as I can. I am but a mere attorney trying to meet his billable hours and trying to comfort my immigrant parents at the same time. \n\n\nEDIT #2: I'm adding some extra points that might help cover the general theme of questions I've been getting: \n\n\n\n**A. What about Operation Wetback?**\n\nCrackdowns and ICE sweeps are still happening. Furthermore, they gotta be processed still. This means that they need to be in detention centers while ICE gets the proper paperwork from the deportee's home country (or Mexico), set up transportation, and deport them. Yes, this includes if it's even in a sweep and go type of crackdown. \n\nI don't underestimate the vile nature of THAT ONE and what he wants to do, but I mention the facts as someone who is heavily involved in this legal work. \n\n\n**B. What will change with my [enter type of application]? Do you think orangeblob will change it?**\n\nNo law has changed. This includes statutory and common law. Your case will move forward as is unless told otherwise. \n\nIn terms of likelihood-- again, look at #1 and #3. They can dangle the hateful rhetoric as a carrot to right-wingers all they want, but money talks the most.\n\n\n**C. Will family petitions change? Employment?**\n\nThey didn't during 2017-2021. They very likely will not change here. Major corporations, especially tech ones, rely on employment-based petitions heavily. \n\n\n**D. Everyone said don't worry and things got worse years ago. I'm scared.**\n\nThis is exactly what they want you to feel. This is their goal. This is why I made my post. Let this fear and grief transmute into courage and motivation for a better world for all of us. Overall, it's not attorneys or people in fancy suits that make the most change. It's the community leaders, the librarians, the students, the homeless shelter managers, and the barbers that know the names of everyone on the block. Hope is not lost. \n\n**E. I came here the “right way,” so everyone should follow the law/it’s only “illegals” that have to worry/any other unoriginal variation**\n\nDM me for resources on how to have better empathy. \n\n\n**EDIT #3 (FINAL EDIT).**\n\nFew more frequently asked questions: \n\n**F. Why do you think there will be a push to adjudicate AOS/N400? Isn't USCIS understaffed?** \n\nIt happened post election in 2016. Pragmatically, it was probably because USCIS was expecting a large influx of applications come 2017. They decided to increase the fees, but they needed to give proper notice and time for people to file AOS/N400. Thus, leading to a mass influx of applications. \n\nAs for adjudication: N400s are the last hurdle for most folks, and they're generally not as difficult to adjudicate as other applications. It's another application officers can remove from their plate. Immediate relative based AOS or AOS based on current priority dates (without inadmissibility issues) are also generally easy to adjudicate. Yes, they are understaffed, but sometimes USCIS can shift focus briefly to some applications.\n\nWill all of this happen come 2025? That's the hope. My naive side wants to believe that USCIS wants to make as many people residents and citizens as quickly as possible. There were a numerous amount of natz approvals in my firm right before the election. My guess is that they wanted people to vote.\n\nNow, do I think CONSULAR ones will also get pushed? No clue. That didn’t happen 2017-2021. See Item G below. \n\n**G. What about I-130s with priority dates? What will happen now?**\n\nThis type of question is complex for several reasons. (1) I-130s are provided for all sorts of reasons, both family and employment based, (2) It depends on the type, the country, and the field office handling this case and (3) It also depends if consular processing will need to get involved. \n\nRight now, nothing has changed. This means that the priority dates on the visa bulletins are ones to look at. \n\nWhat a lot of immigration attorneys do is if there's a valid reason to expedite (most common being a family medical emergency back home), then they request it. If that doesn't work, a threat of a lawsuit sometimes helps. If not, then we file a mandamus. The key to doing all of this is for when the I-130 has been pending for longer than the processing times. Keep in mind that US Attorneys are not a fan of mandamus because they are contractually required to take these cases, so they try to dismiss as quickly as possible. This usually leads to the government agency making their decision on the case.  \n\nNow, if consular processing is involved: Each consular office operates on their own timeline and their own procedures. They hardly post these procedures. Guatemala takes about 6 months, and Peru takes about 2 years. Some attorneys also threaten to involve the courts for delays here, but consulates are controlled by the Department of State, making this a bit more challenging. \n\nNow, the burning question: will the above change? Pragmatically, overrunning and delaying the above is a poor financial decision, and money talks. You don't wanna mess with the golden nuggets of massive corporations. Can it happen though? Yes. Orangeblob did make the process slower for folks, and yes RFEs were issued annoyingly often. However, there is always room for argument and litigation, so not all hope is lost. \n\nWhat about priority dates? Will they change? Priority dates vary on visa type, availability, and country of origin. There could be delays, yes. No certainty just yet. \n\n**H. What about [insert student or business related visa]?** \n\nI unfortunately do not have experience in this field of immigration law. I cannot give a proper educated answer. \n\n**I. What about asylum? Title 42?**\n\nToo soon to tell. Asylum interviews are in a massive backlog at the moment. In 2018, when DV/gang based claims were slashed, many asylum offices tried to help by \"stalling\" their decisions. It put people in limbo, but there was at least no referrals to court or initiation of removal proceedings. Will that happen here? Maybe, but again, too soon to tell. \n\n**J. If ICE starts rounding people up, am I next? Can I get picked up? What if I have an upcoming court hearing? Will they deport me?**\n\nThere is generally a priority system for ICE. They tend to be: those with pending removal orders (especially if removal order was based on criminal conviction) or those convicted of deportable crimes. \n\nIf you have a criminal conviction, do not freak out. Not all convictions are deportable ones. This is a specific legal definition that is too complicated for me to type out. If you were charged after 2010, you must be provided with full legal advice of any immigration consequences of a potential conviction. \n\nHaving an upcoming court hearing (even via a CBP One appt) doesn't necessarily make you a priority. Some of those hearings may be for pending asylum cases and there are no crim issues. \n\nEven if you have a previous deportation order, there are still options and there are still ways to fight a deportation. \n\nIf you're still scared about being on a priority, think of this: A cop is doing speed checks on a 65mph speed limit freeway. There are a lot of cars on the freeway. Who is he likely to go after? Someone going 67, 75, or 90? Someone with a pending removal order (especially due to a serious criminal conviction) is much higher up there. Remember, if you fall under this category, there are options and there are ways to protect you. \n\n**K. But what if [insert scary scenario]? These are all just legal protections, and he wants to get rid of all of this. He's a fascist.** \n\nRemember, they are banking on your anxiety and uncertainty. The need for certainty and comfort during turbulent times is human nature. What is also human nature is innovation, the quest for justice, and community. Even if the worst comes to light, you have so many folks who are on your side and ready to fight for you (not just attorneys). \n\nHere is another metaphor I like to use: In the show Supernatural, Lucifer knew that Sam was going to give consent to take over his body. He had the whole timeline planned, down to the smallest detail. You know what he underestimated? Sam's love for his brother, Dean. Sure, Lucifer could predict human behavior, but he could never outsmart it. I say this here as well: don't underestimate the love that people have for one another. (also, the first five seasons in Supernatural were the superior ones, and I will immediately block anyone who tells me otherwise).\n\n**L. I messaged you requesting recommendations for nonprofit orgs and firms. When can I hear back?**\n\nI will do what I can. I will most likely answer these questions over the weekend. Any specific legal questions, unless something urgently stands out to me, I will likely not be able to answer.  \n\n\n", "subreddit": "USCIS"}
{"post_id": "1ltlanr", "title": "Became a Citizen after 26 years!!", "author": "u/Ajax4557", "score": 2653, "num_comments": 165, "created": "2025-07-07T04:44:32+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ltlanr/became_a_citizen_after_26_years/", "is_self": false, "image_urls": ["https://i.redd.it/5d0ljp8jtdbf1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1lmkuyj", "title": "After 25 years, I can finally say, and with a lot of pride, that I am an American citizen 🎊🎉🇺🇸😭", "author": "u/liamthegooner", "score": 2443, "num_comments": 235, "created": "2025-06-28T11:45:04+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lmkuyj/after_25_years_i_can_finally_say_and_with_a_lot/", "is_self": false, "image_urls": ["https://i.redd.it/flrhy369on9f1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1kepdw8", "title": "Be careful out there", "author": "u/Mrkinkade", "score": 2423, "num_comments": 768, "created": "2025-05-04T17:31:34+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kepdw8/be_careful_out_there/", "is_self": false, "image_urls": ["https://i.redd.it/eety23l1wsye1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1i8arwf", "title": "Judge in Seattle blocks Trump order on birthright citizenship nationwide", "author": "u/lovetree77", "score": 2354, "num_comments": 144, "created": "2025-01-23T18:50:35+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i8arwf/judge_in_seattle_blocks_trump_order_on_birthright/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1h7t1fl", "title": "Disappointed in my country", "author": "u/Aggravating_Salad604", "score": 2199, "num_comments": 849, "created": "2024-12-06T04:22:52+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1h7t1fl/disappointed_in_my_country/", "is_self": true, "image_urls": [], "selftext": "I'm an American citizen who is filing for my spouse. I am former military and served in Afghanistan. We filed her adjustment of status through an immigration lawyer and got a receipt date of December 16 2023. We were originally going to do the paperwork ourselves but the complexity of the process scared us into asking a lawyer for help. We had one for a few months in because one of the required documents got lost in the mail, but otherwise the case has proceeded normally.\n\nHere is my rant:\nThe part of all this that I don't understand is the absolutely unjust processing times. The standard processing time for my type of case is 47 months...the standard time....I can't even ask them a question about the case until August 29, 2028? Look I get it, I've worked for government organizations, I know the pains of beaurocracy, but this is an inhuman way to treat people when you consider that all this time they are living in fear of deportation or not being able to safely see family and travel. If you don't have enough case workers, hire more....each case costs us thousands of dollars to submit, so I'm sure the money is there. I mean I guess I'm starting to understand the illegal immigration issue more now that I see how stupidly difficult it is to legally immigrate, and this is for a woman with a collage degree and history of working at an executive level in a nonprofit. I'm just very disappointed in my country, and I want to say sorry to everyone that has been suffering through this process for even longer than we have.\n\nEdit: for anyone still interested, my wife just had her Green card approved yesterday. It was a long and trying process, we even had our i485 denied at one point due to USCIS error, but we're able to get it fixed with an i290b. I know seeing the news every day is hard for those who are immigrating, and it's almost impossible to avoid the spread of fear but i hope that you don't lose hope, and are able to keep fighting for a place in this country. There may be some here that won't accept you, but not all, and i for one am glad that this country is not a place with only one culture because i believe we can all learn from each other and hopefully one day learn to love our differences. ", "subreddit": "USCIS"}
{"post_id": "1i68n9x", "title": "I’m here for you. Many of us are", "author": "u/KFelts910", "score": 2168, "num_comments": 892, "created": "2025-01-21T02:48:28+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i68n9x/im_here_for_you_many_of_us_are/", "is_self": true, "image_urls": [], "selftext": "Hey all - Immigration attorney here. It’s been a long day. A scary day. But I hope you know plenty of people like me are ready to fight back. I just got off a call with around 230 other immigration lawyers. We watched the EO’s drop in real time. We will do what we can for you. \n\nPlease be patient because we are finding out alongside the rest of the world. Also, please be kind. Many things will happen outside of our control and some people like me really take it to heart. We feel that loss or denial too. I promise you, that the outcome of your application/petition weighs heavily on my shoulders and mind. I’m here, in your corner.\n\nI can’t answer case specific questions without a consultation, for ethical reasons. But I’ll do my best to answer general questions on here. Hang in there everyone ❤️\n\nEdit: I’m trying to answer as many questions as I can before I try to get some rest. I’m exhausted, so if I don’t get to you tonight, I’ll circle back tomorrow. Hopefully with more information. For those who reached out to book a consult, I’ll also get back to you privately tomorrow. I appreciate you all!\n\nEdit 2: I am back and looking over all the new comments. I will answer as many as I can tonight.\n\nEdit 3: I am still working my way through guys! I will do my best not to leave anyone hanging. It'll just take me a bit, because of this amazingly huge response.\n\nEdit 4: 2/2/25 – I am going through more comments. I haven't had the time to come back as often, but I am still working through.", "subreddit": "USCIS"}
{"post_id": "1o0ktt1", "title": "I became a U.S. citizen today in Newark, NJ 🇺🇸", "author": "u/TeklaTch", "score": 2065, "num_comments": 204, "created": "2025-10-07T17:12:50+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1o0ktt1/i_became_a_us_citizen_today_in_newark_nj/", "is_self": false, "image_urls": [], "selftext": "I want to take a moment to thank everyone here on Reddit who shares advice, encouragement, and real experiences. \n\nWhether it was a post about interview tips, timelines, or just words of support, this community helped me more than you know!\n\nTo anyone still waiting, keep going. Your day will come.\n\nThank you, Reddit ❤️", "subreddit": "USCIS"}
{"post_id": "1g9ohqs", "title": "I’m officially a U.S citizen!! ", "author": "u/HeavyProcess3968", "score": 2044, "num_comments": 93, "created": "2024-10-22T17:56:41+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1g9ohqs/im_officially_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/xc85minojcwd1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1hgjfhj", "title": "Yesterday I became a US citizen 🇺🇸 ", "author": "u/chisocold", "score": 2016, "num_comments": 142, "created": "2024-12-17T20:03:09+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hgjfhj/yesterday_i_became_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/nhphgshatg7e1.jpeg"], "selftext": "Applied for citizenship: June 29, 2024.\nReceived interview notice: October 19, 2024.\nInterview Date: November 20, 2024 - Name Change Requested.\nOath Ceremony letter received: December 5, 2024.\nOath Ceremony: Yesterday- December 16, 2024", "subreddit": "USCIS"}
{"post_id": "1j83svb", "title": "I did it!! I’m an American!!!", "author": "u/SafinJade", "score": 1943, "num_comments": 266, "created": "2025-03-10T17:13:27+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1j83svb/i_did_it_im_an_american/", "is_self": false, "image_urls": ["https://i.redd.it/sodsv7zmawne1.jpeg"], "selftext": "Cranbury, NJ office. Super pleasant experience \nUnder general provision, 5.5 years LPR \nMy boyfriend was able to come into the building with me and I took the oath and received my certificate right after my interview. The whole process lasted about 3 hours \nJackie on YouTube helped me a lot, she has a whole channel dedicated to the n400 interview \nApplied: January 29th, 2025 \nSkipped biometrics \n\nAsk me any questions you have!! \nInterview and Oath ceremony: March 10th, 2025 ", "subreddit": "USCIS"}
{"post_id": "1id5eez", "title": "Perfect timing before Trump start mass deportation", "author": "u/skrchk1", "score": 1784, "num_comments": 297, "created": "2025-01-29T21:38:12+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1id5eez/perfect_timing_before_trump_start_mass_deportation/", "is_self": false, "image_urls": ["https://i.redd.it/sds5za7g50ge1.jpeg"], "selftext": "I came in USA under Ukrainian humanitarian parole in 2023 and won dv lottery in 2024. Field all papers in October 18 and got approved January 21 on the next day of trump presidency. ", "subreddit": "USCIS"}
{"post_id": "1mcy65a", "title": "PSA: Don’t claim to be a US Citizen until you are!", "author": "u/PrideAndRumination", "score": 1713, "num_comments": 402, "created": "2025-07-30T05:23:27+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mcy65a/psa_dont_claim_to_be_a_us_citizen_until_you_are/", "is_self": true, "image_urls": [], "selftext": "FO: Los Angeles, CA\n\nSharing something that left me absolutely gut wrenched for a young woman today… I would assume everyone on this sub knows this!!! But, if someone is just starting out their process… NEVER, under any circumstance claim to be a US citizen until you **are**!!\n\nI was checking in for my naturalization today and while standing in line, I overheard her talking to a man in the waiting room. She told him that the interviewer completely stopped the interview after asking “Have you ever claimed to be a US Citizen?” She said, “Yes, of course!” The officer apparently double checked, she answered to the affirmative. Interview concluded.\n\nWhat makes matters worse is that neither this young woman nor the man she was talking to seemed to understand the gravity of what just happened… I swear that the color left my face, heat left my body, and my heart skipped a few beats for this poor woman. Correct anyone that makes that assumption, never put it on paper, never allow the DMV to rush through that section, and just erase that word from your vocabulary in reference to yourself. ", "subreddit": "USCIS"}
{"post_id": "1jcn9ty", "title": "He voted for Trump. Now his wife sits in an ICE detention center.", "author": "u/ddxv", "score": 1660, "num_comments": 413, "created": "2025-03-16T14:57:18+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jcn9ty/he_voted_for_trump_now_his_wife_sits_in_an_ice/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1l8514s", "title": "Today I became an American 🇺🇸", "author": "u/AccurateTopic", "score": 1546, "num_comments": 127, "created": "2025-06-10T17:38:24+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1l8514s/today_i_became_an_american/", "is_self": false, "image_urls": ["https://i.redd.it/cezecm5zy46f1.jpeg"], "selftext": "Long journey but finally happy to be an AMERICAN 🇺🇸 (Journey below)\n\nOath ceremony today at Tampa FO. Nothing too crazy, the only other poignant moment is that we were there for the judges’ last ever oath ceremony as he was retiring on Friday. The video they played in stark reflection to the events happening in the US is quite a reminder of the terrible events happening right now. \n\nGonna register to vote. ✅\nPassport appt next week. 🛂\nReady to fully embrace being an American. 🇺🇸 \n\n\nMy journey:\n\nCategory: K-1 (U.S. citizen filing for a fiancé(e))\n\nTotal Days: 2847 days\n\nI-129F\nStart: Aug 24, 2017\nDecision: Feb 22, 2018\n@California Service Center\n\nI-485\nStart: Aug 03, 2018\nDecision: Feb 25, 2019\n@National Benefits Center\n\nI-751\nStart: Jan 14, 2021\nDecision: Jun 15, 2023\n@Potomac Service Center\n\nN-400\nStart: Nov 11, 2024\nDecision: Jun 10, 2025\n@National Benefits Center\n\n● Aug 24, 2017 / I-129F / Submission to USCIS\n● Feb 22, 2018 / I-129F / Decision (Approval or Denial)\n● Aug 03, 2018 / I-485 / Submission to USCIS\n● Feb 25, 2019 / I-485 / Decision (Approval or Denial)\n● Jan 14, 2021 / I-751 / Submission to USCIS\n● Apr 02, 2021 / I-751 / Biometrics, i.e. fingerprint and photo\n● Jun 15, 2023 / I-751 / Decision (Approval or Denial)\n● Nov 11, 2024 / N-400 / Submission to USCIS\n● May 15, 2025 / N-400 / Interview\n● Jun 10, 2025 / N-400 / Oath Ceremony\n", "subreddit": "USCIS"}
{"post_id": "1jhpoak", "title": "Had a surreal GC interview", "author": "u/Educational-Salt-979", "score": 1466, "num_comments": 256, "created": "2025-03-23T02:55:39+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jhpoak/had_a_surreal_gc_interview/", "is_self": true, "image_urls": [], "selftext": "I just had my GC interview and wanted to share my experience. Won't give some details because I don't want to give the officer any troubles.   \nWe(My husband, US born and I) arrived at the building 20 minutes early. Obviously neither of us knew what to do or where to go once we got to the building. I wouldn't say the security guards were \"nice or friendly\" but they were helpful and didn't have any bad attitude. \n\nAfter waited a little over one hour in the waiting area, an officer called us in to the office. Once we got to the officer's office, I handed over my documents. The officer glanced over some of them, then said \"so tell me how did you two meet? Let's start with you (my husband)\". After he barely walked over 1 minute, that the officer said \"I've heard enough, congratulations your case is approved.\" Mind you, we have barely spent 5 minutes total by this point. The officer still had to do some case updates so we spent 20-25 minutes in the office total. Meanwhile we were talking about TV shows, movies, and other stuff. We all forgot we were at a GC interview for the whole entire time. I know I am very very lucky to have this officer. The officer even said how he didn't like the current administration so maybe it has more to do with that. ", "subreddit": "USCIS"}
{"post_id": "1m98nik", "title": "I became a US citizen today, 8 year timeline", "author": "u/doomscrolldamsel", "score": 1467, "num_comments": 98, "created": "2025-07-25T19:35:27+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1m98nik/i_became_a_us_citizen_today_8_year_timeline/", "is_self": false, "image_urls": ["https://i.redd.it/xxo0cy7wo2ff1.jpeg"], "selftext": "Originally a Mexican citizen, Took around 6 months from application to ceremony, 8 years total from my first application: CR1-ROC-naturalization. (Almost 2 years waiting for the first interview, thanks Nebraska! followed by COVID and divorce, hence the timeline ) USCIS San Antonio in general was a pleasant experience and everyone there was kind and congratulatory. \n\n I’ve worked relentlessly to be here. I know I’ve earned this, and I'm proud, but I also have mixed feelings. \n\nI can't ignore the bitter undercurrent: the fear, the uncertainty. but maybe that’s exactly why this still matters.\n\nWhat’s more American than showing up, using my freedom of speech and being a tiny part of helping push this country to live up to its promises and potential? What’s more patriotic than holding space for discomfort, demanding better, and fighting for the life you’ve worked hard to build, not just for yourself, but for others like you?\n\nI walked into this ceremony with gratitude in my chest and a little grief in my heart. I’m not naive to what’s broken, but I’m also not backing down from what’s possible. Good people exist. I’ve met them, so many of them have made it all worth it. \n\nI know I'm privileged, I get to celebrate this when so many can't. I plan to carry my love for this country, and my place in it, wherever I go.", "subreddit": "USCIS"}
{"post_id": "1hbn8xf", "title": "For the people who say ‘immigration is a privilege not a right’", "author": "u/Vanish49", "score": 1449, "num_comments": 718, "created": "2024-12-11T06:18:01+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hbn8xf/for_the_people_who_say_immigration_is_a_privilege/", "is_self": true, "image_urls": [], "selftext": "A green card is literally a permit to work and contribute to the economy. After 8 years of being a researcher, I have:\n1) paid full taxes without receiving social security benefits like citizens\n2) worked at lower salaries while contributing towards R&D at an Ivy league\n3) experienced life in 3 american cities without having the right to vote\n\nIt is not a privilege. It is a choice that both parties make. Immigrants contribute heavily to the economy without receiving full benefits. So don’t come at us for being entitled when the system is depriving us from a fair chance of making this decision. \n\nEdit: I guess I wasn’t clear enough. In the entire post, I never once said ‘immigration is my right’. I said it’s a choice so maybe people can get over the privilege vs right reductionist argument. ", "subreddit": "USCIS"}
{"post_id": "1j8b2yn", "title": "Judge blocks removal of Palestinian activist who was detained at Columbia University", "author": "u/Mobile_Pick4709", "score": 1375, "num_comments": 196, "created": "2025-03-10T22:15:34+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1j8b2yn/judge_blocks_removal_of_palestinian_activist_who/", "is_self": false, "image_urls": [], "selftext": "\"A federal judge has blocked the removal of a Palestinian activist from the United States while weighing a petition challenging his arrest, court documents show.\n\nMahmoud Khalil was arrested by Immigration and Customs Enforcement at Columbia University over the weekend, despite having a green card, his attorney told ABC News, sparking an outcry from civil rights groups. His attorneys subsequently filed a habeas corpus petition challenging his arrest.\n\n\"To preserve the Court's jurisdiction pending a ruling on the petition, Petitioner shall not be removed from the United States unless and until the Court orders otherwise,\" Judge Jesse Furman wrote in a notice ordering a conference for Wednesday morning in the case.\"", "subreddit": "USCIS"}
{"post_id": "1ln28rc", "title": "This letter seems fake. I don’t know what to do", "author": "u/nintaibaransu", "score": 1365, "num_comments": 573, "created": "2025-06-29T01:00:55+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ln28rc/this_letter_seems_fake_i_dont_know_what_to_do/", "is_self": false, "image_urls": ["https://i.redd.it/r4scemlcmr9f1.jpeg"], "selftext": "This letter was sent to my 3 year old nephew", "subreddit": "USCIS"}
{"post_id": "1lwgh90", "title": "Greencard interview went nothing like expected", "author": "u/Massive-Ad-1124", "score": 1356, "num_comments": 172, "created": "2025-07-10T16:01:37+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lwgh90/greencard_interview_went_nothing_like_expected/", "is_self": true, "image_urls": [], "selftext": "My wife and I got married in 2022 but due to financial reasons and her needing to get her official documents, we didn’t file until January of this year.\n\nThis, along with the IRS not processing my 2022 taxes, me getting laid off in 2023 and being out of work for 5 months, not having many documents showing we share financial assets (cars are in my name, bills are in my name, and we live month to month), and her accidentally violating her visa made us think our interview was going to be a long, grueling, drawn-out process.\n\nFor weeks, we were studying every chance we got, trying to prepare for the tough questions and the intimidation tactics we thought they’d use on us.\n\nBut our interview was NOTHING like we anticipated.\n\nWe went in on 7/3 and were there for no more than 5 minutes tops. The officer was super nice, soft-spoken, and understanding. All they did was fingerprint her, ask if she had ever been in any clubs in her original country or done any military service, and then he said, “You’re approved.”\n\nMy face must’ve looked so dumb because right after that he smiled and said, “Yeah, I know… anticlimactic, right?”\n\nI was so stunned that as we were leaving, I was low-key looking around for ICE agents to grab my wife for whatever reason lol. \n\nOn 7/6 her case showed “approved” online. And around 12 AM on 7/10 it updated to say her green card was being sent.\n\nI’ve been reading these posts for months since we sent in our application, and I know not everyone’s case is this smooth. But I wanted to share our story to give hope to others. In my experience, it wasn’t nearly as daunting as I expected. her greencard was being sent.  I've been actively reading these posts since we had sent our information to USCIS. I'm aware everyone's case wasn't as easy as ours, but I want to share my story just to give some other people hope. In my experience, it wasnt nearly as daunting as I was expecting", "subreddit": "USCIS"}
{"post_id": "1kyta7c", "title": "I’m officially a U.S. citizen! 🇺🇸", "author": "u/vaaalfeeer", "score": 1329, "num_comments": 153, "created": "2025-05-30T02:36:08+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kyta7c/im_officially_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/7basx5kzzt3f1.jpeg"], "selftext": "I’m incredibly proud and excited that I am now officially a United States citizen!\n\nIt’s been a long journey full of ups and downs, but I’m feeling incredibly proud and grateful. This means a lot to me.\n\nTimeline: \nMarch 7, 2025: File N-400 form with USCIS.\n\nMarch 11, 2025: Receipt Notice.\n\nMarch 13, 2025: Biometric Reuse notice.\n\nApril 9, 2025: Interview Scheduled notice.\n\nMay 14, 2025: Interview at USCIS Field Office.\n\nMay 28, 2025: Oath Ceremony.\n\n\nInterview was super easy, it lasted less than 20 minutes. The officer was very professional and nice, he started with the tests and then asked me a few questions about my N-400. He approved my application and told me I would receive a letter in the mail with next steps. \n\nFor the civics test, the officer asked the following questions:\n1. Who is your US representative?\n2. Where is the Statue of Liberty?\n3. Who vetoes bills?\n4. What ocean is on the east coast?\n5. Name two US National Holidays\n6. What is the supreme law of the land?\n\nGood luck to everyone who is going through this journey, stay strong!", "subreddit": "USCIS"}
{"post_id": "1lowdvd", "title": "People who said Project 2025 was a media hoax, how’s it going?", "author": "u/trumppardons", "score": 1324, "num_comments": 296, "created": "2025-07-01T08:31:37+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lowdvd/people_who_said_project_2025_was_a_media_hoax/", "is_self": true, "image_urls": [], "selftext": "https://www.project2025.observer/\n\n40%+ of its ideas have now been implemented. Multiple writers are in the cabinet. \n\nPeople who kept saying, “It’s a nothingburger”, “It’s a CNN hoax”, how are y’all coping? \n\nThe ones who said “Stop being hysterical, we don’t know anything yet”, do y’all know now? Have you seen enough?", "subreddit": "USCIS"}
{"post_id": "1jhz4yc", "title": "Does anyone know if this is really true?", "author": "u/FinalDistribution186", "score": 1282, "num_comments": 539, "created": "2025-03-23T13:22:01+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jhz4yc/does_anyone_know_if_this_is_really_true/", "is_self": false, "image_urls": ["https://i.redd.it/3p2tgpj8xfqe1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1ngsxsx", "title": "Some Thoughts on USCIS From A (Soon-To-Be) Former Officer and Supervisor", "author": "u/WatkinsImmigration", "score": 1254, "num_comments": 249, "created": "2025-09-14T14:37:38+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ngsxsx/some_thoughts_on_uscis_from_a_soontobe_former/", "is_self": true, "image_urls": [], "selftext": "TL;DR: An understaffed and demoralized USCIS being turned into another immigration enforcement arm means more delays, denials, and inconsistent adjudication.\n\n My background: I came to USCIS as a burnt-out attorney in 2015 and I’ve been with USCIS just over 10 years; the first 7 as an officer (ISO) and the last 3 as a supervisor (SISO). I started with the National Benefits Center (NBC) in Lee’s Summit, MO in 2015 and initially, I mostly adjudicated family based (FB) adjustment of status (AOS) applications and associated ones like I-765 and I-131. I also worked or had experience with I-290b, I-360 SIJ, I-140 EB1A and B, employment based (EB) AOS, and a whole lot of customer service positions (congressional liaison, USCIS HQ contact, SRMT team). My last few years as a supervisor were spent as the main point of contact (POC) for parole-based work permits (I-765 C11s). I would love to write up a separate post on that experience sometime.\n\nIn April of this year, USCIS offered up a deferred resignation program (DRP), basically a copy of the infamous “Fork” offer DOGE and those clowns offered up to most of the federal government in Feb. USCIS exempted itself from the original DRP, but decided to offer it up along with early retirement and cash buyout payments. I was already planning on leaving the agency for a variety of reasons but decided to take advantage of this offer and was placed on paid, administrative leave 5/4/25 and will officially be separated on 10/4/25. At that point, I’ll be back practicing immigration law and doing my best to continue helping people navigate our purposedly complicated immigration system.  \n\nWith that introduction out of the way, I’d like to offer some thoughts on USCIS as it is now, and maybe more importantly, where it’s headed over the next few years and what all of it means for applicants. There are also a lot of current and former USCIS employees lurking here including some former colleagues, and they may have a different viewpoint than me on some things. So this is just me talking in my personal capacity, not on behalf of the agency or other employees of the agency.  \n\nUSCIS, like any large organization, can only complete its mission when it has a skilled, motivated, and engaged workforce. It’s taken a huge hit to all three of these since Trump 2.0 came into office. Many of the best and brightest throughout the agency left; I believe it’s been between 2,500 and 3,000 departures since 1/20/25. This represents around a 10% reduction in the agency’s headcount. A lot of the people who left had decades of experience and/or skills and abilities not likely to be replaced easily. The employees left behind are now overworked, stressed, and unmotivated due to draconian workplace changes such as RTO and flexible schedules eliminated (USCIS had successfully and broadly implemented telework since the early 2010s). We’re talking about cramming officers who’ve worked successfully for years at home into conference and breakrooms with only their laptops. A hiring freeze affecting most positions in the agency also means most open positions are not, and will not for some time, be filled. The Agency terminated the collective bargaining agreement with the Union in August, another major blow to what was left of morale. There are still many great people left at USCIS, people who want to do their best and will continue to do their jobs effectively no matter how hard this admin makes it. There are still strong leaders left who continue to work hard for their employees and the applicants who pay their salaries. But it’s not an exaggeration to say that morale is at rock bottom and there doesn’t appear to be much hope for improvement at this point in time.\n\nUSCIS went from a low point in morale in the summer of 2020 (Trump 1.0 with new USICS Dir. Joe Edlow then serving as de facto acting director) with a hiring freeze and proposed 70% employee furlough, to a high point in 2024 (generous admin leave given by Sec Mayorkas and record bonuses/time off awards, a director who actually cared and engaged with employees), and now back again to a new low in morale. It’s certainly possible some ISOs may be happier now; some field office ISOs may never have teleworked and/or enjoy issuing NTAs more now. But I think for the vast majority of agency employees, it’s now become just another job. They are villainized by their own leadership (Sec Noem on down), any work/life balance taken away, and being made to do additional work that doesn’t help them, the American people, or their applicants. There’s a reason why the government wide employee satisfaction (FEVS) survey was suspended this year!    \n\nPolicy-wise, USCIS has been abruptly shifted from its true purpose and mission of adjudicating immigration benefit requests to an enforcement support arm for which it has no congressional mandate and to be blunt, no desire for as well. This means more vetting in the form of digging in more to applicants’ backgrounds, social media history, ect. It also means a lot of the processing efficiencies the agency realized under Biden are starting to be disregard or cancelled entirely. Streamline Case Processing (SCP) is an automated adjudication process used on I-90 and I-765s mostly and allows for cases to be adjudicated without any intervention by an officer, if that case passes a checklist built out to determine eligibility. To give an idea of the impact and success of this process, in fiscal year 2024, the NBC was able to adjudicate roughly half of their I-765 receipts through this process. It did the equivalent work of almost 80 officers! One of the first directives of the new political leadership of the agency was to turn off this automated processing for several months. It’s reportedly restarted SCP, but with additional vetting enhancements resulting in fewer cases making it through the various workflows. And this is what they want; not efficiency or improvement, but roadblocks disguised as “enhanced vetting.”   \n\nLooking ahead now to the coming years, USCIS will likely be under immense pressure to continue supporting ICE and the admin’s deportation machine, all the while its pending case counts continue to grow. That means more USCIS employees detailed out to ICE and CBP and more time spent by officers on “vetting” that adds no benefit to the adjudication process. Hundreds of new Special Agent positions with law enforcement powers have been announced; where the funding for these positions comes from is a question mark (e.g. from applicant fees?). There’s a chance backlogs may not get as bad as they were in the past, solely because we may be seeing much lower levels of immigration. There also will be continued policy changes aimed at slowing down or eliminating entirely certain benefit categories. Work authorization is one area where this admin is focusing on with the goal of making otherwise eligible applicants lose their work authorization in the hopes they self-deport. De-naturalization will likely be another top priority for the agency. This process involves a huge amount of time and resources that will need to be diverted away from adjudication. The last time the agency stood up this type of task force, there were dozens of highly paid and experienced officers (GS13 pay grade and above) working full-time on this; this time it will likely be an even larger effort.  \n\nFinally, what does all of this mean for those of you trying to “come the right way” and those of us whose job is to help you do that? Delay, confusion, and inconsistency. This needs to be said in absolute, crystal-clear terms: this administration wants as little legal immigration as possible. They know they cannot completely stop immigration, so they instead will focus on making it as expensive, slow, and miserable for people as they can. I promise you that what gets reported in the news, be it a new policy or requirement, is just a small sampling of the ways this administration is telling the agency to make things more difficult and/or slower. \n\nMy best advice for anyone submitting anything to USCIS: Quality over Quantity. Present your strongest evidence prominently and make sure it is done in a clear and concise manner. Former USCIS Director Jaddou made this point this past Spring shortly after leaving during a round table discussion with AILA. Look at your filing through the eyes of stressed, overworked, and de-moralized officer. Is everything submitted easy to find, to understand, to clearly show you are eligible for the benefit sought? Is it easy for that officer to get to “yes?” (Funny enough, USCIS director Edlow gave an interview saying he did not want officers to “get to yes,” but he also did not “NECESSARILY want a ‘get to no’ either” which basically gives away the game of what he wants to agency to focus on).\n\nAnd a note on attorneys/representatives: the agency has always had difficulties in tracking and preventing fraud and misrepresentations from attorneys and those purporting to be attorneys. It would take YEARS in most cases for the agency to bring a case against a fraudulent attorney and now, with a shift in focus on removals, there’s even less attention paid to this increasingly common form of immigration fraud. The agency has said it wants to go after fraudulent attorneys, but to them, that means attorneys filing fraudulent (in their eyes) claims, not attorneys (or purported attorneys) defrauding clients. Two things every applicant should do if wanting to engage the services of someone purporting to be an attorney: 1) the person should disclose what jurisdiction they are licensed in and the applicant should check with that bar authority to confirm they are in fact licensed and in good standing. 2) Make sure the attorney actually has experience with the type of case you are seeking representation for. After tax law, immigration law is generally considered the most complex. An attorney holding themselves out to practice “immigration law” in general may not be the best to represent you in your specific matter. You wouldn’t want a removal defense specialist to file your Eb1A I-140 or a business immigration attorney to file your I-601A waiver, for example.\n\n I do hope this post is helpful to some and if there’s any interest, I could see about doing some AMAs later on once I’m officially separated from the agency.", "subreddit": "USCIS"}
{"post_id": "1gt0583", "title": "Greened! My girlfriend gifted me this cake to celebrate", "author": "u/Ikim11", "score": 1227, "num_comments": 46, "created": "2024-11-16T23:35:16+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gt0583/greened_my_girlfriend_gifted_me_this_cake_to/", "is_self": false, "image_urls": ["https://i.redd.it/l93gdclvmc1e1.jpeg"], "selftext": "For all those skeptical about the mass interview waivers this week, I got my I-485 approved the day after - hope all of yours will come soon!\n\nBackground as I know it is of interest:\n- Submission June 21st 2024\n- Employment based (EB1C)\n- Submitted in Texas\n- Approval date November 15th 2024", "subreddit": "USCIS"}
{"post_id": "1gpo7nf", "title": "Trump and denaturalization ", "author": "u/Hellraiser626", "score": 1205, "num_comments": 630, "created": "2024-11-12T16:08:23+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gpo7nf/trump_and_denaturalization/", "is_self": true, "image_urls": [], "selftext": "People here and all over social media need to get a grip and come back to reality. The fear mongering have been of the charts. And the worse part is that some influencers have been using these fear mongering tactics to get views. You won't get stripped of your citizenship or permanent residency for no reason. And don't get me started on people born in the US acting like they'll get stripped of citizenship just cause their parents were immigrants. I dislike Trump but Jesus Christ people, get a grip. There are millions of undocumented people and they can't even deport those people, what makes you think citizens or permanent residents are getting deported. Now if you are out of status, then the worrying is definitely valid. ", "subreddit": "USCIS"}
{"post_id": "1lxilkc", "title": "Finally became a citizen after being in the US for 8 years!", "author": "u/YinYang09", "score": 1155, "num_comments": 99, "created": "2025-07-11T21:14:07+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lxilkc/finally_became_a_citizen_after_being_in_the_us/", "is_self": false, "image_urls": ["https://i.redd.it/jre6hfaq9bcf1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1jkk6h0", "title": "My Dad detained and transferred 5 Times by ICE — Here’s how it’s going", "author": "u/Double_Lunch_413", "score": 1151, "num_comments": 329, "created": "2025-03-26T19:22:07+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jkk6h0/my_dad_detained_and_transferred_5_times_by_ice/", "is_self": true, "image_urls": [], "selftext": "My dad was detained on March 3. In these three weeks, he’s already been transferred five times by ICE. He started in New Hampshire, then was moved to Vermont, then to MA, then to conroe, Texas, and now he’s in Houston. It’s been a lot.\n\nHe has no criminal record entered the country with a tourist visa and has been married for 7 years to a lawful permanent resident. His I-130 was approved a few years ago and then he’s previous lawyer which is another story filed for the waiver (I-601A), he took fingerprints and that’s where the case was when detained.\n\nOur lawyer just filed a bond motion, but we had originally sent documents to Texas before realizing that court didn’t have jurisdiction. since just today the EOIR system updated and showed the actual court (Three weeks after being detained).\n\nWhat surprised us is that even though he’s physically in Texas now, his immigration case is still being handled in Massachusetts. So even though he’s been moved across the country, his hearing is virtually from Texas “if he is not transferred again” with a Massachusetts judge. We’re now just waiting for the bond hearing to be scheduled, he already has a master hearing for June which we are trying to expedite as well.\n\nThey don’t have access to their belongings so is they don’t know a phone number it gets complicated since the facilities don’t have much information and is really hard to communicate with ice.\n\nJust sharing this in case anyone else is going through something similar. It’s confusing and frustrating, but you’re not alone. Happy to answer questions if anyone’s dealing with a similar case.", "subreddit": "USCIS"}
{"post_id": "1n3nb9t", "title": "I'm finally a US citizen", "author": "u/Mountain-Goatz", "score": 1132, "num_comments": 115, "created": "2025-08-30T00:01:24+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1n3nb9t/im_finally_a_us_citizen/", "is_self": false, "image_urls": [], "selftext": "Saint Louis FO\nWe were the second batch that day we have 50 new citizens on every batch. From 50 new citizens it came all from 22 different countries. \nIt's a fast program. I have my appointment at 10am but it didn't start till 1130am. Finished about noon. \nThere's some booths outside the court room for voting. \nI submitted my n400 at the end of March and interview on mid June then naturalized on the end of August. \nFeel free to comment or message me if you have any questions. I'd love to share it. ", "subreddit": "USCIS"}
{"post_id": "1idbewv", "title": "Granted asylum today and it’s my favorite part of the job.", "author": null, "score": 1136, "num_comments": 219, "created": "2025-01-30T02:06:13+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1idbewv/granted_asylum_today_and_its_my_favorite_part_of/", "is_self": true, "image_urls": [], "selftext": "I interviewed an applicant two weeks ago. Since we have gone back to in-person service, I was able to be there when they received their decision from our office. Myself and the officer helping interpret both remarked how amazing it feels knowing we saved lives today because the people I granted could not return to their country. \n\nFor those of you seeking asylum, waiting for interviews or decisions, hang in there. The majority of us doing these jobs are doing it for the right reasons. Most of us care about humanity. \n\nEDIT: I would like to say thank you so, so much for all the kind words and awards. I do this job because I truly love and I shared the above story because I wanted to share hope, and also, because sometimes I need to be reminded of what I get and and go to work for every day. \n\nI appreciate all the questions as well. However, I want to let everyone know, there are some questions I simply don’t know the answer to because immigration is a vast system and I work in a relatively small part of it. Also, there are other questions I’m just not allowed to answer because it would violate my oath and the ethics of my job. I will say this, as a piece of non-legal advice: no matter what benefit you’re applying for, no matter the reason you’re applying, just be honest. Just answer all questions as truthfully as possible. This seems so common sense, but it is fundamental to this process. \n\nSomeone asked if I was worried about being doxxed or threatened. Someone else showed concern for my job. I want to say thank you for thinking of those things and for being concerned. The short answer is no, I’m not afraid. I say that because I do my job, I work very, very hard, and I follow the rules and laws of immigration. I am not afraid of someone trying to get me fired, because I can prove I work hard and I uphold my oath to the constitution. That being said, if there’s ever a question, I will fight like hell. I’m a disabled vet, we know what it means to fight for our rights and justify our existence. Plus, I’ve had someone trying to get me fired for years, from other agencies even, and they’ve failed consistently. Ha. But, again, it’s hard to fire someone who does their job. \n\nThank you for your kindness. Go forth and spread it around to the rest of humanity. 💜", "subreddit": "USCIS"}
{"post_id": "1kms5xq", "title": "I became a us citizen today!!", "author": "u/Superb-Teacher4597", "score": 1128, "num_comments": 134, "created": "2025-05-14T22:14:27+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kms5xq/i_became_a_us_citizen_today/", "is_self": false, "image_urls": ["https://i.redd.it/lxmf7fmmnt0f1.jpeg"], "selftext": "Started my process for citizenship back in oct 2024, a month ago i had my interview and today i had my oath ceremony!! I am so so happy. Good luck with your process everyone.", "subreddit": "USCIS"}
{"post_id": "1ipk8wn", "title": "Please have empathy for people whose status/programs are being canceled", "author": "u/bureaucranaut", "score": 1122, "num_comments": 194, "created": "2025-02-14T20:33:21+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ipk8wn/please_have_empathy_for_people_whose/", "is_self": true, "image_urls": [], "selftext": "I'm seeing some folks on the subreddit express indifference or even applaud that certain visa/status programs are being canceled. I ask you to have empathy toward those who are being affected by these upheavals, or in the very least to not gloat when this happens. We are all here because we ourselves or our loved ones are going through (or have gone through) the US immigration system. We know how much of an agonizing, protracted limbo it can be, and how it can turn your life upside down. As people with first-hand experience of the system, we should be supportive of each other regardless of visa/status.\n\nIf you think that other people being pulled off the queue will benefit you in some way, you are mistaken. This is not an administration that thinks \"we want to keep having an X number of immigrants a year, and therefore we will re-allocate the spots to other categories in lieu of the programs that have gone away.\" They just don't like immigrants, maybe unless you're white European or [South African](https://www.cbsnews.com/news/trump-orders-u-s-refugee-resettlement-of-afrikaners/). Those spots are just gone and they're not going to fill it with anyone else. This administration is also perfectly happy to let USCIS capacity wither with[ their hiring freeze and unreasonable RTO mandates](https://www.reddit.com/r/USCIS/comments/1ioo19h/comment/mcln804/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) so we're not going to see faster processing times.\n\nYou might say, \"I'm going through the process legally, I'm not like those illegal immigrants or TPS holders.\" Right now they're starting with the low-hanging fruit. If you've been following what's going on, it should be a clear reminder to all that 1) many immigration benefits exist by executive fiat, 2) the White House exercises tremendous influence over how USCIS is run, and 3) this administration has a flagrant disregard for anything enshrined in the letter of the law as enacted by Congress or as [interpreted by the courts previously](https://en.wikipedia.org/wiki/United_States_v._Wong_Kim_Ark). Unless you're already a US citizen, we are all one executive order away from having our status challenged or jeopardized in various ways, if not outright revoked. I don't want to fearmonger but this is the reality that has been exposed.\n\nSo what can we do to support each other, especially if you cannot vote? You could talk to family and friends who can vote to educate them on misconceptions around immigration issues. If you're able to, please consider donating to immigration advocacy nonprofits. Otherwise, I think a little kindness and empathy toward others on their immigration journey goes a long way. Please keep in mind the reason the immigration system remains broken today is not because of other people in the line, but because of indifference/hostility of the general voting public.\n\nThank you for coming to my TED talk.", "subreddit": "USCIS"}
{"post_id": "1lkxi2b", "title": "No F,M,J Visa if your social media is private", "author": "u/MoveSalt6450", "score": 1115, "num_comments": 263, "created": "2025-06-26T11:16:07+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lkxi2b/no_fmj_visa_if_your_social_media_is_private/", "is_self": false, "image_urls": ["https://i.redd.it/q8ajecbd999f1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1ji9lcj", "title": "Deportation order removed", "author": "u/Sensitive-Tourist511", "score": 1112, "num_comments": 63, "created": "2025-03-23T20:58:46+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ji9lcj/deportation_order_removed/", "is_self": true, "image_urls": [], "selftext": "Just wanted to post here….My stepdaughter(21 from el salvador got caught coming across when she was like 9 and her dad totally fucked up original immigration court stuff and resulted in her getting a deportation order)….we got her deportation order removed. Filed it in December. Original filing was rejected last year…refiled another motion and my wife had received her green card by the 2nd time so we used that and my veteran status for parole in place for my stepdaughter….we originally filed petition stuff when she was under 18 along with my wife’s original paperwork. Idk i be scrolling on this thread and figured maybe this would give somebody hope thats lost it or something 🤷🏻‍♂️🤷🏻‍♂️🤷🏻‍♂️🤷🏻‍♂️", "subreddit": "USCIS"}
{"post_id": "1iz7f7o", "title": "Finally a citizen at 38 years old! (21 years in the making)", "author": "u/Hizzort", "score": 1080, "num_comments": 63, "created": "2025-02-27T04:22:40+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1iz7f7o/finally_a_citizen_at_38_years_old_21_years_in_the/", "is_self": false, "image_urls": ["https://i.redd.it/ayoc3dp4zlle1.jpeg"], "selftext": "It took so long but I’m finally a citizen! I moved here under my my dad’s visa when I was 4 years old so the US has been my home for as long as I can remember. \nLong story: My parents got their citizenship a month after I turned 18 so I was basically on my own to make it happen. As you can imagine, at 18 as a super poor college student the 7 or 800 dollar fee to apply was a ton of money (twice my rent back then!) so it was on the back burner. I finally got to a place where that fee was not a big deal and you-know-who got elected in his first term and it scared me. I, of course, realize that I have privilege being caucasian but I was also arrested for petty theft as a bored teenager at 17 years old (tried as an adult in Texas) so I was advised to not seek it during that time. Fast forward to the new administration and BOOM covid and everything was at a standstill (including my greencard renewal which took forever). \nI finally got my interview in January, got approved on the spot and today was the day. It was a beautiful ceremony with almost 800 immigrants in an arts theater in downtown Oakland, CA coming form 79 different countries that were all individually recognized and applauded and cheered for.\nI definitely got emotional several times because of how long this journey has been to just feel a part of the only country I have known as home. \n\nFeel free to AMA, I’m an open book 🩷", "subreddit": "USCIS"}
{"post_id": "1mbwb9n", "title": "After almost 40 years, I’m finally a citizen 😭", "author": "u/Glorialovestacos", "score": 1073, "num_comments": 107, "created": "2025-07-28T23:48:29+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mbwb9n/after_almost_40_years_im_finally_a_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/dnmuxsurcpff1.jpeg"], "selftext": "I’m still shocked and it feels like a fever dream, but I’m so grateful this is finally over. I did my interview in San Francisco and I lucked out with the kindest immigration officer. She really eased my anxiety. No line, but long wait… They seem understaffed. I passed and took the oath on the same day! It seems like they do the oath a couple of times a day so I did my oath at 2:30 PM. Feel free to ask me anything about the San Francisco location/experience.\n\nTimeline:\n\nMarch 3 - submitted N-400 application\n\nNo biometrics needed (they used previous ones on record)\n\nJune 20 - received notice that my interview was scheduled\n\nJune 25 - interview and civics test (passed!) and took the oath and received my certificate on the same day! \n\n\n", "subreddit": "USCIS"}
{"post_id": "1ntjw6u", "title": "FINALLY, I’m a US CITIZEN 🇺🇸", "author": "u/Illustrious_Web2457", "score": 1068, "num_comments": 162, "created": "2025-09-29T14:43:49+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ntjw6u/finally_im_a_us_citizen/", "is_self": false, "image_urls": [], "selftext": "I’m glad and super happy to share my US naturalization timeline with you all. I was following this subreddit for so long and got help from all of you, that’s why I’m sharing my experience here with USCIS over the past 9 years.\n\nI came to the US with an L1B visa through employment in 2016, and after few renewals, I got my Green Card in 2020.\n\n**Here is my timeline for the naturalization:**\n\nField Office: Buffalo, NY. (But my interview was in Syracuse, and the oath ceremony in Ithaca)\n\nJanuary 11, 2025 - We received your Form N-400, Application for Naturalization, and sent you a receipt notice.\n\nJuly 8, 2025 - We scheduled an interview for your Form N-400, Application for Naturalization.\n\nAugust 27, 2025 - We recommended that your Form N-400, Application for Naturalization, be approved. Your case was submitted for quality review.\n\nAugust 27, 2025 - Your Form N-400, Application for Naturalization, was placed in line for oath ceremony scheduling.\n\nAugust 27, 2025 - Oath Ceremony Notice Was Mailed\n\nSeptember 25, 2025 - Certificate Of Naturalization Was Issued\n\nMy biometrics were reused from my GC’s application.\n\n**Experience during the interview:**\n\nI arrived to the Syracuse USCIS office 30 min earlier than my scheduled time, I was let in, passed through security, then I was surprised the waiting room was almost empty, just a couple of people waiting. I did check-in at the counter/window, they asked for my Green Card and interview letter, then took me a picture and fingerprints. Then she handed me a ticket with a number on it.\n\nLess than 5 min later an officer came in and called my number, I went in to her office, Took the oath, sat, and we started.  She was very professional, nice, calm, smiling and just easy to talk to.\n\nWe started with the civics questions right away, I was asked the following:\n\n* What major event happened on September 11, 2001, in the United States?\n* Who is the Speaker of the House now?\n* Name the 2 branches of the Congress?\n* What age citizens can vote for president?\n* For how many years a US representative is elected for?\n* Who is the actual president of the US now?\n\nI answered correctly all of them and passed the civics test. She was confirming that my answers were correct after each response.\n\nIn the writing and reading test, I was asked to read:\n\n* Who can vote?\n\nAnd then she asked me to write:\n\n* Citizens can vote.\n\nShe again told me that I passed the civics, reading and writing tests, congratulating me.\n\nThen she went through my N-400 form confirming basic data like name, height etc.\n\nI asked her to adjust some information that has changed since my application in January.\n\nI also told her that I had a speeding ticket in 2023 that I paid in full, she said that’s ok and she didn’t even ask for any documentation.\n\nThen she asked few more questions on the have-you-ever, and Yes/No questions. She didn’t ask any definitions.\n\nAt the end she asked me to confirm the data changes in the tablet, which I did and signed.\n\nThen she asked me to confirm my personal data as it will be printed in the naturalization certificate, I signed.\n\nShe left the room, and came back with a paper.\n\nShe congratulated me, telling me that I was approved and that my Oath Ceremony is scheduled for September 25th in Ithaca at the courthouse, which is great as it is closer than Syracuse from where I live.\n\nThe entire process door-to-door took about 20 to 25 minutes, I left before my actual scheduled time for the interview.\n\n**Oath Ceremony experience:**\n\nThe ceremony was scheduled at 10am, I arrived with my wife early on to avoid any last minute issue as I was skeptical to miss it due to a flat tire or anything. \n\nWe were let in at 10am inside the courtroom, I handed the filled form and my GC and EAD.\n\nThe ceremony started at 11am, with a speech from the judge and the city representative, it was very emotional and nice, it made us feel part of this great country.\n\nWe pled the oath of allegiance repeating after the judge.\n\nWe also pled allegiance to the flag.\n\nThen they handed us the naturalization certificates calling us one by one, and naming our country of origin.\n\nThey had a band playing live music, which was nice. They also had snacks.\n\nI registered to vote right there. And we were offered to apply for a passport in the same building, they also gave us a pass to get free passport photo.\n\nI dressed suit and tie, with a US flag pin.\n\n**Other information and tips:**\n\nI took a LOT of documentation with me to the interview, like tax transcripts, speeding ticket payment proof, Bank statements, Credit report, employment letter, 4 GMC letters from colleagues and community friends, Lease proof for the last 5 years, etc.\n\nEverything nicely organized in a binder, and labeled.\n\nAt the end, I used none of it. “Better have it and don’t need it, than need it and not have it”. I was skeptical after the GMC announcement from USCIS and started gathering every document I can. \n\nI was also over-prepared for the civics and reading/writing questions.\n\nThis was one of the most important milestones in my life, so I dressed accordingly to the event. Please dress properly, no flip flops and shorts. It shows the officer that you are not taking this interview seriously.\n\nI travelled a lot during the last 5 years, but never exceeding the continuous and physical presence requirements, and I was prepared to answer any questions about that but the officer didn’t ask anything related to that.\n\nAgain, if you are in the process of getting naturalized, I wish you the best of luck, you got this! Please ask me any questions you might have.\n\nEDIT: Many of you asked about the link to get the naturalization certificate holder. I bought it from Amazon, here is the link: [https://www.amazon.com/dp/B0D2RDLX3N?ref=ppx\\_yo2ov\\_dt\\_b\\_fed\\_asin\\_title&th=1](https://www.amazon.com/dp/B0D2RDLX3N?ref=ppx_yo2ov_dt_b_fed_asin_title&th=1)", "subreddit": "USCIS"}
{"post_id": "1jfcbar", "title": "French scientist denied US entry after phone messages critical of Trump found", "author": null, "score": 1048, "num_comments": 322, "created": "2025-03-20T00:26:40+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jfcbar/french_scientist_denied_us_entry_after_phone/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1my4fk9", "title": "Today I’m an American citizen!", "author": "u/bluedog33", "score": 1015, "num_comments": 112, "created": "2025-08-23T15:29:11+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1my4fk9/today_im_an_american_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/j2qdezmjdskf1.jpeg"], "selftext": "I had my oath ceremony in Fairfax, Virginia (the Washington DC field office). It was an efficient process, with 30 people per ceremony. \n\nI had to go through security before my spouse and handover my forms, green card and EADs before heading upstairs to the ceremony. \n\nTip for this office: use the bathroom on the first floor before heading upstairs to the naturalization ceremony room. \n\nThe ceremony was well done and there were people from 20 countries out of 30 participants. We got a form to register for vote too, to be handed in after the ceremony.\n\nThere was a new video from President Trump - one of the guests booed before it played and nearly got removed from the ceremony! \n\nNo photos in the ceremony room as they had another ceremony straight after ours but they set up flags in the building courtyard.\n\nTimeline from AOS\n\nMay 2021 - Married and filed AOS from F1\n\nMay 2022 - green card approved \n\nFebruary 2024 - Filed for ROC\n\nFebruary 2025 - Filed N400\n\nJuly 2025 - letter for combo interview \n\n13 August 2025 - combo interview, approved on spot\n\n23 August 2025 - oath ceremony ", "subreddit": "USCIS"}
{"post_id": "1nsxy0b", "title": "Well I’d like to say that all Is done. I’m officially a U.S citizen 😅", "author": "u/AgeRevolutionary8825", "score": 999, "num_comments": 110, "created": "2025-09-28T19:56:40+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nsxy0b/well_id_like_to_say_that_all_is_done_im/", "is_self": false, "image_urls": ["https://i.redd.it/7hmnsa9xnyrf1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1ig655q", "title": "I GOT IT✅", "author": "u/Glad-Craft2735", "score": 996, "num_comments": 138, "created": "2025-02-02T20:01:54+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ig655q/i_got_it/", "is_self": false, "image_urls": [], "selftext": "Thank you all. \nLove god😆🥹 ", "subreddit": "USCIS"}
{"post_id": "1jutrq1", "title": "Husband Detained at interview", "author": "u/jesspigga", "score": 990, "num_comments": 382, "created": "2025-04-09T01:09:16+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jutrq1/husband_detained_at_interview/", "is_self": true, "image_urls": [], "selftext": "Hi all, I’m here to give you my experience. I don’t know the lingo too well bear with me. and if you have any negative comments save them to yourself. \n\nDecember 2022- my husband and I turned in our I-130 into USCIS \n\nfor some insight my husband did have a prior deportation order from an asylum case that was turned down in 2018 \n\nAugust 2024- request for evidence \n\nnovember 2024- your case is being reviewed \n\nfebruary 2025- your case is being reviewed \n\nmarch 2025- your interview was scheduled \n\nnow my interview experience: \nmy interview was today at the Kendall FO in Miami, we went with an attorney and translator for my husband. (i’m a a USC) my attorney told us due to his order of deportation we had 3 possibilities 1. they approved our I-130 and we got out together 2. he would get approved and he would be detained and 3. he could get denied for whatever reason. \n\nwell in regards to the interview, the officer spoke both english and spanish, he only asked us where we met, and how he proposed. he asked if we had any other evidence to give which I had plenty files of our taxes, bank accounts, car insurance, car registration, family affidavits etc. \n\nthe officer gave us the approval for our i-130 then asked that I be escorted out (our 2 year old son was with us and we were both taken out of the room) \n\na female officer escorted us to the waiting room, about 3 minutes after she came back out asking for my husbands phone which I gave her and 2 minutes later my attorney came out with my husband jewelry and told me he was detained. \n\nnow, we have to submit a stay of removal at ice and if it is granted, my husband cannot be deported back to his home country and as of now I don’t know what’ll happen next. we were waiting for our I-130 approval to put in a motion to reopen his case and get his order of deportation removed. \n\n\nI saw a lot of people going into the appointments and not many coming out. I haven’t spoken to my husband but I want to know how many people were taken with him. these interviews are honestly to get people in their custody but unfortunately missing them would be worse. I am praying for everyone and wishing everyone luck with their cases. just wanted to share my experience. \n\n\n\nEDIT/UPDATE: \n\nmany are asking about his asylum case. when I requested his FOIA I got all the court documents from every court date he had. my husband was 15 years old, he had a pro bono attorney who was terrible. the guy wouldn’t show up to court, he would send other attorneys with him that has no idea what was going on with his case. so many times that the judge noticed and actually got frustrated and told one of the substitute attorneys “I keep giving extensions but his attorney never shows, and this is a minor kid who needs proper representation” well obviously with shitty representation his asylum got denied. and there were documents of evidence that his attorney never submitted. so when they appealed there was NO case because of this shitty attorney and he was ordered removal. ", "subreddit": "USCIS"}
{"post_id": "1lffmfb", "title": "Am I a US citizen?", "author": "u/Vezpazian", "score": 993, "num_comments": 223, "created": "2025-06-19T16:47:09+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lffmfb/am_i_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/q6wcohn1yw7f1.jpeg"], "selftext": "So I was born in Germany, and I’ve basically lived there my entire life. I’ve been to the US twice when I was a toddler. My mom is from Germany, and my dad is a US citizen veteran who was  stationed in Germany, and when I was born, he got me a passport. It expired in 2005 and on the last page it says “No fee. This passport is valid only for use in connection with the bearer’s residence abroad as a dependent of a member of the American military or naval forces on active duty outside the United States.” Apparently I also have a SSN, so my question is, am I a US citizen and can just renew my passport, or do I have to apply for US citizenship?", "subreddit": "USCIS"}
{"post_id": "1l6f2pf", "title": "My green card is hereee✅", "author": "u/dinda_xilu", "score": 958, "num_comments": 207, "created": "2025-06-08T15:37:21+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1l6f2pf/my_green_card_is_hereee/", "is_self": false, "image_urls": ["https://i.redd.it/nid05kjk3q5f1.jpeg"], "selftext": "My pd is November 17, 2025. I was here on F1 visa when I applied and I am from an African country. I had my interview on May 27, 2025 and both the I-130 and I-485 were approved the next day. And the card was delivered on June 8. \n\nMy interview was in St. Louis field office and my experience was similar to what most people post here. My husband and I were kinda of separated, I went first, the officer asked me the I-485 questions and some questions about our marriage. Then she called my husband to join us and she asked him the same question she asked me. Do you think we had a stokes interview?\n\nI don’t talk about my immigration status with people in my “real” life and I am soo glad I found this group where I can read about other people’s experiences and talk about my own. Feel free to ask me any questions ☺️. ", "subreddit": "USCIS"}
{"post_id": "1i33uig", "title": "New U.S. Citizen 🎉🇺🇸", "author": "u/Master-Ad-8904", "score": 948, "num_comments": 110, "created": "2025-01-17T00:30:42+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i33uig/new_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/yg2xe9ad8gde1.jpeg"], "selftext": "I had my oath ceremony today in Chicago, and it was a beautiful experience. We began checking in at 9:30 AM, and the judge arrived at 10:30 AM. There were 109 people from 47 different countries, and the judge announced each country, which I found incredibly touching. After taking the Oath of Allegiance, we received our Certificates of Naturalization. We had the option to register to vote and then moved to another floor where we could take pictures with friends and family. I'm still processing all the emotions—this journey has been full of ups and downs, and I'm relieved it's over. It took nine months from the moment I applied to becoming a citizen today. Applied under 5 year rule. Good luck to everyone on this journey!", "subreddit": "USCIS"}
{"post_id": "1jnv5pt", "title": "Naturalized in 1974, USCIS now says unable to authenticate eligibility for citizenship", "author": "u/Plenty-Preference-27", "score": 934, "num_comments": 284, "created": "2025-03-31T04:28:47+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jnv5pt/naturalized_in_1974_uscis_now_says_unable_to/", "is_self": true, "image_urls": [], "selftext": "My mother is 83. She was born in Germany. She was married to my father, a US citizen and a member of the US Army, in 1963 (they are still married) and she became a naturalized citizen in 1974. She has been a US citizen for over 50 years. She has had several US passports, drivers licenses, has voted in countless elections, and she now receives Social Security. My mother is even a voter registrar. In January of this year, she went to renew her drivers license, which was to expire in February. She brought with her a birth certificate, marriage license, Military ID, Social Security card, original naturalization certificate (with seal and photograph attached), expired passports (3), and proof of Texas residency. \n\nMy mother was denied a drivers license renewal because USCIS could not verify my mother’s “eligibility for citizenship”, even though she’s been a citizen for over 50 years. My mother is in a constant state of fear that she’s going to be arrested and deported, leaving my 87 year old invalid dad alone. She had to renounce her German citizenship when she became an American, so if she’s deported, she’s not sure she can stay in Germany.  The idea that my mom could be deported is ridiculous but we cannot convince her otherwise. She is inconsolable. \n\nIt is now March and nobody can tell her what this means or how to resolve this. A Congress member told her she needed an alien registration number, but she has one. It’s on her naturalization certificate. It’s been suggested that she travel to the nearest USCIS office, which is three hours away. This creates a hardship, as she is the sole caretaker for my father who is a bedridden disabled veteran. Since she’s provided every form of document in her possession, I’m not sure what a face to face meeting will accomplish. \n\nPlease, does anyone have any advice?\n\nEditing to say I have no idea where or what a field office is but the nearest USCIS office is in San Antonio, TX\nEditing again to add this so people stop accusing me of being FOS \n[My mom’s driver license application has now been rejected FIVE times. Each time, she receives a letter in the mail. Here is one of them.](https://imgur.com/a/RMGpwkT)", "subreddit": "USCIS"}
{"post_id": "1lsgaap", "title": "Cousin got denied green card due to country of birth", "author": "u/CanelaPasion28", "score": 930, "num_comments": 325, "created": "2025-07-05T18:15:45+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lsgaap/cousin_got_denied_green_card_due_to_country_of/", "is_self": false, "image_urls": ["https://i.redd.it/jm1af02gk3bf1.jpeg"], "selftext": "Hi everyone. I grew up with my cousin and so I consider him my brother and I'm trying to help him. For context we were all born in Venezuela. His mom (my aunt), my parents and I have been living in the us for a bit more than a decade. My aunt started the process to get him a greencard as soon as she became a citizen (years ago). For his greencard appointment he had to travel to Bogotá, Colombia, this was on May 10th. That day they kept his passport, gave him a paper that said he had been granted a greencard, he had to wait for the envelope and pay the fee (which he had paid already). Fast forward to today, he got a letter saying to show up to the consulate only to be given this letter and his passport. \n\nReading the executive order, it seems that there are exceptions to the 19 countries considered here. One being him having immediate family who are US citizens (my aunt and his brother are both US citizens). I have called the congressmen for our city and I'll probably have to wait until Monday. \n\nBut I wanted to see if anyone knew anything else I could do help him? ", "subreddit": "USCIS"}
{"post_id": "1i94wdj", "title": "Mass revocations of Travel Authorizations for humanitarian parole.", "author": "u/MechanicImmediate706", "score": 902, "num_comments": 373, "created": "2025-01-24T20:18:36+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i94wdj/mass_revocations_of_travel_authorizations_for/", "is_self": false, "image_urls": ["https://i.redd.it/kdyg4mqo20fe1.jpeg"], "selftext": "Today, there were mass revocations of Travel Authorizations under the Uniting for Ukraine (U4U) program for those waiting to enter the U.S.\n\nAs is known, since mid-September 2024, many were left waiting because their applications had not been approved. However, those who already had entry authorization but were not invited for biometrics to proceed with their entry had all possible Travel Authorizations revoked today.", "subreddit": "USCIS"}
{"post_id": "1lzf5uh", "title": "Husband Denied Entry and VISA Revoked", "author": "u/pandamonium90", "score": 890, "num_comments": 231, "created": "2025-07-14T06:28:01+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lzf5uh/husband_denied_entry_and_visa_revoked/", "is_self": true, "image_urls": [], "selftext": "Good Evening,\n\nMy husband and I were crossing sometime this week into Mexico. My husband was first accused (wrongfully) of trying to work in the US. Then they wrongfully accused him of living permanently in the US with me.\n\nHe crosses often to visit me. We cross often to Mexico as well. He doesn't live with me and I even send money to his mexican bank often to support him.\n\nWe have an i94 from a trip to Disneyland. It states he can be admitted into the US up until later this month. His Visa also is valid.\n\nThe officer told him he overstayed his VISA but the \"Admit until date\" has not passed. I've already contacted a law firm. Just wondering if anyone else has ran into this problem.\n\nThank you", "subreddit": "USCIS"}
{"post_id": "1ipxdtp", "title": "Dealing with USCIS: The Most Traumatic Experience of My Life", "author": "u/Historical_Stage_969", "score": 881, "num_comments": 171, "created": "2025-02-15T08:52:05+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ipxdtp/dealing_with_uscis_the_most_traumatic_experience/", "is_self": true, "image_urls": [], "selftext": "Being an immigrant and having to deal with USCIS is one of the most emotionally exhausting experiences a person can go through. It’s not just paperwork—it’s an emotional roller coaster that lasts for months, sometimes years. You stop feeling like a human and instead become just another case number, another file sitting in a queue with no clear timeline.\n\nYour entire life gets put on hold. Dreams, plans, family, career—everything is stuck in limbo, waiting for a decision from an invisible system that moves at its own unpredictable pace. The uncertainty is brutal. You live in a gray area, constantly questioning what’s next, if there even is a “next.”\n\nThe stress is relentless. You check your case status obsessively, refreshing the page every five minutes, hoping for an update that never comes. You try to stay strong, but the anxiety eats away at you. Every day feels like a battle against an unknown force that holds your future in its hands.\n\nAnd when you finally get approved—if you do—it’s not just joy. It’s exhaustion, relief, disbelief, and a flood of emotions all at once. You should be happy, but instead, you’re left with tears, processing all the pain it took to get here.\n\nI wish this process were easier. I wish people understood how deeply this affects those who go through it. But for now, I just want to say to anyone dealing with this: you’re not alone. Stay strong. I see you. I feel you.", "subreddit": "USCIS"}
{"post_id": "1gbms1a", "title": "I’m finally an American!!!", "author": "u/cuin0921", "score": 869, "num_comments": 73, "created": "2024-10-25T05:12:30+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gbms1a/im_finally_an_american/", "is_self": false, "image_urls": ["https://i.redd.it/77kk8yv26uwd1.jpeg"], "selftext": "After living in the US all my life, I finally become an American. I couldn’t be prouder of my self for finally acquiring citizenship to a country with so much opportunity. I almost shed a tear hearing the star spangled banner for the first time as a citizen. A total of 102 citizen’s naturalized along with me, representing 37 countries total!", "subreddit": "USCIS"}
{"post_id": "1grgv2w", "title": "Finally, I am now a citizen of the greatest country in the World, the USA ", "author": "u/Fun_Kaleidoscope2879", "score": 868, "num_comments": 304, "created": "2024-11-14T22:15:36+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1grgv2w/finally_i_am_now_a_citizen_of_the_greatest/", "is_self": false, "image_urls": ["https://i.redd.it/1ij2r93uyx0e1.png"], "selftext": "I am so grateful to everyone here who shared their experiences and advice. You made my application for citizenship very easy. The whole process toke about 7 months.\n\nI am so happy to be a citizen of the United States and I  hope to be able give back asap\n\nGod bless America and God bless you all \n\nTimeline:\nSubmitted NR400= Apr 23 2024\nBiometrics = Apr 23 2024\nInterview sheduled= Sept 28\nInterview = Nov 4 2024\nOath ceremony = Nov 14\n", "subreddit": "USCIS"}
{"post_id": "1ms3goj", "title": "FINALLY 🇺🇸", "author": "u/Acrobatic-Notice-531", "score": 867, "num_comments": 81, "created": "2025-08-16T18:28:13+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ms3goj/finally/", "is_self": false, "image_urls": ["https://i.redd.it/qkjlcy9ycfjf1.jpeg"], "selftext": "FINALLY AFTER 1 YEAR we got our passport . that’s the timeline from the day we applied our citizenship @ USCIS, got interview, got approved, got ceremony, applied passport.\nI’m so Happy & Blessed that after all the hard-work and anxiety it comes to a positive and Blessed end ❤️ I know for some people it takes time and sweats but don’t worry you’ll get there just think Positive 💯", "subreddit": "USCIS"}
{"post_id": "1ixin59", "title": "After being here for nearly 35 years and a 12 year process, it’s finally here! I feel so blessed and happy!!", "author": "u/HeyyyMa", "score": 868, "num_comments": 86, "created": "2025-02-25T01:10:11+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ixin59/after_being_here_for_nearly_35_years_and_a_12/", "is_self": false, "image_urls": ["https://i.redd.it/drqgpioyq6le1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1k0onnv", "title": "I feel helpless and ashamed", "author": null, "score": 844, "num_comments": 384, "created": "2025-04-16T16:28:22+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k0onnv/i_feel_helpless_and_ashamed/", "is_self": false, "image_urls": ["https://i.redd.it/rgyymvzc48ve1.jpeg"], "selftext": "I came to the USA with a K-1 visa 1 year ago and applied I-765 & I-485 almost 11 months ago. \n\nI feel shame because;\nmy wife is buying me food paying my health insurance, barber.\nSince we don't live in an area where we can walk, my wife takes me everywhere.\nI am ashamed because I have worked all my life and since I was 18 I have never needed anyone for food, transportation or health.\nI have a 2-month-old daughter and I couldn't even buy her a small outfit.\n\nI feel helpless because;\n\nThey didn't let me get a driver's license without SSN.\nI sent an e-request to uscis\nI reached 1 senator and 2 congressmen\nI talk to Emma every day\nI called USCIS for an infopass appointment and instead of giving me an appointment date, they sent me an email saying they received my e-request and the information for the e-request I sent months ago.\nI can't share my situation with anyone and I’m crying every night in secret from everyone.\n\nI don't even care about the green card, all I want is to work and live peacefully with my family.", "subreddit": "USCIS"}
{"post_id": "1jbny3n", "title": "Proposed Trump Travel Ban", "author": "u/Sufficient_Egg6970", "score": 828, "num_comments": 748, "created": "2025-03-15T05:15:53+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jbny3n/proposed_trump_travel_ban/", "is_self": false, "image_urls": ["https://i.redd.it/nyia25l7fsoe1.jpeg"], "selftext": "The Trump administration is considering implementing a new travel ban that categorizes 41 countries into three groups—red, orange, and yellow—based on perceived security risks and cooperation levels.\n\nRed List: Countries facing a full visa suspension, prohibiting all travel to the United States. This group includes Afghanistan, Bhutan, Cuba, Iran, Libya, North Korea, Somalia, Sudan, Syria, Venezuela, and Yemen.  ￼\n\nOrange List: Countries subject to partial visa suspensions, affecting specific visa categories such as tourist, student, and other non-immigrant visas. Notable countries in this category are Eritrea, Haiti, Laos, Myanmar, and South Sudan.  ￼\n\nYellow List: Countries that may face partial suspensions unless they address identified deficiencies within 60 days. This group includes Belarus, Pakistan, Turkmenistan, and others.  ￼\n\nThis proposal follows an executive order by President Trump issued on January 20, mandating tighter security vetting for foreign nationals entering the U.S.", "subreddit": "USCIS"}
{"post_id": "1lqyxki", "title": "Just in time for the 4th", "author": "u/Special_Common_9888", "score": 817, "num_comments": 155, "created": "2025-07-03T19:44:50+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lqyxki/just_in_time_for_the_4th/", "is_self": false, "image_urls": ["https://i.redd.it/tbaw18jiqpaf1.jpeg"], "selftext": "Oath ceremony was 6/17, applied for passport on the 20th, expedited took less than two weeks :D 🇺🇸", "subreddit": "USCIS"}
{"post_id": "1nyxciq", "title": "🎉Approved without interview", "author": "u/overachiever8363", "score": 802, "num_comments": 184, "created": "2025-10-05T19:20:07+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nyxciq/approved_without_interview/", "is_self": false, "image_urls": [], "selftext": "\nOffice: National Benefits Center \n\nMy green card was finally approved after long  10 months of waiting!\n\nWe’ve been married for two years at the moment we sent the application. I had J1 visa before. We filed everything by ourselves with YouTube videos and lots of reading. I got it for 10 years! 🤩 it was worth the wait!", "subreddit": "USCIS"}
{"post_id": "1me89vr", "title": "New tactic of ICE if you have a Biometrics appointment and u have a order of removal they will pick you up at biometrics I-130 petitions", "author": "u/Greedy-Emergency4258", "score": 798, "num_comments": 173, "created": "2025-07-31T17:45:40+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1me89vr/new_tactic_of_ice_if_you_have_a_biometrics/", "is_self": true, "image_urls": [], "selftext": "I try to go to my appointment 2 days early today people at the center was kind enough to allow to do prints, when they scanned my appointment it was blocked, I was send to the supervisor and she was informed that she couldn’t take my prints told me to leave, My lawyer had told me it was a trap indeed it was, thank God I show up 2 days early. Elizabeth, NJ center.", "subreddit": "USCIS"}
{"post_id": "1klskny", "title": "I'm now officially a United States citizen!", "author": "u/stelgado", "score": 792, "num_comments": 84, "created": "2025-05-13T17:54:03+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1klskny/im_now_officially_a_united_states_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/ynsf73698l0f1.jpeg"], "selftext": "It's finally over! There's no better feeling of reaching the finishing line. I had my oath ceremony on Friday and my friends and family were there to witness it including my 3 month old. For everyone still going through it, hang in there! You will prevail.\n\nI will answer any questions you may have to the best of my knowledge. Good luck!\n\nTimeline:\n\nLocation: Brooklyn, NY\n• Aug 03, 2020 / I-130, I-485, I-765 / Submission to USCIS\n• Aug 31, 2020 / I-130, I-485, I-765 / Request for Evidence(RFE) from USCIS\n• Feb 12, 2021 / I-485, I-765 / Biometrics, i.e. fingerprint and photo\n• Feb 16, 2021 / I-485 / Interview\n• Apr 21, 2021 / I-765 / Decision (Approval)\n• Oct 08, 2021 / I-130 / Decision (Approval)\n• Oct 14, 2021 / I-485 / Decision (Approval)\n• Aug 11, 2023 / I-751 / Submission to USCIS\n• Jul 16, 2024 / N-400 / Submission to USCIS\n• Jan 14, 2025 / I-751, N-400 / Interview\n• Feb 24, 2025 / I-751 / Decision (Approval)\n• Mar 20, 2025 / N-400 / Decision (Approval)\n", "subreddit": "USCIS"}
{"post_id": "1jnq5of", "title": "My First U.S. Re-entry with a Green Card", "author": "u/Classic_General6107", "score": 778, "num_comments": 132, "created": "2025-03-30T23:51:13+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jnq5of/my_first_us_reentry_with_a_green_card/", "is_self": true, "image_urls": [], "selftext": "I’d like to share my experience entering the U.S. as a Green Card holder at Dallas airport.\n\nI first came to the U.S. 8 years ago and received my Green Card late last year through employment-based (EB1A). I’m an Indian citizen.\n\nToday, I returned to the U.S. after a one-month vacation in India. Here’s how my interaction with the immigration officer went:\n\n**Me:** Good morning, officer.  \n**Officer:** Good morning.  \n(I handed over my passport and Permanent Resident Card.)  \n**Officer:** Are you a Permanent Resident?  \n**Me:** Yes.\n\nAfter about five seconds, he handed back my passport and Green Card — and that was it. Simple and smooth!  \n  \nBefore me, 8–10 people with Green Cards completed their immigration process without any issues. Only one person was asked for a fingerprint by the officer.", "subreddit": "USCIS"}
{"post_id": "1lwyj9k", "title": "Wife and I are Devastated. Someone please help this make sense.", "author": "u/Killjoy8915", "score": 775, "num_comments": 383, "created": "2025-07-11T05:14:44+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lwyj9k/wife_and_i_are_devastated_someone_please_help/", "is_self": false, "image_urls": [], "selftext": "Had a great start to the week when we saw that there was finally some activity on our case in the USCIS portal.  It has been over 3 months since our interview, an interview that actually went pretty well.  The Agent was nice, and she mentioned that our baby girl was evidence enough.  She didn't even go through the mountain of pictures that my Wife spent days compiling.  Wifey didnt find that part as amusing as I did. \n\nMy Wife and I were in a long distance relationship.  She lived in Coahuila Mexico her entire life.  She graduated from, what I understand to be, a prestigious University at nearly the top of her class with a degree in International Commerce.  She had a great career in the Automotive Industry.  If all that isn't enough, a loving and supportive family too.\n\nWe met, while each of us were on vacation, in Cancun back in 2014.  Kept in touch over the years making sure to say HBD to each other every year, since her bday is  just 7 days before mine.  She had her life and I had mine.  Actually, it wasnt until Jan 2023 that we actually started getting close.  Talked more and more each day.  Took turns flying to each other as much as possible, until I decided to propose at midnight on Christmas 2023.\n\nShe made the tough decision to leave her great life behind to start a life together in California. We were married in March of 2024 and two months later we found out we were pregnant.  She entered the US with a tourist visa and we were Married before her 6-month I-94 expired.  My understanding is that we had nothing to worry about.  \n\nFast forward to today.  My Wife struggling to read the above denial notice, as she bawls her eyes out, while I hold our beautiful six-month old daughter in disbelief.  THIS HAS TO BE A MISTAKE.\n\nI've been sitting here for hours trying to figure out what the hell happened.  I dont even want to blink because I swear that everytime I close my eyes, I can see the words, \"DEPART THE UNITED STATES WITHIN 33 DAYS.\"\n\nI know I'm probably grasping at straws here but the notice says that she doesn't qualify for adjustment under INA 245(a).  I'm reviewing the packet we submitted originally and, right at the top of our I-864, it reads 'Affidavit of Support Under Section 213A of the INA'.  In fact, I cant find any mention of INA 245(a) anywhere. Am I on the right track?  Would it be too much to ask for this to be a clerical error that can be easily fixed??  Anyway, sorry for the essay.  Thanks.", "subreddit": "USCIS"}
{"post_id": "1hglar9", "title": "Use this method to know if USCIS is *actually* working on your case 🤓 ", "author": "u/fer_schez", "score": 758, "num_comments": 709, "created": "2024-12-17T21:27:39+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hglar9/use_this_method_to_know_if_uscis_is_actually/", "is_self": false, "image_urls": [], "selftext": "For those who are impatient like me 🙈 , interested in to know if the USCIS is *actually* working their case, use this method 🤓 I was able to see how many times their updated my I-765 case before the approval today. The timestamp shows the last time when the case was updated (UTC / London time, 5+ hrs than US ET). ", "subreddit": "USCIS"}
{"post_id": "1hk1euu", "title": "Inside the Trump team’s plans to try to end birthright citizenship", "author": "u/lovetree77", "score": 757, "num_comments": 875, "created": "2024-12-22T16:04:26+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hk1euu/inside_the_trump_teams_plans_to_try_to_end/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1gw7p22", "title": "Got my US passport, now what? ", "author": "u/Sesesmil2", "score": 762, "num_comments": 756, "created": "2024-11-21T04:16:39+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gw7p22/got_my_us_passport_now_what/", "is_self": false, "image_urls": ["https://i.redd.it/ya22t34qk62e1.jpeg"], "selftext": "Since 2019 when my spouse applied for the petition for alien relative sounds like long time. But everything is been smooth. Got the green card in June 2021 and last month became a US citizen got my passport and now what? \nI feel like there is something else to update or apply to. I went to update my SSN, what else? \n\nCan I apply for petition for a close relative this year or too soon? \n\nI feel grateful but also like, what else do I need to do with USCIS. someone told me about getting a certify copy of my naturalization certification but I don't know the purpose of that. ", "subreddit": "USCIS"}
{"post_id": "1hqo8ow", "title": " 🎉 New Year, New Case Status? Let’s Manifest Those Approvals! 🎊", "author": "u/ThatCaptain371", "score": 740, "num_comments": 116, "created": "2024-12-31T21:16:39+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hqo8ow/new_year_new_case_status_lets_manifest_those/", "is_self": true, "image_urls": [], "selftext": "\nHappy New Year, everyone! Here’s to a 2025 where “Case is Actively Being Reviewed” turns into “Approved” faster than your New Year’s resolutions fade.\n\nMay your RFEs be few, your case status updates be timely, and your green cards arrive before your Amazon packages. Sending good vibes for smooth journeys ahead.\n\nWhat’s your immigration wish for 2025? Drop it below—let’s cheer each other on! 🍀🤞\n\nUPDATE: Loving the positivity in this thread! Happy New Year everyone! 🧡", "subreddit": "USCIS"}
{"post_id": "1nefgux", "title": "Message from Deputy Sec of State", "author": null, "score": 736, "num_comments": 496, "created": "2025-09-11T17:47:19+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nefgux/message_from_deputy_sec_of_state/", "is_self": false, "image_urls": ["https://i.redd.it/w32ia1xcpkof1.jpeg"], "selftext": "Keep this in mind, before you post edgy opinions on the internet or say in public. Upon the assassination of a popular political commentator, expressing levity or support of his death, could cause your status to revoked and you to be deported. Thought this should be shared. ", "subreddit": "USCIS"}
{"post_id": "1jmdgt9", "title": "Lawful Green Card holder sent letter demanding she leaves the country.", "author": "u/Humble_Manatee", "score": 733, "num_comments": 368, "created": "2025-03-29T03:28:55+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jmdgt9/lawful_green_card_holder_sent_letter_demanding/", "is_self": false, "image_urls": ["https://i.redd.it/zkratvl8sjre1.jpeg"], "selftext": "She received her green card approval 9/11/2024 and has her green card in hand. USCIS sends her this letter in what I can only assume is a scare tactic to force lawful immigrants to self-deport. Her approved green card application is the top application in her account where she received this letter. ", "subreddit": "USCIS"}
{"post_id": "1nm9tth", "title": "H1B official statement by Karoline leavitt", "author": "u/pilow-humper", "score": 735, "num_comments": 252, "created": "2025-09-20T21:16:25+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nm9tth/h1b_official_statement_by_karoline_leavitt/", "is_self": false, "image_urls": ["https://i.redd.it/b5nmz19vydqf1.jpeg"], "selftext": "TLDR; \n\nThe new regulations will apply only to individuals selected in the next H-1B lottery cycle.\n\nThose who already hold an approved I-797 or have an H-1B visa stamp are not affected by these rules.", "subreddit": "USCIS"}
{"post_id": "1kjlib6", "title": "I’m free❤️", "author": "u/Fabulous_South_7072", "score": 728, "num_comments": 133, "created": "2025-05-10T21:59:29+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kjlib6/im_free/", "is_self": false, "image_urls": ["https://i.redd.it/l3che9bb110f1.jpeg"], "selftext": "I’m in this country for the past 24 years, not a good feeling but I survived. I pay my taxes doing the right things, never  involved with the government and never had any issues. Last year my daughter became citizens, petitioned for me December 2024, may 2024 I can proudly say that I am a proud green mama😂😂😂👌.", "subreddit": "USCIS"}
{"post_id": "1koa0et", "title": "I became a U.S. citizen today! 🇺🇸 5/16/25", "author": "u/sgfc_04", "score": 722, "num_comments": 92, "created": "2025-05-16T19:47:31+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1koa0et/i_became_a_us_citizen_today_51625/", "is_self": false, "image_urls": [], "selftext": "Just became a U.S. citizen today! 🇺🇸\n\nI took the oath this morning at the Long Island Federal Courthouse, Central Islip, NY…. and it’s still sinking in! This journey has been long and emotional, filled with challenges, lessons, and growth, but every moment led to this one. I’m incredibly grateful for the opportunities I’ve had, the people who supported me, and the chance to finally call this country home in every sense of the word. \n\nTo anyone still on the path: keep going. It’s worth it! I wish you all the best! \n\n——————————————————————————-\nFor anyone interested in the details, here’s a breakdown of my immigration journey:\n\nImmigration Timeline (Photos attached as well)\n\nFO: Holtsville, NY (Long Island)\nJ1 Visa / Married to USC / Same-sex\n\nFiled by an immigration lawyer:\n\nI-130 - Petition for Alien Relative: \nJuly 14, 2020 - Application Received\nJuly 13, 2021 - Approved\n\nI-131 - Application for Travel Documents, Parole Documents, and Arrival/Departure Records:\nJuly 14, 2020 - Application Received\nApril 22, 2021 - Approved\n\nI-765 - Application for Employment Authorization:\nJuly 14, 2020 - Application Received\nFebruary 12, 2021 - Fingerprint\nApril 22, 2021 - Approved\nApril 28, 2021 - Card Received\n\nI-485 - Application to Register Permanent Residence or Adjust Status:\nJuly 14, 2020 - Application Received\nFebruary 12, 2021 - Fingerprint\nJune 11, 2021 - Interview\nJuly 13, 2021 - Approved\nJuly 20, 2021 - Card Received\n\n——————————————————————————\nFiled by me:\n\nI-751 - Petition to Remove Conditions on Residence:\nMay 4, 2023 - Application Received\nMay 11, 2023 - Fingerprint waived\nApril 28, 2025 - Combo Interview and same day approval. \n\nN-400 - Application for Naturalization:\nJuly 12, 2024 - Application Received \nApril 28, 2025 - Combo Interview and same day approval. \nMay 7, 2025 - Oath schedule received\nMay 16, 2025 - Oath ceremony and certificate of naturalization was issued\n\n", "subreddit": "USCIS"}
{"post_id": "1gl09pe", "title": "Here for you and everyone in this unfortunate time ", "author": "u/Responsible-Sale-638", "score": 716, "num_comments": 375, "created": "2024-11-06T14:52:03+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gl09pe/here_for_you_and_everyone_in_this_unfortunate_time/", "is_self": true, "image_urls": [], "selftext": "Most of us have a case open with USCIS and NVC. \nWe don’t know what will happen. \n I’m here for you I understand. I cried . \nWe have families , we have jobs. Let’s be hopeful. \n\nHugs to everyone.  ", "subreddit": "USCIS"}
{"post_id": "1jc8zlu", "title": "H1B Surgeon Prevented Re-Entry in Boston", "author": "u/JuggernautWonderful1", "score": 720, "num_comments": 270, "created": "2025-03-16T00:12:20+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jc8zlu/h1b_surgeon_prevented_reentry_in_boston/", "is_self": true, "image_urls": [], "selftext": "A Rhode Island doctor who had traveled to Lebanon to see her parents was prevented from re-entering the United States at Boston’s Logan International Airport on Thursday evening.\n\nDr. Rasha Alawieh, 34 lives in Providence and has been working at Brown Medicine’s Division of Kidney Disease & Hypertension since last July. She has been studying and working in the United States for about six years and is here legally on an H1B visa that doesn’t expire until 2027, and has committed no crimes. Trained in the U.S. at Ohio State, University of Washington, and Yale as a surgeon.\n\nThe US consulate in Lebanon had issued her an H-1B visa, which is given to people in specialty occupations requiring expertise. The visa was valid through mid-2027.\n\nFull story: [https://www.bostonglobe.com/2025/03/14/metro/ri-doctor-prevented-from-returning-to-us-after-visiting-parents-in-lebanon/](https://www.bostonglobe.com/2025/03/14/metro/ri-doctor-prevented-from-returning-to-us-after-visiting-parents-in-lebanon/)\n\nEDIT: NEW information come to light publicly today (03/17) suggests the doctor was a Hezbollah sympathizer. Administration got this one right, she doesn't belong here. Let's move on.", "subreddit": "USCIS"}
{"post_id": "1h8i8yr", "title": "It’s official 💚", "author": "u/AgitatedConnection64", "score": 713, "num_comments": 157, "created": "2024-12-07T02:17:54+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1h8i8yr/its_official/", "is_self": false, "image_urls": [], "selftext": "Received my green card today. 💚 First off, I’m thankful for this subreddit for being so informative (more informative than most lawyers 😂) Praying and wishing those who are waiting get their approvals soon. 🙏🏼 \n\nBackground about me:\n\n- Overstayed (4 yrs)\n\n- Married to USC \n\n- RFE (medical and joint sponsor)\n\n- No interview ", "subreddit": "USCIS"}
{"post_id": "1l4akw1", "title": "My citizenship timeline (less than 5 months total)", "author": "u/marlunazu", "score": 707, "num_comments": 132, "created": "2025-06-05T21:04:06+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1l4akw1/my_citizenship_timeline_less_than_5_months_total/", "is_self": false, "image_urls": ["https://i.redd.it/kzu4v6p4b65f1.jpeg"], "selftext": "Hello everyone! \n\nI just wanted to share my citizenship timeline. I am married to a US citizen and applied after 3 years of being a resident. No criminal record, not even a ticket.\n\n12/28/2024: Submitted my application.\n\n01/04/2025: Biometrics appointment was scheduled\n\n01/23/2025: Attended my biometrics appointment, the entire process took about 10 minutes, I was the only person in the building. That same day I received a notification that USCIS was actively reviewing my case.\n\n03/14/2025: Interview was scheduled.\n\n03/23/2025: Attended my interview. The entire process, from entering the building to exiting, was probably about an hour, the interview itself was around 20 minutes and felt more like a conversation rather than an interview or interrogation. Please do study a lot though! \n\n04/21/2025: Oath Ceremony was scheduled.\n\n05/16/2025: Attended Ceremony. In my case, the ceremony was about 15 minutes long. The process of entering the building and waiting for all the applicants and guests to arrive took longer. \n\nAs an extra, I applied for my passport at my nearest post office on 05/20/2025 and received it today, 06/05/2025. Did not pay for expedited service. I haven’t received my documents but they have been sent.\n\nLet me know if you have any questions!\n", "subreddit": "USCIS"}
{"post_id": "1gx8zc8", "title": "Citizenship Achieved!", "author": "u/Ecstatic-Macaron", "score": 702, "num_comments": 66, "created": "2024-11-22T14:24:24+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gx8zc8/citizenship_achieved/", "is_self": false, "image_urls": ["https://i.redd.it/z46e51d2qg2e1.jpeg"], "selftext": "K-1 (2015) to US Citizen (2024)! Finally reached the end of this long journey. ", "subreddit": "USCIS"}
{"post_id": "1ikqr4l", "title": "I got approved 🎊🎊🎉🎉🎉", "author": "u/Long-Alternative-661", "score": 691, "num_comments": 413, "created": "2025-02-08T16:12:51+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ikqr4l/i_got_approved/", "is_self": false, "image_urls": ["https://i.redd.it/y7hnfrpiwxhe1.jpeg"], "selftext": "Whole process took only 5 months!!!! Filed on 6 September 2024. Did it myself, No lawyer, No interview. Case approved 🔥🔥🔥🎉🎉 I am going crazzzzyyyy🤩🤩🤩🤩", "subreddit": "USCIS"}
{"post_id": "1jm4t7s", "title": "Today, I am a U.S. Citizen!", "author": "u/Isabellat64", "score": 692, "num_comments": 120, "created": "2025-03-28T20:29:44+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jm4t7s/today_i_am_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/3fssw2o3qhre1.jpeg"], "selftext": "Had my Oath Ceremony today in Miami! I’m the happiest! \n\nIt was scheduled for 07:30 AM, but it started at about 08:45 AM, after everyone was seated and they printed the certificates / sorted things out in the background. \n\nIt was such a beautiful event ♡. I’ve been over the moon all day. I also applied for my passport already. I had an appointment at an agency at 12:15 pm, and I had more than enough time to make it. \n\nMy American story: \n\n*Became a conditional resident on August, 2021, after my husband petitioned for me. Adjusted from an F-1 visa with not issue.  \n\n*Submitted I-751 in August, 2023. \n\n* Submitted N-400 on September 16, 2024. \n\n*Attended combo interview on March 13th, 2025. \n\n*Had my oath ceremony on March 28th, 2025. \n\nHappy to answer any questions! ", "subreddit": "USCIS"}
{"post_id": "1mofpm6", "title": "I am now a US citizen!!", "author": "u/Diligent_Prompt_5294", "score": 679, "num_comments": 115, "created": "2025-08-12T17:51:18+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mofpm6/i_am_now_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/lsicqkjpmmif1.png"], "selftext": "I did it guys!!  I've been on this reddit for a few months, reading stories of everyone going to their interviews, oath ceremonies and becoming a citizen.  Today, I am officially a US citizen!!\n\nTimeline:\nApplication submitted 4/07/2025\nBiometric Re-use 4/10/2025\nInterview 07/29/2025\nOath ceremony 08/12/2025\n\nTo those who are still in the process of becoming a US citizen, patience is the key.  I know the emotions are building-up, but you'll eventually get there!  \n\n", "subreddit": "USCIS"}
{"post_id": "1nw01ye", "title": "Got naturalized today!! 😊", "author": "u/Vegetable-Two5164", "score": 674, "num_comments": 50, "created": "2025-10-02T10:26:50+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nw01ye/got_naturalized_today/", "is_self": false, "image_urls": ["https://i.redd.it/lr7swq5wdosf1.jpeg"], "selftext": "May 23: sent the application, October 1st: interview. \n\nDid it through marriage, it was simple and fast. The entire interview took about 20 min and then the oath ceremony on the same day. \n\nIt was easy. I got an officer who was stern and wouldn’t let out any emotion. Started with checking my documents like passport, green card, then conducted civics test, written and reading test which were easy peasy. Since I did it through marriage, she looked through the pics I brought, documents like joint tax returns, bank statements for a few minutes. Then she typed something on her desktop for a little while and then said you’re approved , have a nice day. Took the oath ceremony an hour later. It was a very good smooth experience overall.  During the ceremony they played a video of Trump congratulating and welcoming the new citizens and everyone’s expression was cringe, that was funny lol", "subreddit": "USCIS"}
{"post_id": "1i6zdsz", "title": "New Citizen in town! 🥳🇺🇲", "author": "u/Capable-Ad-1345", "score": 673, "num_comments": 69, "created": "2025-01-22T01:34:02+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i6zdsz/new_citizen_in_town/", "is_self": false, "image_urls": ["https://i.redd.it/iw3quwv78gee1.jpeg"], "selftext": "Congratulations to Me, Myself, and I\n\nPD: Aug 17 (N400), under 3 years rules, (VAWA applicants)\n\nDec 5: interview was scheduled \nJanuary 21th: interview and oat\n\nPO: Los Angeles\n\nMy appointment was at 1:45pm, i got through security at 1:10pm i was the only one in line. \nWent to the front window to check in, got my picture and finger print taken. The lady told me they're offering same day oat if i would like to have if i pass, i agree to it. Because that was exactly what i wanted since we don't know how things can change with the new administration if i want future date. ( i only 3min)\n\nI sat down and i did not get call in until 2:16pm by the female officer ( Note: while i was seating down they did oat ceremony for some people at 1:40pm, i hear the lady telling some people to wait they oat is giving every hour) \n\nOnce i got in with my conducting officer, we took a oat before my civics test (6 questions)\n\n1. Name one branch or part of the government \n2. We elect a US senator for how many years \n3. In what month do we vote for the president \n4. Who is the chief Justice of united state now\n5. Who did united state fight in world war ll\n6. Name on US territory.\n\nReading: Where is the Capital of United State\nWriting: The white house is in Washington DC \n\nAfter that was going through my application and making sure everything is up to date and no mistake in my name. \n\nShe said congratulations, i will be approving you now so you can take a oat. We talk about me applying to become uscis officer but with the new administration i will have to wait until hiring is back on. ( i got notification like 10min later on my uscis website)\n\nBy 2:50pm we took our oat and i was out of the building by 3pm\n\nPS: i did not drive there i took lyft since i heard it is hard to find parking in the area if construction is going on. I don't want to risk my stress level looking for parking before my interview. \n\nI hope someone find this helpful. GOD BLESS AMERICA 🇺🇸 \n\n\n\n", "subreddit": "USCIS"}
{"post_id": "1mpki0x", "title": "Officially a U.S Citizen 🥳🇺🇸🇺🇸 Took my oath today — all by myself!", "author": "u/Big-Rabbit2050", "score": 663, "num_comments": 87, "created": "2025-08-13T23:39:16+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mpki0x/officially_a_us_citizen_took_my_oath_today_all_by/", "is_self": false, "image_urls": [], "selftext": "I had my oath ceremony this morning at the Brooklyn Field Office, and it turned out to be a completely unique experience.\n\nMy appointment was at 10:00 AM, so I showed up at Federal Plaza around 9:30. I was surprised right away ,no lines at security, not a single person in sight. When I got upstairs to the 8th floor, it was completely empty. The check-in windows were closed, and even the security guard looked confused. He asked, “What are you doing here?” and then told me the office was actually closed to the public today for a training day.\n\nThat’s when I started thinking maybe there was some mistake. The guard took my paper to double-check with USCIS officials, and they came back saying, “Yes, we’re expecting him.” Turns out… they had planned the oath just for me.\n\nI was the only applicant in the entire building. The officers were incredibly nice and welcoming. They had actually called me on Monday offering a Friday oath date, but since I mentioned I was traveling soon, they moved it to Wednesday after talking with a supervisor. I just never imagined it would be a completely solo ceremony!\n\nIt took only about 10 minutes start to finish, and now… I’m officially a U.S. citizen! Feeling so proud and grateful. 🇺🇸\n\nIf you're wondering why its so fast and only took 63 days and why they were calling to schedule me an oath very fast they said because my application is military based so it gets expedited and priority processing ", "subreddit": "USCIS"}
{"post_id": "1hqh8rg", "title": "Can there be a better way to end 2024!?! ", "author": "u/baashabhaai", "score": 664, "num_comments": 157, "created": "2024-12-31T15:41:33+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hqh8rg/can_there_be_a_better_way_to_end_2024/", "is_self": false, "image_urls": ["https://i.redd.it/lj675home7ae1.png"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1k2caul", "title": "I GOT APPROVED!!!", "author": "u/Sea-Highlight-2485", "score": 652, "num_comments": 191, "created": "2025-04-18T18:41:25+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k2caul/i_got_approved/", "is_self": false, "image_urls": ["https://i.redd.it/1i11ts4x1nve1.jpeg"], "selftext": "I got approved after my interview two days ago. It is such a miracle and the Lord's doing. The case officer was very nice and she asked me and my wife the barest minimum questions. We were literally talking about other things, and the atmosphere wasn't as official as I would have thought. Thank you to all other OPs that shared your progress and prepared me.\n\nThank you.", "subreddit": "USCIS"}
{"post_id": "1jfx84y", "title": "DHS and USCIS cancel translation services", "author": "u/Downtown_Slice_4719", "score": 650, "num_comments": 312, "created": "2025-03-20T19:26:11+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jfx84y/dhs_and_uscis_cancel_translation_services/", "is_self": true, "image_urls": [], "selftext": "[https://www.govexec.com/management/2025/03/trump-administration-cancels-translation-services-those-seeking-access-or-correct-their-immigration-status/403778/](https://www.govexec.com/management/2025/03/trump-administration-cancels-translation-services-those-seeking-access-or-correct-their-immigration-status/403778/)\n\n[https://www.nbcnews.com/news/latino/freeze-funding-help-green-card-holders-get-citizenship-stirs-uncertain-rcna195336](https://www.nbcnews.com/news/latino/freeze-funding-help-green-card-holders-get-citizenship-stirs-uncertain-rcna195336)\n\nTranslation services will no longer be offered. Free English classes also canceled for those trying to go from green card to passport.  Government employees were told to also hang up on anyone who is not fluent in English. ", "subreddit": "USCIS"}
{"post_id": "1k66lem", "title": "Re-entering the US as a green card holder", "author": "u/AssumptionShort5970", "score": 650, "num_comments": 239, "created": "2025-04-23T18:31:11+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k66lem/reentering_the_us_as_a_green_card_holder/", "is_self": true, "image_urls": [], "selftext": "We see so many scary cases of people having trouble re-entering the US, being detained, etc. All that made me extremely scared and concerned but I refused to let the fear keep me caged inside the country. I went on vacation to the EU recently and the other day came back to the States. Not a single question aside from “do you have anything to declare?”\nI wanted to make this post because after seeing all the nerve wracking stories, we often forget that one million individuals enter the US daily with no issues. If you have your documents in order and do not break the law, you’re gonna be fine my friends 🤍\nI hope this post gives some peace of mind to you guys!\n", "subreddit": "USCIS"}
{"post_id": "1mftr8d", "title": "Marriage Based Interview…went horribly", "author": "u/Ok_Persimmon_7192", "score": 650, "num_comments": 281, "created": "2025-08-02T15:46:07+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mftr8d/marriage_based_interviewwent_horribly/", "is_self": true, "image_urls": [], "selftext": "My wife and I had our interview yesterday at the LA USCIS office. We prepped for weeks ahead of time - came ready with all our documents, a photo album we made, newly collected ‘evidence’, knew our forms back and front, etc. We sent our list to our lawyer ahead of time and she felt we were also prepared well. \n\nWe noticed an officer an hour or so before our appointment being rude to other applicants and hoped he wouldn’t be our agent (unfortunately, he was 😩).\n\nWe stepped into his office and he immediately brought a combative attitude. He asked for our licenses and told us “everything you hand me becomes evidence. What’s the problem here?” Our license addresses don’t match (totally something we tried to fix, so make sure you do!) because I wasn’t able to change it in the time before our appointment. He moves on from this after a few minutes of berating us about them being different and asked to see both of our house keys. We had driven there together, so only brought one set. He said “wrong answer” and would not allow any further explanation. \n\nThen he brought out an article (I didn’t see the source so not sure where it came from) that talked about how marriage fraud is on the rise and basically started accusing us no more than 5 minutes into our interview. (For context, were in a good faith marriage and have plenty of other evidence to prove so). He pointed at a bookshelf in his office with what he called ‘hundreds of fraud cases’ he’s dealing with that all had shared leases, bank accounts, wedding photos, etc. He continued on this tangent, saying over 600 marriages had been falsified according to some report (again no clue which one).\n\nAt this point, our lawyer stepped in and asked if he could remain on task - she mentioned her address isn’t current on her license and wondered how he would be able to tell two keys are exactly the same (and how he would be qualified to call that ‘evidence’) and told him she thought he was off base and in his communication style, going out of line, especially throwing around the word fraud before doing his due diligence of checking our other evidence. This clearly irritated him - and he threatened to cancel the interview and have us come back another day. Our attorney requested his supervisor come so we could continue and he stepped out to get her.\n\nThe supervisor was nice and said the interview would get back on track but when he came back in he once again tried to go back to the discussion about keys/marriage fraud. So our attorney reminded him to move on and he jumped to the I-485, of which he only asked me 7 questions (if I had ever been a prostitute, sold drugs, been part of a gang, been arrested, been in the army, or killed somebody).\n\nHe then collected what evidence we brought (no explanations, just had to hand it over and have him scan). Some evidence he attempted to reject because ‘his scanner wouldn’t read it’ without even trying (our lawyer called him out on this so he ended up taking more than he wanted to). The photo album we made he quickly looked through but then told us he only wanted photos from after marriage (we included pictures from all the way back on our first date to present) so he took no photos. \n\nHe then gave us a continuation letter giving them 120 days to make a decision, request more evidence, or request another interview.\n\nWith stories me and my wife had heard lately, we both thought we’d be fine and it’d be an easy enough process with the right documents in place. We did notice every other couple besides us who had an appointment while we waited for the 2+ hours there got called in separately and we were the only ones called together - so not sure if that means we had a weaker case in their eyes or a stronger one.\n\nEither way, we’re now playing the waiting game. If anyone has any experience like this or advice, would love to hear it. Making an appointment at the DMV as we speak 🤦 \n\nUpdate: I got my approval of I485 and I130 couple days ago. I guess it was a little game of interviewer. Here is my timeline:\n-Applied on April 11th\n-Scheduled biometric appointment on April 18th\n-Requested RFE on May 9th\n-Scheduled interview on June 23rd (for August 1st)\n-Approval case on August 16th.\nThankful it went this way. thank you to everyone for the words of encouragement and advice! \n", "subreddit": "USCIS"}
{"post_id": "1islv2q", "title": "DACA to permanent resident", "author": "u/WaferUpper4850", "score": 639, "num_comments": 119, "created": "2025-02-18T19:53:15+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1islv2q/daca_to_permanent_resident/", "is_self": false, "image_urls": ["https://i.redd.it/0sxufscycyje1.jpeg"], "selftext": "Picked up my green card today, officially a permanent resident!!\n\nMy husband and I got married September 2023. I submitted I-131 (advance parole) and I-130 in March 2024. \n\nAdvance parole got approved mid July 2024 and I flew out to Mexico the first week of August 2024. When I got back with my advance parole stamped, we then submitted I-485 in September 2024 along with my medical exam. \n\nInterview and biometrics were both waived. \n\nMy I-130 and I-485 were both approved the first week of February 2025. And on 2/11/2025 I got the notification that my card was being produced. And on 2/17/2025 I got a call from my lawyer that they had received my green card and was ready to be picked up which I picked up today 2/18/2025. \n\nI did this whole process with the help of a lawyer. I am happy to answer any and all questions!! \n\n", "subreddit": "USCIS"}
{"post_id": "1m4vg9q", "title": "Ice secretly deported Pennsylvania grandfather, 82, after he lost green card - what’s the safest way to replace a lost gc now?", "author": "u/cnstnt_craving", "score": 640, "num_comments": 224, "created": "2025-07-20T17:57:30+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1m4vg9q/ice_secretly_deported_pennsylvania_grandfather_82/", "is_self": false, "image_urls": [], "selftext": "This man had a green card for decades and was arrested when he went to replace his card that was missing from his wallet. His family was told he died but they found him on their own in Guatemala (not his country of birth). This is making me wonder what is the best way to replace a lost card under the current situation?", "subreddit": "USCIS"}
{"post_id": "1ijb0vi", "title": "I am lucky, blessed and humbled by this news >>", "author": "u/basuarya", "score": 640, "num_comments": 140, "created": "2025-02-06T19:28:12+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ijb0vi/i_am_lucky_blessed_and_humbled_by_this_news/", "is_self": true, "image_urls": [], "selftext": "**Officially a Permanent Resident – A Moment of Gratitude and Reflection**\n\nToday marks a significant milestone in my journey—I am officially a permanent resident of the United States. It’s a moment that brings a mix of emotions: gratitude, relief, and an overwhelming sense of responsibility.\n\nFor years, I’ve worked hard, faced uncertainty, and navigated a complex process, all with the hope of building a future in this country. The United States has given me opportunities to grow, to contribute, and to dream bigger than I ever imagined. And now, as a permanent resident, I feel an even deeper commitment to giving back to the place that has given me so much.\n\nEDIT: *to highlight domain-specific struggle(s)*\n\nI came here with nothing but ambition, driven by a passion for research and a hunger to contribute meaningfully to the scientific community. But let’s be honest—choosing the path of a research scholar is not for the faint of heart. The road is steep, filled with grant rejections, funding uncertainties, and the constant pressure to prove your worth. Balancing research, teaching, and securing financial stability while being on temporary visas was an exhausting mental and emotional marathon.\n\nThere were days I questioned everything—whether I’d ever have the security to call this place home, whether my work would ever be seen as valuable enough to earn me a permanent place here. The reality of academia is that even when you’re passionate about your work, the system often makes you feel disposable. Yet, I kept pushing forward, driven by the belief that knowledge should outlast uncertainty.\n\nI’ve worked through sleepless nights, lived paycheck to paycheck, and endured the anxiety of visa renewals that determined my ability to stay. I navigated the complexity of bureaucracy while trying to push the boundaries of my research. Every fellowship, every publication, every small win was a step forward—not just for me, but for the contributions I hoped to make to my field.\n\nThis journey hasn’t been mine alone. I owe so much to my family, friends, mentors, and even strangers who have shown kindness along the way. Whether it was words of encouragement, guidance through bureaucracy, or simply sharing their own experiences, every bit of support has meant the world to me.\n\nI know this status is not just a privilege but a responsibility—to uphold the values of hard work, respect, and community. To anyone still navigating their own immigration journey, I see you. It’s not easy, but it’s worth it. Keep going.\n\nFor many, this milestone might just seem like a bureaucratic process, another legal status update. But for me, it represents years of sacrifice, resilience, and an unshakable belief that the pursuit of knowledge and innovation is worth the struggle.\n\nToday, I’m celebrating quietly, taking it all in. But tomorrow, the work continues—because making a life here is about more than just a piece of paper. It’s about making a difference.\n\nThank you, America. Here’s to new beginnings. 🇺🇸\n\nPD - April 2020\\*; Category: EB1-b\n\nEDIT: I-485 timeline (partially masked)\n\nJanuary XX, 2025 Card Was Mailed To Me\n\nJanuary XX, 2025 We approved your Form I-485, Application to Register Permanent Residence or Adjust Status.\n\nJanuary XX, 2025 We ordered your new card.\n\nNovember XX, 2024 The fingerprints relating to your Form I-485 Application to Register Permanent Residence or Adjust Status, were taken.\n\nSeptember XX, 2024 We received your Form I-485, Application to Register Permanent Residence or Adjust Status.\n\n\\*The reason it took my case so much time is because I had to port my previous EB2 NIW I-140 into EB1-b I-140 by changing jobs and reapplying again.\n\nVarious visa statuses: F1 >> OPT >> H1B >> LPR (Green card category code E17)\n\nhttps://preview.redd.it/f2uzbhcjlkhe1.png?width=1202&format=png&auto=webp&s=e9a00b59671cc9b0a138c57ec3f9951ac691b90c", "subreddit": "USCIS"}
{"post_id": "1mmza5x", "title": "My brother was taken by ICE in Omaha Nebraska", "author": "u/Significant-Air1672", "score": 635, "num_comments": 293, "created": "2025-08-11T00:53:33+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mmza5x/my_brother_was_taken_by_ice_in_omaha_nebraska/", "is_self": true, "image_urls": [], "selftext": "Hello there. I’m new here. On June 26, my brother was detained by ICE.\nAbout two weeks ago, the judge ordered that he be removed from the United States. However, my brother is still being held and has not been deported.\n\nHe is 24 years old and has no criminal record. In order to speed up his departure, I brought his passport to the ICE office, hoping this would allow him to leave the country as soon as possible.\nDespite this, there has been no progress, and he remains in jail without a clear date for his release or deportation.\n\nWe are worried because we don’t know why the process is taking so long or what steps we can take to ensure he is released or deported quickly.\n\nIf anyone here has experience with ICE procedures, deportation timelines, or knows of organizations/attorneys who can help, please let me know.", "subreddit": "USCIS"}
{"post_id": "1h9b420", "title": "It’s official ", "author": "u/Zealousideal_Guest16", "score": 635, "num_comments": 139, "created": "2024-12-08T04:44:40+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1h9b420/its_official/", "is_self": false, "image_urls": ["https://i.redd.it/7czosor71k5e1.jpeg"], "selftext": "We finally made it and 💯 indefinite, God is absolutely good. Never thought I would be here, God I will forever be thankful. Friday I am leaving the country for the very first time after a decade!!!!", "subreddit": "USCIS"}
{"post_id": "1lohe7c", "title": "Trump’s justice department issues directive to strip naturalized Americans of citizenship for criminal offenses", "author": "u/Select_Specialist790", "score": 625, "num_comments": 325, "created": "2025-06-30T19:52:55+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lohe7c/trumps_justice_department_issues_directive_to/", "is_self": true, "image_urls": [], "selftext": "The Trump administration has codified its efforts to strip some Americans of their US citizenship in a recently published justice department memo that directs attorneys to prioritize denaturalization for naturalized citizens who commit certain crimes.\n\nThe memo, published on 11 June, calls on attorneys in the department to institute civil proceedings to revoke a person’s United States citizenship if an individual either “illegally procured” naturalization or procured naturalization by “concealment of a material fact or by willful misrepresentation”.\n\nhttps://www.theguardian.com/us-news/2025/jun/30/trump-birthright-citizenship-naturalized-citizens", "subreddit": "USCIS"}
{"post_id": "1m0ldrq", "title": "Approval/Timeline", "author": "u/Nassas02", "score": 621, "num_comments": 96, "created": "2025-07-15T15:50:30+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1m0ldrq/approvaltimeline/", "is_self": false, "image_urls": ["https://i.redd.it/iwomuk8n72df1.jpeg"], "selftext": "Context:\nMe (22F) and my husband (24M) met back in school in Brazil. I was 11 and he was 13 when we first met. We started dating in February 2021 and began living together in March 2024. We were in a long-distance relationship for three years, but I visited him in the U.S. several times, and he also traveled to see me. Although he's Brazilian, he became a U.S. citizen in December 2024.\n\nWe got married on February 4th and applied for the green card on March 5th — we didn’t hire a lawyer.\nLocation: Fort Lauderdale, FL\nForms filed: I-765, I-131, I-130, I-485\n\nTimeline:\n\nFeb 4th – Marriage\n\nMar 5th – Sent the application\n\nMar 14th – Biometrics appointment scheduled\n\nApr 4th – Biometrics done\n\nMay 2nd – I-765 (Work Authorization) approved\n\nMay 7th – EAD card was produced\n\nMay 10th – EAD card received\n\nMay 12th – Interview was scheduled\n\nJuly 1st – Interview\n\nINTERVIEW EXPERIENCE:\nOur interview was at 7:00 AM in Fort Lauderdale, and we arrived at 6:30 AM. We waited outside until they opened the doors and were the first ones called in. The officer was nice but serious.\n\nThe first thing he did was have us sign a paper stating that we would apply for the 10-year green card 90 days before the 2-year card expires. Then he asked for updated documents to prove that we’re still together.\n\nWe gave him about 30 new photos, our joint phone bill, and our joint bank account statement. After scanning the documents, he asked how we met. We told him we’ve known each other since we were kids. Then he asked about the proposal — we said it was more of an intimate conversation than a formal proposal, and that we plan to do something special like a trip in the future.\n\nHe looked at us and said, “Your relationship looks real to me,” and told us he would approve us. The whole thing took no more than 15 minutes.\n\nJuly 2nd – Case was approved on the website\n\nJuly 10th – Green card was produced\n\nJuly 12th – Green card received\n\nI hope this helps someone going through the process. Wishing everyone the best of luck!\n\n", "subreddit": "USCIS"}
{"post_id": "1ly05z5", "title": "Officially a U.S. Citizen! 🇺🇸", "author": "u/Putrid_Green6113", "score": 626, "num_comments": 72, "created": "2025-07-12T13:13:20+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ly05z5/officially_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/cl8v9awu0gcf1.jpeg"], "selftext": "Just wanted to share my excitement—today I became a U.S. citizen! 🎉\n\nI had my oath ceremony this morning (July 12) at 8:00 AM at the Baltimore, MD field office. The ceremony itself took about 30 minutes—short, sweet, and incredibly meaningful.\n\nMy N-400 Timeline:\n\t•\tNov 29, 2024 – Submitted application\n\t•\tMay 27, 2025 – Interview\n\t•\tJuly 12, 2025 – Oath ceremony\n\nEntire process took about 7.5 months.\n\nI’m so grateful for all the information and support shared in this community. This sub has been incredibly helpful throughout the process. Thank you all! 🙏\n", "subreddit": "USCIS"}
{"post_id": "1idq6k8", "title": "I did it 🇺🇸", "author": "u/Initial-Outside-7540", "score": 623, "num_comments": 99, "created": "2025-01-30T16:00:03+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1idq6k8/i_did_it/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1iufbp1", "title": "Became a citizen this morning 🥲", "author": "u/ilmdf18", "score": 619, "num_comments": 162, "created": "2025-02-21T01:47:11+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1iufbp1/became_a_citizen_this_morning/", "is_self": true, "image_urls": [], "selftext": "Hello everybody 👋🏽\nWanted to share my timeline and some resources that I found to be very helpful. \n\n12/31/24 – USCIS received my N400 (I applied and submitted online) \n\n1/16/25 - interview was scheduled for 2/20/25\n\n2/20/25 - arrived a little bit early to my appointment, maybe ~10 minutes early. Interview itself (6 civic test questions, 1 writing question, 1 reading question, N400 questions, spouse questions, reading through the information on the screen, signing a couple times, waiting for her to print the decision) probably took about 15 minutes. I was told that I passed everything and to wait in a different area of the waiting room for the oath ceremony. Waiting for the ceremony to start, the ceremony itself, and then registering to vote right after the ceremony ended (this was all still in the same building) took longer than the interview itself, but I was very happy and grateful to wait for everything.\n\nThe only resources I used were the flashcards on the USCIS N400 site, as well as the list of questions also on that site, and the Citizenship with Jackie YouTube channel that I saw someone else in this subReddit recommend. I played several of her videos at two times speed, took all of her suggestions about the do’s and don’ts during the N400 interview, and her suggestions on the easiest answers to remember.\n\nAlthough family members were allowed inside the building, they were not allowed to go inside the separate room for the actual oath ceremony. The regular welcome packets are also no longer given out (idk if this is a national thing or local, or since when this has been happening), and instead we were all given 1 sheet of paper each with information about the next steps like a passport, Social Security record, and replacement fee if we lose our certificate. We were all given little gifts if we registered to vote before exiting: green string backpack, a white hat, a sticker, a black pen/stylus, and a stress ball, all of which have some sort of voting design on them. \n\nI have not been sleeping well for the past week from all the stress of… everything (3-5 hours of interrupted sleep per night), so to finally be able to say that I’m a citizen feels surreal but also like a huge weight was lifted off my shoulders. I truly hope everyone that is still waiting gets a positive answer very soon, and that you get your certificates of naturalization. 🇺🇸 \n\nEdit: for everyone asking, Hialeah field office is where the interview, oath ceremony, and voting registration took place. Unfortunately, because my heart was pounding, and I was trying to control the nervousness in my voice, and hyperfocus on her questions so I can answer correctly and confidently, I immediately forgot the civic questions that she asked me as soon as we got to the reading and writing portion of the interview 😅😅😅😅😅😅 I considered the civic test portion as the only difficult portion because I haven’t had to study similar material since middle school. Some of that information has changed since middle school anyway, like state senator, house representative, governor, chief justice, and speaker of the house. The interview happened in a very similar way to what was portrayed in the YouTube channel I recommended above, so I would highly recommend to go to her YouTube channel and watch several of her recent videos so that you can be more prepared. The more you know about what to expect, the better you can prepare yourself and increase your chances of a smooth interview.\n\nEdit again: wow thanks for the award! First time getting an award for a post 😊", "subreddit": "USCIS"}
{"post_id": "1jgi6t6", "title": "Your Rights at US Airports and Ports of Entry", "author": "u/districtsyrup", "score": 615, "num_comments": 184, "created": "2025-03-21T14:31:38+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jgi6t6/your_rights_at_us_airports_and_ports_of_entry/", "is_self": true, "image_urls": [], "selftext": "I'm a PR who is understandably freaked out about all the news going around about PRs being detained, denied, deported by CBP. This ACLU document helped me prepare for my upcoming travel and gave me some peace: https://www.aclunc.org/our-work/know-your-rights/know-your-rights-us-airports-and-ports-entry\n\nSharing in case it helps anybody else.\n\nEdit: for the people in the back, the intention of this post is not to start a political discussion or share my political views. It's to **share a resource about green card holders' rights at the border in case somebody on the internet finds this helpful**. If you're trying to make this into a political issue, that's really weird of you. Much thanks.", "subreddit": "USCIS"}
{"post_id": "1o4t8c4", "title": "Finally free!", "author": "u/AutomaticStress7516", "score": 609, "num_comments": 81, "created": "2025-10-12T16:16:13+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1o4t8c4/finally_free/", "is_self": false, "image_urls": ["https://i.redd.it/sujdss2dhpuf1.jpeg"], "selftext": "I remember seeing posts like this on here and wondered when it would be my turn. Just wanted to share to bring some hope to those who are waiting or working towards this.\n\nI was an F1 student married to USC and started the process in 2020. Happy to answer any questions!", "subreddit": "USCIS"}
{"post_id": "1k1b1cj", "title": "20,000 USCIS staff apparently received email asking them to retire or be fired.", "author": "u/Downtown_Slice_4719", "score": 618, "num_comments": 268, "created": "2025-04-17T12:01:47+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k1b1cj/20000_uscis_staff_apparently_received_email/", "is_self": true, "image_urls": [], "selftext": "[https://www.financialexpress.com/world-news/us-immigration-backlogs-set-to-double-20000-uscis-staff-asked-to-retire-or-be-fired/3808538/](https://www.financialexpress.com/world-news/us-immigration-backlogs-set-to-double-20000-uscis-staff-asked-to-retire-or-be-fired/3808538/)\n\n[https://www.msn.com/en-in/news/world/will-us-immigration-wait-be-longer-now-uscis-employees-get-retire-or-get-fired-warning-amid-internal-shake-up/ar-AA1CPTMf?ocid=BingNewsSerp](https://www.msn.com/en-in/news/world/will-us-immigration-wait-be-longer-now-uscis-employees-get-retire-or-get-fired-warning-amid-internal-shake-up/ar-AA1CPTMf?ocid=BingNewsSerp)", "subreddit": "USCIS"}
{"post_id": "1k2ij1i", "title": "I just Became today US Citizens same day as Interview", "author": "u/Lutziok", "score": 609, "num_comments": 75, "created": "2025-04-18T23:19:38+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k2ij1i/i_just_became_today_us_citizens_same_day_as/", "is_self": false, "image_urls": ["https://i.redd.it/5j5kbfyjfove1.jpeg"], "selftext": "I start this process on Dec 1 2024 , I received notification that they will reusing my biometrics information ( I renewal my green card on 2019) on March 3 received notification for Interview on April 18, arrived 30 min early and wait for an 1hr  in the waiting room before they call me  (FO Indianapolis)\n\nInterview process\n\nStart with civic Question\n\n1.- What group of people was taken to America and sold as a Slaves ? Africans\n2.- The House of Representatives has how many voting members? 435\n3.- what movement tried to end racial discrimination? Civil rights movement \n4.- What territory did the unites states buy from France in 1803? Louisiana \n5.- A what age you need to register to selective services? Age 18\n6.- There were 13 original states. Name three\n-New York\n-New Jersey\n-New Hampshire\n\nReading test\n\n- Where does the President Lives\n\nWriting test\n\n- The President lives in the White House\n\nAfter that it was just “No” and “Yes” questions\n\nHe just tell me why I did not register to the selective services , and I said the Truth that I was not aware that I have to  do it on the webpage  I was 21 when I became LPR and I have now 36\n\nGood luck everyone, hope this post helps, I did read a lot in here that give me calm, you got this. The officer was nice and we completed it in 20 min\n\n\n\n", "subreddit": "USCIS"}
{"post_id": "1jv8y2v", "title": "USCIS to begin screening \"aliens'\" social media for 🍉", "author": "u/ExtraordinaryAttyWho", "score": 614, "num_comments": 279, "created": "2025-04-09T15:44:01+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jv8y2v/uscis_to_begin_screening_aliens_social_media_for/", "is_self": true, "image_urls": [], "selftext": "USCIS announced today that they will begin screening people's social media for what they consider to be anti-Semitism\n\nThis covers anyone applying for green cards, international students (of course they use the word \"foreign\") and any non-citizen affiliated with disfavored educational institutions - which could probably include professors and administrators\n\nAs we have seen with the F-1 visa/SEVIS terminations, this will very likely be AI/computer driven with very little regard to human discretion\n\nBut speaking of discretion, they're going to use disfavored social media activity as negative grounds to deny people immigration benefits\n\nAnd to be very clear - if Trump were going after people who are \"pro-Semitic\" - a lot of the trolls' positions on \"free speech\" would probably change. Mine would not. As a lawyer and an American, I believe that freedom of speech, due process, and other Constitutional rights apply to all persons within the United States, not just Americans and not just for political positions that Trump likes or dislikes\n\n[https://www.uscis.gov/newsroom/news-releases/dhs-to-begin-screening-aliens-social-media-activity-for-antisemitism](https://www.uscis.gov/newsroom/news-releases/dhs-to-begin-screening-aliens-social-media-activity-for-antisemitism)", "subreddit": "USCIS"}
{"post_id": "1hv71d5", "title": "Is it bad that I laughed at this? 😭", "author": "u/hercoffee", "score": 608, "num_comments": 104, "created": "2025-01-06T19:12:24+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hv71d5/is_it_bad_that_i_laughed_at_this/", "is_self": false, "image_urls": [], "selftext": "https://www.visajourney.com/forums/topic/628633-denied-entry-to-usa-on-a-k1-visa/\n\nI can’t think of a worse place to joke around than at U.S. immigration control  ", "subreddit": "USCIS"}
{"post_id": "1gbg8on", "title": "Finally reached the end of the line", "author": "u/Background-Aioli8084", "score": 612, "num_comments": 54, "created": "2024-10-24T23:16:22+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gbg8on/finally_reached_the_end_of_the_line/", "is_self": false, "image_urls": [], "selftext": "Took my oath at the Chicago Field Office today. \n\nChecked in at 12 PM, then gave up my green card and verified my naturalization certificate as I had my name changed.\n\nThe Judge came in around 1:15 PM and gave a wonderful speech welcoming us as new citizens.\nThen we went about the room, saying which country we are from. There were a few people from really interesting countries like Uganda, the Congo, and Fiji. After that we took the oath, and my immigration journey of 9 years was concluded in a 30 minute ceremony. It was a beautiful and heartfelt ceremony, perfect way to end my USCIS journey.", "subreddit": "USCIS"}
{"post_id": "1k2vehr", "title": "I traveled overseas and came back yesterday (Green Card)", "author": "u/broda92", "score": 604, "num_comments": 105, "created": "2025-04-19T12:42:31+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k2vehr/i_traveled_overseas_and_came_back_yesterday_green/", "is_self": true, "image_urls": [], "selftext": "I visited my family in Asia and flew back yesterday. I was really nervous because of all the news/posts that I've been reading. \n\nThe immigration officer basically asked for basic information, and he let us (me + family) in. It must've taken less than 5 minutes. \n\nI'm not doubting any of the scary incidents that have been happening, but I also think it's important to highlight what doesn't usually make the news. So if you're planning to travel, make sure you have your documents in order, don't do anything stupid, and be polite. ", "subreddit": "USCIS"}
{"post_id": "1laf111", "title": "Goodbye USCIS", "author": "u/MultivitamineAddict", "score": 599, "num_comments": 150, "created": "2025-06-13T12:46:15+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1laf111/goodbye_uscis/", "is_self": true, "image_urls": [], "selftext": "Hello everyone, there it is. It is my final post. Last week my passport came in the mail, followed by my naturalization certificate. In this post I want to put down my whole timeline and maybe a couple of things I learned along the way. Here we go.\n\n>maybe before I start with the timeline my biggest tip would be: keep every single document you receive from uscis\n\nEdit: Marriage based\nMarch 2021 - Wedding\n\n**Greencard (FO Honolulu HI):**  \nMarch 2021 - sent in the application for I-485, I-130, I-765 and I-131\n\n>Honestly here I don't know if 131 (Application for travel documents) was really necessary, I would have sent I-693 with it instead maybe (medical)\n\nJuly 2021 - Biometrics appointment notice for August 2021\n\nOctober 2021 - Recieved work and travel authorization (EAD)\n\nDecember 2021 - Interview invitation for end of January 2021\n\nJanuary 2022 - Interview\n\nJanuary 2022 - Approval letter and Greencard in the mail\n\n>At this point remember to write down in your calendar when to File I-751 (a bit less than 2 years after recieving your GC). Don't rely on getting a reminder\n\n**Extension (FO San Antonio TX)**  \nOctober 2023 - Reminder to send I-751 (Petition to remove conditions on residence / GC extension)\n\n>I did this whole process without lawyer, it was fine but it was still way more than I thought it would be at first. They ask for a lot of paper so make sure you have a lot of accounts, documents, letters, etc with both your names on it (if GC was marriage based). For example we had no utilty bills with both our names on it because I was the one taking care of it and I never thought to put my wifes name on there.\n\nDecember 2023 - I-751 sent\n\n>they were able to reuse my biometrics at this point\n\nDecember 2023 - \"temporary\" greencard recieved.\n\n>ok so this basically is a piece of paper that works as an extension. Put it somewhere safe, it is your new greencard but it's a piece of paper... I-751 takes almost 2 years until someone looks at it normally. (except in my case where I applied for naturalization before)\n\n**Naturalization (FO Greer SC)**  \nFebruary 2025 - N400 sent\n\n>Take a good look at the requirements for Naturalization, I had just moved states and almost sent my N400 too early (you need to wait 3 months when moving states).  \nAlso no need of biometrics for this one\n\nFebruary 2025 - Interview invitation (yeah that was quick)\n\n>Just learn for those 100 questions, also they ask you to bring every piece of paper they ever sent you. And just bring with you whatever they say to bring on the invitation. It's not that complicated\n\nApril 2025 - Interview. Interview went well, they spent a lot of time on my I-751 and then N-400 went really quickly. Recieved the Invitation for the ceremony at the end of the interview\n\nApril 2025 (5 days later) - Naturalization ceremony - 🇺🇸\n\nEnd of April 2025 - Sent in my naturalization certificate via usps for passport\n\n>Don't forget to sign the certificate and take a copy, I forgot to take a copy and when my employer wanted to get a copy I didn't have one. Wasn't a big deal but I just wished I had made a copy.\n\nEnd of May - Recieved my passport in the mail\n\nEarly June - Recieved my naturalization certificate in the mail\n\nThat's it, I'm american yay :D\n\nedit: grammar, field offices, dates", "subreddit": "USCIS"}
{"post_id": "1kp8yxg", "title": "I’m a US citizen!", "author": "u/kindly_fuck_offff", "score": 596, "num_comments": 55, "created": "2025-05-18T01:52:11+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kp8yxg/im_a_us_citizen/", "is_self": false, "image_urls": [], "selftext": "It still hasn’t fully sunk in, but I’m so incredibly grateful! 🇺🇸\n\nI submitted my N-400 application online on December 28 under the 3-year marriage rule. Had my interview on May 13 at the San Fernando field office, and was lucky enough to have a same-day oath ceremony!\n\nSwipe to see my full timeline. Happy to answer any questions for those going through the process!", "subreddit": "USCIS"}
{"post_id": "1mjcw5p", "title": "Applying for a Green Card can now trigger removal proceedings according to new policy!", "author": "u/Blackgoldeneye", "score": 588, "num_comments": 99, "created": "2025-08-06T18:40:42+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mjcw5p/applying_for_a_green_card_can_now_trigger_removal/", "is_self": true, "image_urls": [], "selftext": "This is crazy! Google it, because I’m not allowed to post press articles here. The policy went into effect on August 1, 2025, but it could possibly affect even those with pending applications. ", "subreddit": "USCIS"}
{"post_id": "1mhkoa6", "title": "State Department may require visa applicants to post bond of up to $15,000 to enter the US", "author": "u/thelexuslawyer", "score": 595, "num_comments": 278, "created": "2025-08-04T17:58:30+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mhkoa6/state_department_may_require_visa_applicants_to/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1jwj1ev", "title": "Just got this e-mail not too long ago. Should I be worried?", "author": "u/Glass_Resist1945", "score": 592, "num_comments": 694, "created": "2025-04-11T06:06:55+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jwj1ev/just_got_this_email_not_too_long_ago_should_i_be/", "is_self": false, "image_urls": ["https://i.redd.it/n3sadtgxc5ue1.jpeg"], "selftext": "I'm here on parole for my I-485, so I've never had any issues with that until just now. Of course it gets sent when you can't call USCIS so now I'm just wondering if this is legit or sent by mistake or a scam, idk.\nIt was sent by CBPAutomatedMessage@cbp.dhs.gov", "subreddit": "USCIS"}
{"post_id": "1l04ox1", "title": "My best birthday gift this year: Green Card 🪪 🎉", "author": "u/fer_schez", "score": 587, "num_comments": 72, "created": "2025-05-31T18:57:44+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1l04ox1/my_best_birthday_gift_this_year_green_card/", "is_self": false, "image_urls": ["https://i.redd.it/vvv18411064f1.jpeg"], "selftext": "My birthday was yesterday, May 30, and today I just got the best birthday gift I could get this year: my Green Card 🪪 🙌🏾 \n\nHere my TL: \nhttps://www.reddit.com/r/USCIS/s/UrmdFRP7fN\n\nI hope everyone is waiting for approval, get it soon 🙏🏾\n", "subreddit": "USCIS"}
{"post_id": "1k063xn", "title": "Uncle passed citizenship tests, denied anyway by officer", "author": "u/watchark", "score": 585, "num_comments": 141, "created": "2025-04-15T23:21:07+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k063xn/uncle_passed_citizenship_tests_denied_anyway_by/", "is_self": true, "image_urls": [], "selftext": "Hi guys, wondering if anyone else has any experience with this. My uncle had his citizenship test today. He was asked 7 questions from the civic test (the sixth one was counted wrong because he didn't answer fast enough) and passed the written and oral portions fine, but at the end the officer still told him she \"didn't like how he talked\", told him to practice his English more, and failed him. Has this happened to anyone else? We thought passing the oral and written portion was enough demonstration of English speaking ability. Can the officers really fail you because they don't like how you talk/that you respond too slowly? This was at the Detroit office,  and he had to drive 3 hours for this. Thankfully he's got another chance in 3 months, though. Any comments/thoughts are appreciated, we're really confused on this, but my googling skills are failing me right now.\n\nedit: Thank you for the suggestions everyone. I think my mom and I are going to help him review his letter response to see if we need to consult a lawyer, but I'm also gonna strike up a habit of calling him so we can practice his English more and make double sure this doesn't happen again. I definitely don't call him enough as is haha oops. Best of luck to anyone with applications!", "subreddit": "USCIS"}
{"post_id": "1gmt1hs", "title": "I’m safe!", "author": "u/Local-Mind9580", "score": 585, "num_comments": 36, "created": "2024-11-08T21:03:23+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gmt1hs/im_safe/", "is_self": false, "image_urls": ["https://i.redd.it/uqtttjohsqzd1.jpeg"], "selftext": "Oh shit looks like I’m safe!! lol just kidding thought I’d lighten the mood 😅", "subreddit": "USCIS"}
{"post_id": "1n5354d", "title": "Finally a U.S. Citizen! 🥳🇺🇸 Despite a past arrest.", "author": "u/usadev", "score": 586, "num_comments": 126, "created": "2025-08-31T19:07:16+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1n5354d/finally_a_us_citizen_despite_a_past_arrest/", "is_self": false, "image_urls": [], "selftext": "**Finally, I’m a U.S. citizen! 🥳🇺🇸**\n\n**The Certificate Holder is from Amazon.**\n\nThe journey was long and stressful. I spent 5 years and about $6,500 on an attorney, even though I had a green card.\n\nMy interview was nerve-wracking, but I answered all questions correctly, including questions about a past arrest. Hours later, my USCIS account updated: *“Your Form N-400… was placed in line for oath ceremony scheduling.”* My attorney confirmed—congratulations!\n\nDespite the pending ceremony, I traveled abroad for 20 days. I was pulled into secondary screening, and they checked my luggage—but thankfully nothing serious happened. Everything worked out, and I attended the oath ceremony on schedule.\n\n**Timeline:**\n\n* **2019 May:** Won Green Card\n* **2020 Feb:** Landed in the USA. COVID time.\n* **2023 Dec:** Arrested, hired a criminal attorney, and the case was later dismissed.\n* **2024 Dec:** Hired an immigration attorney\n* **2025 Mar:** Applied for naturalization & biometrics\n* **2025 Apr:** Interview scheduled\n* **2025 May:** Interview day\n* **2025 Jul:** Oath ceremony scheduled\n* **2025 Aug:** Traveled abroad\n* **2025 Aug:** Officially became a U.S. citizen 🎉\n\nIt was stressful and expensive, but worth it—thrilled to finally be a citizen!", "subreddit": "USCIS"}
{"post_id": "1ksonpt", "title": "My Father failed the citizenship test because he didn’t say the exact answer", "author": "u/Mediocre-Property395", "score": 579, "num_comments": 340, "created": "2025-05-22T11:48:01+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ksonpt/my_father_failed_the_citizenship_test_because_he/", "is_self": true, "image_urls": [], "selftext": "Hello, my father could have passed the citizenship test but the agent denied one of the questions because he said the flag has 13 stripes because of “the 13 colonies” and not “the 13 original colonies.” He could have passed it had she given him this question but he failed and has to retest in two months. \n\nMy father has a literacy problem and has trouble understanding what is being said to him and this was addressed by his doctor in an N-648 which was denied because it is not a disability but the whole time the agent was being rude to him because he was taking time to answer the questions and kept telling the interpreter in a rushed manner to tell him to answer the question. I want to know if there’s anything I can do to appeal this question and if it is recommended since he was scheduled to go in two months. ", "subreddit": "USCIS"}
{"post_id": "1mqa2ci", "title": "Finally green after 24 years! (DACA to LPR)", "author": "u/Mikaso420", "score": 573, "num_comments": 51, "created": "2025-08-14T19:10:37+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mqa2ci/finally_green_after_24_years_daca_to_lpr/", "is_self": false, "image_urls": ["https://i.redd.it/2mxbca3pa1jf1.jpeg"], "selftext": "I’ve been lurking on r/USCIS and r/DACA for so long and can finally post my story! Will share timeline and experience below. \n\nFor context, I came to the US in 2001 and was a DACA recipient for 10+ years. My husband and I had our civil ceremony in April and concurrently filed I-130, I-485 and I-765. I got my greencard in 3.5 months!\n\nPD 4/25/2025\nBiometrics reuse notice 4/30\nInterview scheduled notice 6/24 \nInterview 8/5 NYC FO, verbal approval\nOfficial approval 8/6 for I-130 and I-485\nI-765 denied 8/12 because “received status through other means”\nGreencard delivered 8/14\n\nFor joint evidence, we submitted health insurance, 40+ photos, car insurance/lease/registration, house lease (3 yrs), utility bill, upcoming flight, marriage certificate. We used a lawyer. \n\nFor the interview, we practiced as if we would go in for a stokes interview/be separated. I was worried because our driver’s licenses don’t match (different states) and hearing about some bad interviews. We were lucky and had a very nice officer who seemed as if she had already decided to approve us and the interview was just a formality. No questions about our relationship at all. I was only asked ~5 of the I-485 yes/no questions. \n\nSince learning about my status as a teen I have felt so helpless and sad, constantly being in limbo and the monkey in the middle of politics. I finally feel like I can breathe. For anyone out there reading this, I am sending you love and crossing my fingers that you will feel this same sigh of relief very soon! Will answer any questions.\n", "subreddit": "USCIS"}
{"post_id": "1i7d39e", "title": "Summary of Presidential Executive Orders that Affect Immigration", "author": "u/HappyCamper4Life1", "score": 571, "num_comments": 201, "created": "2025-01-22T15:04:12+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i7d39e/summary_of_presidential_executive_orders_that/", "is_self": true, "image_urls": [], "selftext": "**Summary of Presidential Executive Orders that Affect Immigration**\n\n* **National Emergency Declaration**\n   * Declares a national emergency on the southern border of the U.S.\n   * Purpose: allocate military funds and resources to expand the border wall (more like a fence) and send troops to repel the supposed \"disastrous invasion\" of the country.\n* **Cancellation of the CBP One App**\n   * The app created by the Biden administration, used to schedule appointments with immigration officials for asylum requests, was shut down.\n   * Migrants in various border cities in Mexico had their appointments canceled immediately after the presidential inauguration.\n   * An estimated 280,000 people accessed the app daily.\n* **Reinstatement of the \"Remain in Mexico\" Policy**\n   * Requires asylum seekers to wait in Mexico while their cases are processed in U.S. immigration courts.\n   * Initially implemented in 2019, it was criticized for exposing migrants to dangerous conditions in Mexico and was terminated by the Biden administration in 2021.\n   * The practical implementation of this policy depends on the cooperation of the Mexican government.\n* **Attempt to Revoke Birthright Citizenship**\n   * Declares that children of undocumented immigrants born in the U.S. will not be recognized as citizens.\n   * Contradicts the 14th Amendment of the U.S. Constitution.\n   * This measure is expected to be challenged in court quickly.\n   * Relies on legal precedents like the 1898 case, *United States vs. Wong Kim Ark*, which reaffirmed birthright citizenship.\n* **Designation of Drug Cartels as Foreign Terrorist Organizations**\n   * Classifies drug cartels as terrorist organizations due to the nature of their criminal activities.\n   * Imposes sanctions, legal restrictions, financial penalties, and travel bans on individuals or institutions associated with these cartels.\n* **Invocation of the Alien Enemies Act**\n   * A rarely used 1798 law was invoked to eliminate foreign gangs and criminal networks in the U.S.\n   * Debate exists on whether the conditions for its application (declared war, invasion, or predatory incursion) are applicable in the current context.\n* **Enforcement Operations**\n   * No reports yet of large-scale removal operations or mass deportations.\n   * Increased enforcement and removal operations are expected.", "subreddit": "USCIS"}
{"post_id": "1m1f9lw", "title": "Had My Marriage-Based GC Interview Yesterday – Still Shaking and Pissed at My Husband", "author": "u/Unusual_Buyer9227", "score": 564, "num_comments": 162, "created": "2025-07-16T15:15:38+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1m1f9lw/had_my_marriagebased_gc_interview_yesterday_still/", "is_self": true, "image_urls": [], "selftext": "Quick Update - Hey guys, our I-130 and I-485 has been approved !!!!!\nThis community has been really helpful, sharing the timeline for helping other people.\n\nTimeline -\n\nHistory\nJul 15, 2025 - Case approved.\n\nJun 10, 2025 - We scheduled an interview for your Form I-485, Application to Register Permanent Residence or Adjust Status.\n\nJun 10, 2025 - We are actively reviewing your Form 1-485, Application to Register Permanent Residence or Adjust Status. Our records showed nothing is outstanding at this time.\n\nMay 23, 2025 - We scheduled you for a biometrics appointment\n\nMay 05, 2025 - We received your Form I-485, Application to Register Permanent Residence or Adjust Status, and sent you a receipt notice.\n\n\nOG post - \nRant time. I had my marriage-based green card interview yesterday at Dallas office and I’m STILL stressed. My husband — God bless his heart — is the most nervous human on Earth. He freezes under pressure, and at the worst possible time, he became a confused mess. 🙃\n\nThe officer literally started the interview by asking, “Why is your husband so nervous? Nervousness usually means fraud. Is your marriage real?”\nLIKE WHAT??? That’s how we kicked off! Not even a “hi.” I nearly passed out.\n\nThen came a flood of personal questions:\n\t•\tWhy did you get divorced?\n\t•\tWhen did you get married?\n\t•\tWhen did your kids meet their stepmom?\n\t•\tWhere did you go for your honeymoon?\n\t•\tDid you meet each other’s families?\n\nTotally fair questions — I get it. But my dear husband was fumbling dates, mixing up timelines, and at one point looked at me for help like he forgot how calendars work. 😵‍💫\n\nI held it together, answered confidently, but every time he opened his mouth I felt like screaming. It wasn’t lies, just poor delivery and nervous confusion. Ugh.\n\nThe officer was firm and kinda rude, but still professional. After wrapping up the I-485 questions, he just said, “Let me escort you out. Any questions for me?”\nWe said no… and now I’m wondering if we should’ve asked something? Like when we’ll hear back or if he needed more docs?\n\nNow I’m spiraling — wondering if our nerves and his awkward answers made us look suspicious.\nIt’s a real marriage, a good one. We live together, love each other, share everything. But damn, my husband needs a crash course in staying calm under pressure.\n\nAnyway, no approval on the spot. No “you’ll hear from us.” Just a walkout. I’m losing sleep thinking we blew it.\n\nAnyone else been through this mess? How long till we hear back? Did we screw this up?\n", "subreddit": "USCIS"}
{"post_id": "1jlekaj", "title": "I'm finally a US Citizen. IT went by fast..... too fast.", "author": "u/smashnpassion", "score": 556, "num_comments": 125, "created": "2025-03-27T21:40:06+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jlekaj/im_finally_a_us_citizen_it_went_by_fast_too_fast/", "is_self": true, "image_urls": [], "selftext": "So, I became a US citizen this Tuesday. I finished my interview and oath taking all at the same day. It happened way too fast, too fast that the wait time in the lobby is way longer than the interview and oath taking process itself. I was expecting to be in a separate ceremony where I can wear a suit and tie but I can't complain. The process is done and I wish for everyone with pending cases in this sub reddit nothing but the best and you'll get the result that you're hoping for in the future. ", "subreddit": "USCIS"}
{"post_id": "1n1sdhb", "title": "Finally approved and did my oath after 33 years.", "author": "u/xregnierx", "score": 556, "num_comments": 57, "created": "2025-08-27T20:35:43+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1n1sdhb/finally_approved_and_did_my_oath_after_33_years/", "is_self": false, "image_urls": ["https://i.redd.it/kjoj8m7qhmlf1.jpeg"], "selftext": "It happened.\n\nI know this will not get a lot of traction because it’s an “open and shut” case.\n\nBut to put it simply, it wasn’t.  A lot of extenuating circumstances made it not so.   A mistake with my intake labeling me as not legal to work, my father not finishing or telling me what I needed to do before I turned 18 (where I lost a lot of my ability to essentially have these things given to me without all the effort).\n\nI’ve spent the last 20 years of my life fighting off and on with UsCIS.  Multiple attempts to reopen a denied N600 and finally succeeding after spending more than 15 grand.\n\nI’m finally done.  Thank you for all the people who put up with my incessant panic.  Genuinely to the person who suggested I send a certified letter, you helped me more than anything.\n\nThank you so much.\n\nI’d send the actual picture but I’m hesitant to put that up so you’ll just have to settle for the thing I bought for it.", "subreddit": "USCIS"}
{"post_id": "1h6xl95", "title": "Green card DELIVERED!", "author": "u/Impressive-Ad6361", "score": 553, "num_comments": 129, "created": "2024-12-05T01:45:45+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1h6xl95/green_card_delivered/", "is_self": false, "image_urls": [], "selftext": "•Case Approved 11/23/24\n\nhttps://www.reddit.com/r/USCIS/s/xu39EkjSMI\n\n\n\n•Card Produced 12/02/24\n\n\n\n•Card Delivered 12/04/24", "subreddit": "USCIS"}
{"post_id": "1jjs1ee", "title": "USCIS pauses green card applications for refugees and asylum", "author": "u/Downtown_Slice_4719", "score": 550, "num_comments": 382, "created": "2025-03-25T19:32:43+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jjs1ee/uscis_pauses_green_card_applications_for_refugees/", "is_self": true, "image_urls": [], "selftext": "[U.S. pauses some green card applications as part of aggressive vetting effort](https://www.msn.com/en-us/news/us/u-s-pauses-some-green-card-applications-as-part-of-aggressive-vetting-effort/ar-AA1BDBQW?ocid=entnewsntp&pc=U531&cvid=76824e2e1b914036aa26286acf9fa918&ei=12)", "subreddit": "USCIS"}
{"post_id": "1icknbo", "title": "Approved without interview", "author": null, "score": 560, "num_comments": 56, "created": "2025-01-29T03:29:58+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1icknbo/approved_without_interview/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1iikj7p", "title": "APPROVED!!", "author": "u/Prudent_Leg_6967", "score": 546, "num_comments": 193, "created": "2025-02-05T20:52:47+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1iikj7p/approved/", "is_self": false, "image_urls": ["https://i.redd.it/5xeynx7qvdhe1.jpeg"], "selftext": "I cannot believe this! Thank you so much everyone for all the help. \n\n", "subreddit": "USCIS"}
{"post_id": "1ljqak7", "title": "After 26 years and 10 months… I think I’m finally American? 🇺🇸", "author": "u/Impatientlywaiting98", "score": 542, "num_comments": 93, "created": "2025-06-24T23:23:09+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ljqak7/after_26_years_and_10_months_i_think_im_finally/", "is_self": false, "image_urls": ["https://i.redd.it/8dl8gif9ly8f1.jpeg"], "selftext": "Honestly, I’m still in shock. I didn’t think this day would ever come. Almost 27 years in the U.S., and today I became a citizen. I’m not even sure how to feel—grateful? Emotional? Still processing?\n\nI was told for years (by multiple lawyers) that my only chance was through amnesty. See, I came here as a kid, and somewhere along the way, I lost my passport. No proof of entry. No clear path. Even though my parents eventually became citizens, they told me I was stuck. The lawyers said my proof was probably long gone—it was the 90s, after all.\n\nBut one day, kind of randomly, I decided to apply for my I-94. I didn’t even think it would go anywhere… but that’s when everything started to change. That moment opened the door I thought was permanently shut.\n\nAnd today, sitting in that ceremony, I met a man who had been jailed, deported, banned for 10 years—he became a citizen too. After 15 years. Everyone in that room had a story. Some looked relieved, some looked overwhelmed, some were straight-up crying. And honestly? I get it now.\n\nThey told us to think of this as our second birthday. And… maybe they’re right.\n\nDon’t give up. Even when it looks impossible.", "subreddit": "USCIS"}
{"post_id": "1j615ft", "title": "Looks like USCIS has a new social media manager.", "author": "u/-Asylum_", "score": 539, "num_comments": 205, "created": "2025-03-07T21:43:43+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1j615ft/looks_like_uscis_has_a_new_social_media_manager/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1ivzdfk", "title": "APPROVED!! GOD DID 🙏", "author": "u/di_Vine32", "score": 542, "num_comments": 282, "created": "2025-02-23T02:08:39+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ivzdfk/approved_god_did/", "is_self": false, "image_urls": ["https://i.redd.it/uasro5qkrske1.jpeg"], "selftext": "Wanna start by saying thanks to God almighty cause it was surely his doings.\n\nSecondly, let me say a big thanks to all of you on this subreddit. We’re all in the same boat and we’ve and still helping each other navigate through this immigration storm. Finally ,after 5 months my AOS was accepted. I know someone, somewhere is giving up but I would say , keep holding on and keep trusting God. \n\nKindly check my previous post I answered most of the questions already and I’ll be more than willing to answer more as I did the entire process by myself using this thread and other YT videos.\n\n👉🏽PD: September 19, 2024\n👉🏽Adjusted from F1\n👉🏽Wife is a USC and our marriage is ( 1000%) real\n👉🏽 I-765 got approved in 46 days \n👉🏽 got one RFE for affidavit of support in October and submitted in November \n👉🏽 Got interview notice on February 7 for both 485 & 130\n👉🏽 Attended the interview in SF on the 20 and it went smoothly in fact, we were not separated ( did the interview jointly).\n👉🏽21 of February, both 130 ( earlier around 9 am ) and 485 ( 4pm the same day) was approved.\n", "subreddit": "USCIS"}
{"post_id": "1nx6j5t", "title": "Finally I'm a US citizen 🙏🏼🇺🇸", "author": "u/Guilty-Abrocoma-3919", "score": 540, "num_comments": 73, "created": "2025-10-03T18:06:02+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nx6j5t/finally_im_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/k3n5ta1rsxsf1.jpeg"], "selftext": "Hello fellow friends,\n\nYesterday I was greatful and thankful enough to become a US citizen!! 🇺🇸🙏🏼. I applied in may 29 2025 my FO is LA county. Interview was smooth I've been a Permanent resident since 2016 I had pretty big absence of 4 years since I was doing my studies in abroad. But I applied 2 i-131 travel documents in 2017 and 2019. Technically I could've applied for n-400 in 2020 since I had the absence my time was resetted so I had to calculate from may 2020.\n\nDuring the interview they asked alot about my absence and I asked my i-131 approvals good thing I had everything in handy. When the officer noticed 4 year absence officer's mood changed a bit. But then again since I had pretty much all the evidence i was okay and I think it has happened beyond my 5 years of wait time they were okay I think.\n\nFirst the officer asked me civics questions I answered 6 correctly then she shopped and asked me to write \"California has the most people\". Finally asked couple questions regarding my basic information address marital status height. Then officer asked if they approve if I'd be okay for a same day oat ceremony and officer stepped out. I believe I was the last one to do the interview I said yes I wasn't expecting a same day since they called to the interview around 1:30 pm.. Officer was very nice and polite very thorough.\n\nAlso take a copy of your selective service you can get it from the selective service website\n\nFYI I had my lawyer with me also. We both dressed in full on suits with ties. Looked like something out of suites tv series 😂\n\nFeel free to ask any questions!", "subreddit": "USCIS"}
{"post_id": "1i5g45y", "title": "Conditional Resident to Citizenship in 7 weeks!", "author": "u/Negatibooo", "score": 536, "num_comments": 108, "created": "2025-01-20T02:38:54+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i5g45y/conditional_resident_to_citizenship_in_7_weeks/", "is_self": false, "image_urls": [], "selftext": "For those who may not know, you can apply for U.S. citizenship even as a conditional resident if you serve in the Armed Forces. Speaking from my experience in the Air Force, the process was smooth, efficient, and incredibly fast. I didn’t even need to go through the I-751 removal of conditions.\n\nThe U.S. Air Force is fully committed to helping trainees become naturalized citizens before graduation. It’s a significant milestone, and we are recognized for it during the ceremony.\n\nThe process begins on Day 1 of basic military training (BMT). All trainees with green cards are identified, and our information is collected to start the process. During the first week, we had an appointment with the USCIS liaison office on base. There, we created or updated our USCIS accounts, uploaded essential documents like our Green Card and Driver’s License, and answered questions about our addresses, jobs, and education—similar to the green card application process. At this stage, the application remained in draft form, and we used our own phones to complete it.\n\nDuring the second week, we received our N-426 Certification of Military or Naval Service, signed by the BMT commander. This document is key to the citizenship process. Once we uploaded it, we finalized and submitted our application. The liaison ensured the application was expedited for faster processing.\n\nIn the third week, we completed biometrics. Since I had already done mine for my I-485 application, I didn’t need to repeat it, but others did. It was the same process as before. From that point on, all that was left was the interview, civics test, and oath ceremony.\n\nWe were given study materials for the 100-question civics test, which was straightforward, and everyone passed. The interview and oath-taking can happen anytime between Weeks 4 and 7, but for us, it was scheduled the day before graduation.\n\nEverything went smoothly. By the time we graduated as Airmen of the world’s greatest Air Force, we were also proud U.S. citizens.\n\nThis journey isn’t just about me. I’m now working on petitioning for my mother so she can join me here. She deserves a better life, and I’m doing this for her. Serving in the Air Force has been life-changing—not just for me, but for my family.", "subreddit": "USCIS"}
{"post_id": "1jn061o", "title": "Got approved! Here’s our story about our interview and questions he asked us yesterday.", "author": "u/OkYam5581", "score": 541, "num_comments": 102, "created": "2025-03-30T00:13:24+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jn061o/got_approved_heres_our_story_about_our_interview/", "is_self": false, "image_urls": ["https://i.redd.it/spbu6bswypre1.jpeg"], "selftext": "Yesterday morning, my wife (a U.S. citizen) and I (a DACA recipient) had an interview at USCIS in Santa Ana. We arrived about 20 minutes early for our 8:00 AM appointment. \n\nA man called my name, and we followed him to his office. Upon entering, we noticed many posters of soccer and the Dodgers. It was clear he was a huge fan of both.\n\nNaturally, we were nervous, but he reassured us not to worry, telling us that he wasn’t a bad person. He began reviewing our case on the computer and asked us to take an oath, which we did.\n\nBefore diving into the formal questions, we started talking about sports—football, baseball, basketball, and soccer. It was a pleasant conversation.\n\nThen, he began asking us some basic questions:\n\n\"What’s your name?\"\n\"What’s your birthdate?\"\n\"What’s your current address?\"\nNext, he asked me several yes/no questions:\n\n\"Have you ever been arrested?\"\n\"Have you been involved in drug trafficking?\"\n\"Have you ever been deported?\"\n\"Have you ever left the United States?\"\n\"Have you committed fraud against the federal government?\"\n\nI answered No to all questions. \n\nHe then asked if we had any additional evidence. We showed him our large file, probably over 250 pages. I asked if he wanted the photos from our timeline, and he said yes, it would be helpful. I handed him about 80 pages of photos documenting our timeline. He asked if we had any wedding photos, and I told him they were included in the timeline.\n\nHe scanned all 80 pages and then asked if we had any rental or mortgage documents. I explained that we didn’t because we live with my parents and take care of the house. He reassured us, saying, “Don’t worry about it. I believe you. You’ve given me plenty of evidence with the 80 pages of photos.”\n\nWhile he worked, we chatted about the Lakers and Dodgers, as we are huge fans of both teams. We shared some jokes and laughed together.\n\nFinally, he completed the process, stood up, and handed me a letter. He pointed to the word \"approved.\"\n\nMy wife and I became emotional. We were overjoyed and hugged each other. Of course, my wife cried.\n\nWe are grateful to have had such a kind and considerate officer handling our case.\n\nMy wife and I have been together for 8 years and married for 2 years.\n\nTimeline:\n\nSubmitted I-130, I-485, I-765, and medical records to Chicago from Southern California on March 30, 2024\nUSCIS received them on April 4, 2024\nI-765 approved on June 24, 2024\nInterview on March 28, 2025\nApproved after the interview.", "subreddit": "USCIS"}
{"post_id": "1kvl2p7", "title": "Got my citizenship", "author": "u/Longjumping_Pomelo66", "score": 538, "num_comments": 35, "created": "2025-05-26T03:59:54+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kvl2p7/got_my_citizenship/", "is_self": false, "image_urls": ["https://i.redd.it/3zigbgdav13f1.jpeg"], "selftext": "I got my citizenship last Friday at Orlando FO. I arrived at the FO 30mins earlier than my appointment. The check-in was pretty easy and at least 5 mins waiting for the interview. The officer asked me to read a sentence on the screen and then had me write down what he was saying. He asked random 6 civics question from the computer that I answered all correctly and went ahead about my N-400 form. He asked for my address, work, travel, husband and the \"have you ever\" questions. I didn't put in my form my traffic citations but told him about it when he asked about citations. He said that it doesn't disquality my eligibility which was a relief. He asked if I'm going to travel soon and I said yes. Then told me that I can do the oath taking that afternoon or he can schedule me after my international trip. I said I wanted to do it that day and will just figure out my passport after. I didn't expect that I will be having my oath taking the same day bec my appointment is at 1:45pm. I was the last one included for the oath taking. It took at least 2 hrs for everything. I entered the building as a resident and came out an American!🇺🇸", "subreddit": "USCIS"}
{"post_id": "1iy4e95", "title": "HUGE NEWS!", "author": "u/Fashionboy_SD", "score": 528, "num_comments": 122, "created": "2025-02-25T20:06:22+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1iy4e95/huge_news/", "is_self": false, "image_urls": ["https://i.redd.it/7idxu5dodcle1.jpeg"], "selftext": "Pretty big news for all refugees! 🙏", "subreddit": "USCIS"}
{"post_id": "1mbfx9q", "title": "Just became a citizen", "author": "u/Which-Blueberry-7725", "score": 526, "num_comments": 49, "created": "2025-07-28T13:17:30+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mbfx9q/just_became_a_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/id8ywkp68mff1.jpeg"], "selftext": "Came to America in 2014 here is the timeline \n- arrived on J-1 visa\n- Married and then Divorced \n- Married again \n\nBrutal interview \n- Officer was very well prepared and so was I\n- 2- hour interview \n\nTake ways \n- be prepared \n- know your immigration history \n- know you travels\n- Have proof of everything, take them, label them, highlight stuff.\n\nBottom line : Make it easier for USCIS to make a decision and don’t give them a chance to deny \n", "subreddit": "USCIS"}
{"post_id": "1lba851", "title": "Finally Got My Green Card!!! 🎉", "author": "u/nelly--1", "score": 524, "num_comments": 45, "created": "2025-06-14T14:38:34+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lba851/finally_got_my_green_card/", "is_self": false, "image_urls": ["https://i.redd.it/7aj0brwjmw6f1.png"], "selftext": "I entered the country on July 27, 2024 but only received my SSN in the mail within two weeks of my arrival. I had to leave the country again to finish school (travelled on I-551 stamp in passport) but when I returned, still no green card. For a while, my case status had said \"Immigrant Fee Payment Received\" and I was getting worried. After contacting my congresswoman on May 13, 2025 my green card was mailed to me on May 22! I'm so happy it's finally here!!! 🎉 ", "subreddit": "USCIS"}
{"post_id": "1ktiux0", "title": "ICE begins new, nationwide effort to arrest illegal aliens at immigration hearings", "author": "u/Head_Estate_3944", "score": 521, "num_comments": 152, "created": "2025-05-23T12:55:04+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ktiux0/ice_begins_new_nationwide_effort_to_arrest/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1itgiam", "title": "APPROVED!!!!!", "author": "u/gkhoen", "score": 522, "num_comments": 196, "created": "2025-02-19T21:02:08+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1itgiam/approved/", "is_self": false, "image_urls": ["https://i.redd.it/yeekz7o5u5ke1.jpeg"], "selftext": "After USCIS losing my first package and having to re-submit everything all over again, my GC was finally approved exactly five months after the package was received in Chicago! \n\nI noticed that I was getting closer to the finish line when about two weeks ago an email saying that an action had been taken on my case was sent. Even without any updates in the portal I was optimistic something was cooking, and indeed it was! \n\nPD: 9/20/2024\nApproval notice: 2/18/2025\n\nWishing everyone whose been waiting anxiously to receive good news soon! \n\nBest of luck! ", "subreddit": "USCIS"}
{"post_id": "1iqla1q", "title": "USCIS 50+ employees laid off", "author": "u/zninjamonkey", "score": 519, "num_comments": 238, "created": "2025-02-16T05:33:41+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1iqla1q/uscis_50_employees_laid_off/", "is_self": false, "image_urls": [], "selftext": "“A minimum of 50 employees were cut at the U.S. Citizenship and Immigration Services…”", "subreddit": "USCIS"}
{"post_id": "1ibfp2z", "title": "I-130 approved in one day", "author": "u/Early-Deer3294", "score": 518, "num_comments": 528, "created": "2025-01-27T18:09:27+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ibfp2z/i130_approved_in_one_day/", "is_self": false, "image_urls": ["https://i.redd.it/tmb1h3sdukfe1.jpeg"], "selftext": "Hello everyone! I received this a day after filling I was wondering the next steps it says the processing center will be in touch if not inquire after 45 days. Do they get back to applicants faster than 45 days?\nAny help is greatly appreciated ❤️", "subreddit": "USCIS"}
{"post_id": "1ierzlq", "title": "Field office ISO here, AMA", "author": null, "score": 515, "num_comments": 397, "created": "2025-01-31T23:01:00+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ierzlq/field_office_iso_here_ama/", "is_self": true, "image_urls": [], "selftext": "Time to kill tonight. Same rules as usual, no timeline questions, no receipts, no PII. \n\nI appreciate questions about the job itself, but I imagine most now will about the admin. Spoiler alert: nothing has changed. Yet. ", "subreddit": "USCIS"}
{"post_id": "1k3y3sk", "title": "Coming back after a trip overseas with expired green card.", "author": "u/_____Gabriel_____", "score": 503, "num_comments": 138, "created": "2025-04-20T22:20:35+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k3y3sk/coming_back_after_a_trip_overseas_with_expired/", "is_self": true, "image_urls": [], "selftext": "Good evening,\nMy green card is expired since March. \n\nI went to Italy for a week with a green card expired since March, I did bring with me my extension letter that I received when I applied for removal conditions I-751.\n\nI do have global entry, as I love to travel abroad. Coming back, when I arrived at Boston Logan. When I scanned my passport the machine asked to scan another document, then I scanned my expired green card, on the screen showed to proceed to the line and to talk to an agent. \n\nThe agent was super polite, I showed my green card and passport. For some reason in his system it was showing that I didn’t have global entry (probably because my green card is expired). He asked me for my global entry card. I showed him, he asked how was my trip, asked me if I had something to declare and to finalize he said I can continue to use the global entry, because he knows how long it takes the process to get a new green card and said: Welcome back!\n\nI’m not really afraid to travel abroad, I have to other trips overseas schedule for this year so far. \n\nJust posting here, because I know some people are afraid to travel abroad, if you want to do it, just bring all the documents with you.\n\nFeel free to ask me anything.\n\nHappy Easter. ", "subreddit": "USCIS"}
{"post_id": "1k6qj5v", "title": "Same sex marriage — APPROVED!!!", "author": "u/infinitestars7337", "score": 499, "num_comments": 176, "created": "2025-04-24T12:06:48+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k6qj5v/same_sex_marriage_approved/", "is_self": true, "image_urls": [], "selftext": "Hey Everyone! Just sharing my story to help and give any one else some sense of relief! \n\nWe had our interview on April 15th and got super lucky with a kind officer 🙏 \nHere are the questions:\n\nWhen did you meet ? What year? \nWhere did you meet?\nHow did the relationship develop? Grow more serious ? \nWhere did she work during the time you dated ?\nWhat about her made you want to marry her? \nDescribe what do you like about her? \n\nDo you plan on having kids? What are those hesitations ? \nWhere have you traveled ? \nDo you plan to travel more ? Where?\nHave you met each other’s families ? \nWhat future plans do you have? \n\nYes/ no questions of I-485 application \n\n\nDidn’t ask about joint acct\nWe had updated paystubs and adding me to health insurance \nWe brought 2024 married filed jointly taxes \n\nApplication received: Oct 17 \nInterview date : April 15th\nI-130 approved: April 16th\nI-485 approved: April 22nd \nNo lawyer \nB1/b2 visitor overstayed \n\nHappy to answer any questions! \n\nUPDATE: obtained Green Card in May! \n\nBest of luck and positive vibes to everyone else in this process! 🤍", "subreddit": "USCIS"}
{"post_id": "1h0pcrz", "title": "Jesus has done it for me. Case approved ", "author": "u/HugeAd7100", "score": 498, "num_comments": 185, "created": "2024-11-26T22:53:56+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1h0pcrz/jesus_has_done_it_for_me_case_approved/", "is_self": false, "image_urls": ["https://i.redd.it/len425fmsb3e1.jpeg"], "selftext": "PD: April 18th, \nRFE: for medicals \nCombo approved in June\nI-130 approved November 25th \nI-485 approved November 26th. \nAdjusted from H1B \nNBC - case was later moved to field office, first Baltimore then later Norfolk.. but not really sure. \nFor those still waiting, just believe that the Lord Jesus is able to come through for you like He came for me!! 🎉🎉 Hallelujah ", "subreddit": "USCIS"}
{"post_id": "1go64pd", "title": "12 years. Asylum to GC to now a citizen. Lots of sacrifices & work & anxiety leading up to this moment. ❤️ 🇺🇸 ", "author": "u/Low_Biscotti6497", "score": 496, "num_comments": 40, "created": "2024-11-10T17:40:56+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1go64pd/12_years_asylum_to_gc_to_now_a_citizen_lots_of/", "is_self": false, "image_urls": ["https://i.redd.it/jm9ruwg5240e1.jpeg"], "selftext": "Asylum took 5 years\nGC for 4 years (backdated asylum)\nCitizenship took 1 whole year. 2 interviews later ( long story)\n\nIf you see my previous posts you’ll see what I went through!", "subreddit": "USCIS"}
{"post_id": "1gmtfyn", "title": "I was approved today and it's my birthday!", "author": "u/NezzyL1973", "score": 494, "num_comments": 100, "created": "2024-11-08T21:20:43+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gmtfyn/i_was_approved_today_and_its_my_birthday/", "is_self": false, "image_urls": ["https://i.redd.it/osya520lvqzd1.jpeg"], "selftext": "I just got the notification a couple hours ago and checked with my lawyer...the wait is over! It couldn't have come on a better day, today is my birthday! I am overjoyed but I have a question,  is the social security office going to send me a new card or do I have to request un unrestricted one when I receive my green card ?\nFor all of you still waiting,  your turn will come, don't lose hope!!!", "subreddit": "USCIS"}
{"post_id": "1jupr0s", "title": "We did it!! Approved!!", "author": "u/pinkarcher_", "score": 494, "num_comments": 184, "created": "2025-04-08T21:55:52+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jupr0s/we_did_it_approved/", "is_self": false, "image_urls": ["https://i.redd.it/qqu58svhnote1.jpeg"], "selftext": "I finally got my green card approved!! I’m feeling so overwhelmed with joy and relief. For anyone still in the middle of the process—hang in there. I know how stressful and uncertain it can feel, but your time will come. Stay patient, stay hopeful, and trust in the journey. You’ve got this!", "subreddit": "USCIS"}
{"post_id": "1jriij1", "title": "I am finally a citizen!", "author": "u/__theredpill__", "score": 488, "num_comments": 66, "created": "2025-04-04T18:08:55+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jriij1/i_am_finally_a_citizen/", "is_self": false, "image_urls": [], "selftext": "Applied for the citizenship N-400 on Nov 9,2024. \nInterview schedule for Feb 4,2025.\nN400 approved on March 13, 2025.\nOath ceremony scheduled on March 14, 2025 for April 4,2025.\nAnd here I am today. What a mad journey this has been. \n", "subreddit": "USCIS"}
{"post_id": "1hwy5zp", "title": "Maas deportations kicked off", "author": "u/Sad-Opportunity-911", "score": 486, "num_comments": 503, "created": "2025-01-08T23:20:19+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hwy5zp/maas_deportations_kicked_off/", "is_self": true, "image_urls": [], "selftext": "Today i saw articles and videos showing CBP and ICE raids in kern county bakersfield CA.\nThey weren't a targeted arrest, it was a mass arrest at a gas station profiling people who shop there and rounds them up if they appears to be undocumented, more than 20 immigrants detained \n\n\nhttps://www.kget.com/news/local-news/immigration-enforcement-operations-taking-place-in-bakersfield-area-local-officials-say/amp/\n\nIt's \"MASS DEPORTATIONS\" not maas sorry about that lol", "subreddit": "USCIS"}
{"post_id": "1nt171k", "title": "I am now a US citizen.", "author": "u/tamle7", "score": 487, "num_comments": 73, "created": "2025-09-28T22:09:55+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nt171k/i_am_now_a_us_citizen/", "is_self": false, "image_urls": [], "selftext": "Hello,\n\nFirst, I want to thank everyone on this sub for your support and help (those who posted their experience, those who commented on the posts, and those who answered my questions over the years).\n\nI am going to provide as many details as possible that might be helpful to our future citizens.\n\nField Office: Santa Ana, California. Ask me any questions!\n\nMy timeline:\n\n* Aug/2021 - Applied for I-485 marriage based\n* May/2022 - Conditional Green Card Approved\n* March/2024 - Applied for I-751\n* March/2025 - Applied for N-400 marriage based (3-year rule)\n* Aug/2025 - N400 - Interview was scheduled (we were preparing for a Combo interview but then->>)\n* Early Sep/2025 - I-751 approved\n* Sep/27/2025 - Interview - passed civic test, recommended for approval, asked for same day oath, attended ceremony with about 5 other people, became US citizen all within 1 hour. \n* It felt surreal the moment I received my Certificate of Naturalization, that everything was over, and I am a citizen. I even asked the person who did our ceremony that \"is it done?\".\n* **6 Questions civic test:**\n\n1. What's the Supreme law of the land?\n2. Before he was President, Eisenhower was a general. What war was he in?\n3. There were 13 original states. Name three.\n4. The House of Representatives has how many voting members?\n5. Who does a U.S. Senator represent?\n6. We elect a President for how many years?\n\n* **Reading and writing questions:** Who was Abraham Lincoln? Abraham Lincoln was the president during the civil war.\n\nAnything **special** about my case? Not really except for a speeding ticket 10 years ago and a ticket for using mobile device at the red light from 5 years ago, so I answered **YES** to question **15.b** in part 9 in form N-400 **\"**Have you **EVER** been arrested, cited, detained or confined by any law enforcement officer, military official (in the U.S. or elsewhere), or immigration official for any reason, or been charged with a crime or offense?\", and uploaded all the records I could find showing everything was taken care of.\n\n\\*\\*The officer asked this question during the interview, I again, answered, **YES**. He then asked, what happened, I explained, then he asked if I paid the tickets, I answered YES. No records were requested.\n\nWhat else was being asked during my N-400?\n\n* The officer went over about 90% of the questions on the N-400 application\n* Additionally, he asked if i owned taxes, where I worked, what I do for work, do i rent/own?, he asked for my lease agreement, which I provided.\n\nMy tips to you for this entire process(from I-485 to N-400)\n\n* Don't check USCIS page every day for status update, it just drives you crazy\n* Your email is the best tool to get alert when there are updates on your applications\n* Relax during interview (I was too nervous and the officer told me to relax)\n* Make sure to download the N-400 Electronic Copy to review the ENTIRE application before your interview because the officer will go the application with you after the civic test.\n* If everything on your N400 is correct and true up until your interview, then answer them EXACTLY like in the application.\n* If you make a mistake on your N400, or an answer is no longer applicable or whatever that case is, that is OKAY, just let the officer know right after you took the interview Oath.\n* Apply for I-751 and N-400 right away using the 90-day window\n* Things are constantly changing, apply ASAP and get things done, be ready, be prepared and be organized. \n\nGood luck, everyone!\n\n\n\n\n\n  \n\n\n", "subreddit": "USCIS"}
{"post_id": "1nmals8", "title": "President Trump’s new H-1B visa requirement applies only to NEW, prospective petitions that have not yet been filed.", "author": "u/Classic_General6107", "score": 482, "num_comments": 183, "created": "2025-09-20T21:49:33+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nmals8/president_trumps_new_h1b_visa_requirement_applies/", "is_self": false, "image_urls": ["https://i.redd.it/4pm56k0s4eqf1.jpeg"], "selftext": "Official statement from USCIS \n\nhttps://www.uscis.gov/sites/default/files/document/memos/H1B_Proc_Memo_FINAL.pdf", "subreddit": "USCIS"}
{"post_id": "1j52pmw", "title": "Trump to revoke legal status for 240,000 Ukrainians as US steps up deportations", "author": "u/theflintseeker", "score": 477, "num_comments": 163, "created": "2025-03-06T18:44:06+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1j52pmw/trump_to_revoke_legal_status_for_240000/", "is_self": true, "image_urls": [], "selftext": "Article: https://www.reuters.com/world/us/trump-plans-revoke-legal-status-ukrainians-who-fled-us-sources-say-2025-03-06/\n\nAny idea what statuses are going to be revoked? Are these U4U folks or those who crossed via land border at the beginning of the war?\n\nWe are hosting a U4U and are worried she's next even though she did everything by the book 😔", "subreddit": "USCIS"}
{"post_id": "1o2xb0y", "title": "RTD has arrived", "author": "u/rus_uk1988", "score": 471, "num_comments": 116, "created": "2025-10-10T10:33:26+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1o2xb0y/rtd_has_arrived/", "is_self": false, "image_urls": ["https://i.redd.it/gnk76cqdi9uf1.jpeg"], "selftext": "Reddit readers,\nI’d like to share my timeline and experience of receiving a Refugee Travel Document (RTD). It’s been a difficult and emotional journey.\n\nOne of my family members became very seriously ill, so on July 8th, 2024, I sent my I-131 application to USCIS with a request for expedited processing. I included medical records from my family member as supporting evidence.\n\nAfter six months of waiting, I began calling USCIS regularly. Every time, I got the same response:\n\n“Your application is within normal processing time, and unfortunately, your request does not qualify for expedited processing.”\n\nIt was frustrating and disheartening, but I kept calling—almost every month.\n\nAfter 15 months of waiting, something unexpected happened. On the morning of October 8th, I received a USPS Informed Delivery email showing an image of a letter from the USCIS processing center. Curious, I immediately checked my myUSCIS account—and to my surprise, I saw a new update:\n\n“Your Refugee Travel Document has been produced and sent for delivery.”\n\nThat moment was such a relief.\n\nThis whole process took a toll on me. I had to see a psychiatrist several times and take prescribed medication to manage the stress. But thanks to God and my supportive family, I made it through.\n\nNow, I’m facing a new dilemma. With the current administration, I’m nervous about traveling abroad. I have less than a year before my RTD expires, so I need to decide whether to travel or wait until I receive my Green Card.\n\nIf anyone has gone through a similar situation, I’d really appreciate hearing about your experience or any advice you might have.", "subreddit": "USCIS"}
{"post_id": "1ih9tjs", "title": "Got it! 🤩", "author": "u/trojnik", "score": 469, "num_comments": 49, "created": "2025-02-04T04:45:19+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ih9tjs/got_it/", "is_self": false, "image_urls": ["https://i.redd.it/il58lqh7y1he1.jpeg"], "selftext": "\nBlock: MSC259003 \nCategory: EB1-C (ROW) \nReceipt Date and Service Center: 10/09/2024 - National Benefits Center\n\nBiometrics Appointment Notice sent on: 10/25/2024 Biometrics Appointment Date: 11/05/2024 Request for initial evidence: 10/28/2024 - birth certificates - our lawyer said they were initially sent but it is common for those to get misplaced or something\n\nEAD I-765 Approval Date: 11/14/2024 - Approved EAD Card delivered: 11/21/2024 AP I-131 Approval Date: 11/14/2024, got the mail on 11/21/2024 - Approved delivered - 11/21/2024 Interview date (if any): none\n\nAdjustment of Status I-485 Approval Date: January 29, 2025 ✅ (1/28/25 we got notification that said: new card being produced)\n\nSO HAPPY! 🎊🥳", "subreddit": "USCIS"}
{"post_id": "1miu8z1", "title": "USCIS Journey Over!", "author": "u/KeyAd1664", "score": 466, "num_comments": 70, "created": "2025-08-06T03:38:55+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1miu8z1/uscis_journey_over/", "is_self": false, "image_urls": ["https://i.redd.it/l2k1vmd6lbhf1.jpeg"], "selftext": "From a 2-year Green Card holder to a U.S. Citizen in under 7 weeks!\n\nI immigrated to the U.S. on a K-2 visa (as the child of a K-1 Fiancé Visa holder). Like many, I went through the grueling I-485 Adjustment of Status process and was approved for a 2-year Conditional Green Card.\n\nI started from the bottom, working as a cashier in a small grocery store, juggling multiple jobs just to make ends meet. But looming over me was the I-751 Removal of Conditions. The thought of going through another long, expensive USCIS process was overwhelming. The fees, the wait, the uncertainty. It was mentally exhausting. All of this, while trying to adjust to life in a new country.\n\nThen I discovered a game-changer: military service.\n\nI learned that the U.S. military accepts 2-year Green Card holders and offers an expedited path to citizenship. I would not go to the entire process of renewing to a 10 year GC, and applying for citizenship on God knows when. \n\nSo I enlisted. I signed the contract, pushed through Basic Training, and graduated. I was among the proud few who were sworn in as new U.S. Citizens during graduation. That feeling is UNREAL.\n\nInitially, I joined for citizenship. But the military gave me so much more. It gave me a career. I went from being a cashier, dishwasher, and hotel cleaner to becoming a medic in the United States Air Force. I now travel across states, have stability, benefits, and a future that once seemed out of reach.\n\nAll of this because I got frustrated.\nBecause I did my research.\nBecause I refused to let USCIS control my timeline.\n\nIt’s a love-hate relationship with USCIS no doubt. But looking back, every struggle brought me here.\n\nI am open for questions!", "subreddit": "USCIS"}
{"post_id": "1ku2sxk", "title": "It’s here!", "author": "u/Grouchy_Progress_828", "score": 460, "num_comments": 58, "created": "2025-05-24T04:04:47+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ku2sxk/its_here/", "is_self": false, "image_urls": ["https://i.redd.it/7m0scq4cmn2f1.jpeg"], "selftext": "PD 12/18/24\nLA FO\nEAD Approced 2/14 \nInterview 5/14 I130 approved on the spot\nI485 Approved 5/15 \nGC on hand today 🥹🇺🇸\nDACA > GC holder ❤️\n31 years in this country! \n\nGood luck and prayers to all! \nThank god ", "subreddit": "USCIS"}
{"post_id": "1maq0ho", "title": "USCIS’s plan to implement Trump’s executive order on birthright citizenship", "author": "u/thelexuslawyer", "score": 459, "num_comments": 325, "created": "2025-07-27T16:03:21+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1maq0ho/usciss_plan_to_implement_trumps_executive_order/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1m48nbx", "title": "Arrest when waiting for I-485 approval? What am I missing? Dad awaiting green card arrested by ICE as he drops off kid at preschool", "author": null, "score": 459, "num_comments": 353, "created": "2025-07-19T22:16:45+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1m48nbx/arrest_when_waiting_for_i485_approval_what_am_i/", "is_self": false, "image_urls": [], "selftext": "According to the news article, he graduated in 2019 then switched to OPT and married a US citizen in June 2021. I-130 approved and was waiting on I-485. ICE says he overstayed his visa, but isn't that the whole point of AOS? They even attended the interview 4 months ago and were just waiting on the I-485 approval. What's happening here?", "subreddit": "USCIS"}
{"post_id": "1l3li9p", "title": "The \"travel ban\" is here.", "author": "u/renegaderunningdog", "score": 454, "num_comments": 456, "created": "2025-06-05T00:20:19+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1l3li9p/the_travel_ban_is_here/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1mwogp5", "title": "Officially a  U.S. citizen !🇺🇸", "author": "u/E20V", "score": 450, "num_comments": 92, "created": "2025-08-21T21:54:03+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mwogp5/officially_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/nhs4cpf82gkf1.jpeg"], "selftext": "After 11 years,  I finally became a US citizen🥹🫶🏻\n\nGeneral provision. National Benefits Center. \n\nMy timeline: \n06/12/2015 - Filed for asylum \n01/03/2018 - Asylum interview \n01/16/2018 - Asylum approved\n02/30/2019 - Filed for AOS\n04/03/2021 - GC approved\n(resident since 04/03/2020)\n2/12/2025 - submitted N400 online \n(50 days before)\n2/12/2025 - Biometrics being reused.\n7/2/2025 - Interview scheduled \n08/21/2025 - Interview & Oath Ceremony the same day.\n\nCivic questions: \nWhy does the flag have 50 stars?\nWhen is the last day you can send in federal income tax forms? \nWho is the Chief Justice of the United States now? \nWhat major event happened on September 11th 2001? \nWhen must all men register for the Selective Service? \nWhat is the capital of your state ? \n\nReding: How many US Senators are there ? \nWriting: We have one hundred Senators.\n\nI just want to say a big THANK YOU 🙏 to everyone in this community — I’ve learned so much from you all! Wishing all of you the best of luck 🤗 \nIf you have any questions, feel free to ask !\n", "subreddit": "USCIS"}
{"post_id": "1i4s2c1", "title": "I’m freeeeee", "author": "u/Low_Pineapple_4243", "score": 451, "num_comments": 114, "created": "2025-01-19T06:12:27+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i4s2c1/im_freeeeee/", "is_self": false, "image_urls": [], "selftext": "Just wanted to share my timeline here!\nNo RFEs, no interview, and everything wrapped up in just 4 months! Wishing everyone here the same smooth journey and a quick approval! 💕\n\nMarried U.S. Citizen \n\n\t•\t09/04/24: Mailed the package\n\t•\t09/06/24: Delivered to Chicago lockbox\n\t•\t09/10/24: Received receipt numbers\n\t•\t09/13/24: Rescheduled biometrics appointment\n\t•\t09/25/24: Completed biometrics\n\t•\t09/26/24: EAD approved\n✄✄✄✄✄✄✄✄ Long wait ✄✄✄✄✄✄✄✄\n\t•\t01/09/25: Both me and my husband received an email saying “taken an action.” When I logged in, there were no visible updates. Contacted Emma the next day and learned that my case was reviewed by an officer and had been transferred to the Seattle FO on 01/02/25. I verified this with three different agents, and all gave consistent info!\n\t•\t01/17/25: My husband received two more “taken an action” emails. This time, I logged in and saw that I-130 was approved! \n\t•\t01/18/25: In the evening, I got two “taken an action” emails. Logged in and BOOM 💥i485 approved!!! 🥳\n\n", "subreddit": "USCIS"}
{"post_id": "1gqjwnx", "title": "Please stop with the fear mongering", "author": "u/throwaway20483831", "score": 450, "num_comments": 156, "created": "2024-11-13T18:33:25+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gqjwnx/please_stop_with_the_fear_mongering/", "is_self": true, "image_urls": [], "selftext": "Let me make this clear: If you are a citizen, naturalized or natural born, or a law abiding green card holder, you are not going to need to worry about Trump. Even the so called cancel birthright citizenship (which is the only thing he mentioned related to legal immigration) only affects future immigrants after January and cannot be passed without an extra amendment which would not pass unless 3/4 of the state ratifies it (which is impossible if you check the numbers of blue states and red states and who is holding state assembly majority). Ending birthright citizenship needs an constitutional amendment not an executive order unlike what he run his mouth with. For de-naturalization, do you guys not understand how incredibly difficult it is to de-naturalize a citizen? There is a list on Wikipedia about every citizen that has been de-naturalized and most of them is Nazi during WW2 with a few of them being recent time immigrants that committed major crime or fraud BEFORE they acquire citizenship. Plus, on top of that, Trump has NEVER mentioned or said anything about the so called de-naturalization \n\n\nLastly, you all realized that the worst case scenario such as bypassing laws and constitutions to deport citizens that some of y’all mentioned, would likely lead to a civil war in the United States similar to Myanmar? Our country is already on the verge of civil collapse. Even if Trump is crazy, he is logical enough to understand what he can and cannot do and what public boundaries are.\n\n\nPlease calm down, the only affect trump would have is similar to his last administration where green card visa processing time that is much more sluggish, maybe change the N400 test to be the harder version when he was the president and that’s about it.", "subreddit": "USCIS"}
{"post_id": "1hfzd5j", "title": "I'm a U.S. citizen!!!", "author": "u/KAKKAROT9000", "score": 450, "num_comments": 22, "created": "2024-12-17T01:29:28+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hfzd5j/im_a_us_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/pp0g8qmlab7e1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1k8jxui", "title": "Top OpenAI researcher denied green card after 12 years in US", "author": "u/FarWinter541", "score": 444, "num_comments": 100, "created": "2025-04-26T18:38:37+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k8jxui/top_openai_researcher_denied_green_card_after_12/", "is_self": false, "image_urls": ["https://i.redd.it/961rejmuyzwe1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1i67l10", "title": "PROTECTING THE MEANING AND VALUE OF AMERICAN CITIZENSHIP – The White House", "author": "u/lovetree77", "score": 445, "num_comments": 830, "created": "2025-01-21T01:54:52+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1i67l10/protecting_the_meaning_and_value_of_american/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1heahku", "title": "Someone on Facebook lol ", "author": "u/ImprovementDapper887", "score": 443, "num_comments": 74, "created": "2024-12-14T19:33:01+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1heahku/someone_on_facebook_lol/", "is_self": false, "image_urls": ["https://i.redd.it/65uijyl69v6e1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1m7nfg6", "title": "10 Year Ban, Denied Greencard, Married to US Citizen", "author": "u/Cherrylacewitch", "score": 433, "num_comments": 163, "created": "2025-07-23T22:33:15+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1m7nfg6/10_year_ban_denied_greencard_married_to_us_citizen/", "is_self": true, "image_urls": [], "selftext": "***EDIT 2: Thanks for all the helpful responses, everyone! From what I’ve gathered, it doesn’t make sense to apply for the waiver given 1. There is only 5 years left on the ban and 2. The current administration. When the ten years are up (or close to it) my husband and I will find a competent attorney and discuss what it might take for me to be able to visit the USA again and go from there. ***\n\nHas anyone ever had success with waiving the ten year ban?\n\nI am a Canadian citizen married to a US citizen. When I was 26 or so I moved to the US, but overstayed my visa during the process of applying for my green card (it took us a while to save money). I can’t remember how long I overstayed, maybe slightly over a year..?\n\nUnder the first trump administration I was denied green card (my attorney was shocked, as she was confident my overstay would be pardoned because we have a genuine marriage).\n\nI was denied in 2020 and got the ten year ban. They denied me claiming financial concerns, that I’d be a public ward. At the time my husband and I were both fairly young (20’s) and not financially established yet.\n\nI left in 2020 of my own accord to move back to Canada with him. We applied for his permanent residence, which he successfully got. He now has a great career making over 100k/a year and I will be completing my grad studies this year and becoming a licensed psychotherapist, which will afford us even more financial security. I say this because we are both much more established than when I was banned, and that was their apparent reason to deny me. It’s also our intention to buy a home in Canada very soon.\n\nWe have a lovely life in Canada, but I haven’t seen his side of the family since 2020. Every time he goes home, we’re stuck apart. We were obviously stupid back then and didn’t grasp the gravity of the situation, but we certainly do now.\n\nI’m wondering if anyone has had success waiving this ban? Any stories at all would be greatly appreciated.\n\nEDIT: I understand that my denial was based on public charge concern. I also understand that I was NOT denied because of unlawful presence, but that the unlawful presence simply results automatically in the ban.", "subreddit": "USCIS"}
{"post_id": "1khccy4", "title": "It’s here💚", "author": "u/Miszrachelitah", "score": 436, "num_comments": 59, "created": "2025-05-07T23:54:26+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1khccy4/its_here/", "is_self": false, "image_urls": ["https://i.redd.it/06b7cp337gze1.jpeg"], "selftext": "PD I-130 O9.26.2022 (LPR) husband became citizen on 10.09.2024. Approved 10.30.2024\nPD I-485 10.30.2024 Interview 04.22.2025, approved 04.23.2025. \nFile by myself, worked without authorization since 2021, visa overstay. Good luck to everyone!! ", "subreddit": "USCIS"}
{"post_id": "1jmgi79", "title": "Second Florida resident learns they aren't a U.S. citizen nearly 60 years after moving to America", "author": "u/45nmRFSOI", "score": 437, "num_comments": 89, "created": "2025-03-29T06:48:14+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jmgi79/second_florida_resident_learns_they_arent_a_us/", "is_self": false, "image_urls": [], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1nwfcpi", "title": "Naturalized today", "author": "u/Out-in-the-Wasatch", "score": 432, "num_comments": 36, "created": "2025-10-02T20:40:24+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nwfcpi/naturalized_today/", "is_self": false, "image_urls": [], "selftext": "\nNaturalized in the Salt Lake City Field Office this morning along with others from many different countries.   It was great to watch the naturalization of people from Burma, Nepal, Laos, New Zealand, Finland, India, China, Mexico, El Salvador, Ecuador, Bolivia, Germany, American Samoa, Syria, Vietnam, and others I’m sure I missed.\n\n**Timeline:**\n - Green Card issued August 2019 after 15 years or so in the US\n - N400 filed March 15, 2025\n - Interview August 28th, 2025\n - Ceremony this morning, Oct 2nd!\n \nFirst actions after naturalization? Had a lovely brunch in the sun at Liberty Park in Salt Lake and handed my voter registration form in by hand to my County Clerk’s office.\n\nAnd then I made a donation to the National Immigration Law Center.   One of the most important things I can do now is help keep the door unlocked and the porch light on for those who follow.  Shout out to the German woman who got up and spoke near the end of the ceremony about her journey and the importance of immigrant rights in these times.  It was powerful.\n\nNow off to do a N600 for my child, driver’s license update, passports etc etc.  The paperwork stops at some point, right??!!??\n\n\n\n\n\n\n\n", "subreddit": "USCIS"}
{"post_id": "1mqq14p", "title": "Why is nobody talking about this announcement???", "author": null, "score": 428, "num_comments": 342, "created": "2025-08-15T06:50:07+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mqq14p/why_is_nobody_talking_about_this_announcement/", "is_self": false, "image_urls": ["https://i.redd.it/j1szznphr4jf1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1jbsxde", "title": "Finally an American Citizen 🥳", "author": "u/Significant_Tune_938", "score": 431, "num_comments": 37, "created": "2025-03-15T11:19:28+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jbsxde/finally_an_american_citizen/", "is_self": false, "image_urls": ["https://i.redd.it/95nmrrv28uoe1.jpeg"], "selftext": "It finally happened and I almost can’t believe it. After 8.5 years in the country I am finally a U.S Citizen. \n\nHere is the timeline of my last process: \n\n08/07/2023: Submitted I-751 to remove conditions\n\n12/18/23: Took new biometrics\n\n07/22/2024: Submitted N-400\n\n1st week of February 2025: Wrote to congressman to check on status because the timeline on the USCIS website changed in December when I was first supposed to get it (I know the timeline trackers don’t really mean anything but it was my excuse to write to the congressman’s office) \n\n02/20/25: Notice for interview received for March 13th\n\n03/13/25: Both I-751 and N-400 interviews were done, took the oath and received a certificate on the same day 🇺🇸 \n\nBest of luck to everyone going through the process!\n\n\n\n\n", "subreddit": "USCIS"}
{"post_id": "1jr4gn4", "title": "Trump shows off the Gold Card!", "author": "u/Next-Display-3837", "score": 428, "num_comments": 223, "created": "2025-04-04T05:30:35+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jr4gn4/trump_shows_off_the_gold_card/", "is_self": true, "image_urls": [], "selftext": "Trump showed the gold card to media today. He says in 2 weeks it will be available. Not sure how this is going to work though. There is no law passed by congress for this card. \n\nhttps://x.com/rapidresponse47/status/1907904956600037569?s=46&t=nZeWa1CSFcRK0r82AHNmTQ", "subreddit": "USCIS"}
{"post_id": "1kvhc0d", "title": "This is for everyone who has an INTERVIEW coming up", "author": "u/Jealous-Artichoke279", "score": 427, "num_comments": 145, "created": "2025-05-26T00:32:05+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kvhc0d/this_is_for_everyone_who_has_an_interview_coming/", "is_self": true, "image_urls": [], "selftext": "I just had my i485 and i130 interview a few days ago my pd was on January 22nd 2025 i was in removal proceedings, i had previous arrests, i was overwhelmed and stressed about it everyday, trying to gather as much documents and bonafides as possible, asking around, contacting lawyers etc. my i130 interview only lasted for 5 mins he asked me and my wife for our marriage date, our address and how long we had known each other for. My i485 took exactly 20 mins. He verbally approved both on the spot but stated he needs his supervisor to finalize the approval because he needs to verify my removal proceedings have been terminated! So anyone stressing out or struggling! Just be as honest and as transparent as possible. Interviewers are usually veterans, just make sure you’re nice and polite and well spoken, make it come off as a conversation instead of a serious interview! Good luck. I overstayed! I was out of status! I worked without authorization! **My case was processed in less than 5 months, no RFE’s, no fallbacks, no issues, if anyone needs help filing or what to include and with all the documentations and any bonafides i can help*** its never about how much evidence you provide **** Go get it 🥳", "subreddit": "USCIS"}
{"post_id": "1k2muxb", "title": "USCIS has silently frozen all C11 /C19 EADs for Ukrainian parolees - 500+ of us are jobless and desperate", "author": "u/Cute_Matter5031", "score": 428, "num_comments": 329, "created": "2025-04-19T03:12:02+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k2muxb/uscis_has_silently_frozen_all_c11_c19_eads_for/", "is_self": true, "image_urls": [], "selftext": "Hi everyone,\n\nI'm part of a group of over 500 Ukrainian humanitarian parolees who legally entered the U.S. through the Uniting for Ukraine program.\n\nWe filed timely applications to renew our Employment Authorization Documents (Form I-765, category C11) — but since early 2025, USCIS has placed a de facto processing hold on these cases.\n\nIt’s been over 3 months, and no one is getting approvals.\nNot a single C11/C19 based EAD for a Ukrainian parolee has been issued in that time — regardless of receipt date, evidence, or service center.\n\nThis isn’t just a delay — this is a total freeze.\nThere has been no formal announcement, no posted guidance, no timeline, and no recourse.\n\nAs a result:\n\nHundreds of us have lost jobs and health insurance\n\nPeople are being evicted or going into debt\n\nSome are being forced to consider returning to warzones or occupied regions, because they simply cannot survive here anymore\n\nWe’ve contacted USCIS, congressional offices, the Ombudsman, and even national media. So far — total silence.\n\nWe’re looking for:\n\nAnyone else in the same situation (please share your timelines)\n\nLegal guidance or action\n\nJournalists or advocates willing to investigate this quiet humanitarian failure\n\nWe did everything right. We came legally, worked legally — and now we’re stuck in a system that won’t even acknowledge us.\n\nThank you.", "subreddit": "USCIS"}
{"post_id": "1ica8z5", "title": "Hello old friend it’s been to long", "author": "u/butt_nugget_supreme", "score": 425, "num_comments": 38, "created": "2025-01-28T19:41:12+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ica8z5/hello_old_friend_its_been_to_long/", "is_self": false, "image_urls": ["https://i.redd.it/val4oltmfsfe1.jpeg"], "selftext": "After 26 years of not having a physical card since it was stolen back in 1999 I finally have you back case submitted Nov 2024 card received today Jan 2025 just over 60 days 🙌", "subreddit": "USCIS"}
{"post_id": "1jitib9", "title": "My experience crossing the border for the first time as a permanent resident.", "author": "u/yuyinator", "score": 422, "num_comments": 84, "created": "2025-03-24T15:33:20+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jitib9/my_experience_crossing_the_border_for_the_first/", "is_self": true, "image_urls": [], "selftext": "I want to share my experience crossing the border in Tijuana (CBX). I've seen many cases of people who are very concerned about the news about permanent residents being deported.\nI went to Mexico City to visit my family for a month. My residency was approved in February, but the USPS lost my green card (🙄), so I have an ADIT stamp in my passport.\nI was actually a little nervous about crossing, as I had seen news reports and videos of people saying that even if you have a green card, you could be deported.\nI went through immigration, and it was pretty quick. They just asked me if I had anything to declare in my suitcase, nothing more.\nThe officer seemed quite friendly, so I felt very calm.\nIt took me longer to wait for my suitcase than it did at immigration. Lol.\nI hope you also have a calm experience entering the country.\nAnd most importantly, don't be scared by everything you see on social media.", "subreddit": "USCIS"}
{"post_id": "1nxmvlm", "title": "Thank God finally approved", "author": "u/well_limitless30", "score": 425, "num_comments": 207, "created": "2025-10-04T06:44:21+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nxmvlm/thank_god_finally_approved/", "is_self": false, "image_urls": ["https://i.redd.it/7cyhejg1k1tf1.jpeg"], "selftext": "There was a time I carried so much worry in my heart. Because of my overstay, me and my wife worried a lot but God is good I felt uncertain about my future and fearful of what would happen. But in the middle of that fear, we chose to trust God.\nWe pray harder \n\nWe surrendered everything into His hands, believing that His plans are greater than my plan. And truly, in His mercy, He turned my worry into hope. In such a short time, what seemed impossible became possible—my Green Card was approved.\n\nThis was not because of my own strength, but because of the goodness and faithfulness of the Lord. He reminded me that He is the God who makes a way where there seems to be no way, and that His grace is always greater than my shortcomings.\n\n📖 “Fear not, for I am with you; be not dismayed, for I am your God; I will strengthen you, I will help you, I will uphold you with My righteous right hand.” – Isaiah 41:10\n\nTo those who are afraid or waiting for their breakthrough: do not be afraid. Trust in the Lord, for He knows the desires of your heart. What He has planned for you will always be better than what you can imagine. If He did it for me, He can do it for you too.\n\nAll glory belongs to Him alone, for He is the One who opened the door and gave me a new beginning.", "subreddit": "USCIS"}
{"post_id": "1jec0xv", "title": "APPROVED!", "author": "u/sunshinesta", "score": 418, "num_comments": 146, "created": "2025-03-18T18:28:02+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jec0xv/approved/", "is_self": false, "image_urls": ["https://i.redd.it/vj6vvit9rhpe1.jpeg"], "selftext": "My case was approved after 8 months. Same sex marriage. We were very nervous about the interview, but the officer was very kind. She only asked us three questions and told us our case had been approved. \n\n\n", "subreddit": "USCIS"}
{"post_id": "1gprwuo", "title": "She’s Here!😍 (Timeline Below)", "author": "u/cuziluvmakeup", "score": 417, "num_comments": 39, "created": "2024-11-12T18:39:31+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gprwuo/shes_here_timeline_below/", "is_self": false, "image_urls": ["https://i.redd.it/lj26x1ygmi0e1.jpeg"], "selftext": "Here’s the complete timeline. Marriage-based AOS:\n\n📌Case filed:\nEnd of January 2020\n\n📌Biometrics:\nMarch 2020\n\n📌EAD Card Issued:\nJuly 2020\n\n📌Notice for GreenCard Interview:\nJanuary 2021\n\n📌Conditional (2-year) GreenCard Interview:\nFebruary 2021 - issued the same week.\n\n📌I-571 filed:\nDecember 2022 (did not hear anything back for months, but they extended my GreenCard for 4 years)\n\n📌N-400 filed:\nMarch 2024\n\n📌Notice for N-400 Interview:\nSeptember 2024\n\n📌I-571 approved with no interview:\nEarly October 2024\n\n📌N-400 interview and oath ceremony:\nEarly October 2024\n\n📌Applied for passport:\nMid October 2024\n\n📌 Passport received:\nRight on 11/01/2024 ", "subreddit": "USCIS"}
{"post_id": "1hkaa88", "title": "APPROVED—I don’t know how to act…", "author": "u/That-Cash", "score": 413, "num_comments": 63, "created": "2024-12-22T23:09:50+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hkaa88/approvedi_dont_know_how_to_act/", "is_self": false, "image_urls": [], "selftext": "Field Office - Newark, NJ\n- RFE Affidavit. \n I-765 approved after contacting the white house, congressman and Live agent on USCIS website several times asking what was happening. \nWhen I-485 was out of processing times, I contacted them several times (live agent), never Emma. It finally worked, I guess. \nThanks to those who help a lot of people here. My anxiety levels have been decreasing since yesterday. Still in shock, exhausted from this journey. My birthday is next month, best gift and christmas ever!!! Good luck everyone! Happy holidays!\n\n", "subreddit": "USCIS"}
{"post_id": "1n1mcij", "title": "USCIS In Home Interview Monday at 6am", "author": "u/AlbertTheRobot", "score": 413, "num_comments": 167, "created": "2025-08-27T16:49:17+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1n1mcij/uscis_in_home_interview_monday_at_6am/", "is_self": true, "image_urls": [], "selftext": "On Monday we received a knock on the door at 6am and it was 2 immigration officers who wanted to make sure our marriage was legitimate. Me and my wife were both home and in our pajamas and it was very clear we were married and living together. They took a picture of us, our bathroom, pictures on the wall, everything. There's no doubt our marriage is real and we had nothing to hide. We moved in pretty quick together and got married officially after she was divorced so there were a few red flags. I am praying and hoping this works in our favor and we get approved soon. I love my wife dearly. Just waiting for an interview now in the office. They asked a lot of questions, why we moved in so quickly and I just answered with pure honesty, I loved her and I need a wife. \n\nJust praying now. I'm scared. ", "subreddit": "USCIS"}
{"post_id": "1jlfbik", "title": "How Lucky Am I? 😭😭 (Timeline of Mother’s I-130 Approval)", "author": "u/ConnectInjury983", "score": 413, "num_comments": 82, "created": "2025-03-27T22:11:22+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jlfbik/how_lucky_am_i_timeline_of_mothers_i130_approval/", "is_self": false, "image_urls": ["https://i.redd.it/esonqqia3bre1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1ispf20", "title": "Just had the interview, married to US Citizen, it didn't went well.", "author": "u/Born-Essay-9887", "score": 415, "num_comments": 334, "created": "2025-02-18T22:40:11+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ispf20/just_had_the_interview_married_to_us_citizen_it/", "is_self": true, "image_urls": [], "selftext": "UPDATE FOR ALL THE NON-BELIEVERS THAT MY MARRIAGE WAS REAL: We just got approved by just sending stamped pictures and booking travels. :) Finally!!\n\n\n\n\n\n\n\nSo basically, he needed more evidence. My marriage is completely real.\n\nThe officer noted that it seemed too coincidental that we arrived in the U.S., got married three months later, and then submitted the paperwork four months after that, which he found suspicious. He also stated that while there is evidence of our relationship in 2022, we need to prove that we have been together since 2016. He emphasized that pictures alone are not enough. However, since we were just boyfriend and girlfriend at the time, it doesn’t make sense to expect shared bank accounts, property, or other documents typically associated with marriage.\n\nUltimately, he suggested two things: first, completing the medical requirement, as he cannot approve the application without it—my initial one expired since we submitted it in 2022; and second, providing pictures with visible timestamps to verify that we have been together since 2016. While we did submit pictures, he now wants proof that they were taken on the specified dates by checking the timestamps in the photo settings. Additionally, he repeatedly insisted that we upload more documentary evidence, as he believed pictures alone were insufficient.\n\nThis was very frustrating because, given our dating status at the time, we didn’t have shared assets or official documents. Now, we are unsure what other evidence we can provide beyond the pictures with the timestamps (screenshots, basically?).\n\nWe need to have everything ready by Friday before noon. He said he’d give us a call???\n\nHas anyone else experienced something similar? I just feel like this is so unfair. We’ve been together since 2016, got married in 2022, and now someone is telling us our marriage isn’t real? WTF.", "subreddit": "USCIS"}
{"post_id": "1kqjtgd", "title": "It’s here!", "author": "u/Pissedpanipuri", "score": 414, "num_comments": 107, "created": "2025-05-19T18:53:03+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kqjtgd/its_here/", "is_self": false, "image_urls": ["https://i.redd.it/qirxr069cs1f1.jpeg"], "selftext": "A week after the interview (counting business days only), my green card has arrived! My i485 showed approval on the 9th, but the card says resident since the 7th! \nI’m happy to answer any questions! ", "subreddit": "USCIS"}
{"post_id": "1lztblv", "title": "Mother denied I-485", "author": "u/seeebassss", "score": 411, "num_comments": 225, "created": "2025-07-14T17:51:36+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1lztblv/mother_denied_i485/", "is_self": false, "image_urls": ["https://i.redd.it/w696lp0covcf1.jpeg"], "selftext": "My mom’s I-485 just got denied. I’m currently on deployment and did not go with her to the interview only the lawyer. Got an email today saying they had denied her I-485. Any advice on what to do next? ", "subreddit": "USCIS"}
{"post_id": "1k1lxu6", "title": "USCIC paused our Green Card after interview based marriage", "author": "u/GlitteringAddition52", "score": 411, "num_comments": 404, "created": "2025-04-17T19:49:57+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1k1lxu6/uscic_paused_our_green_card_after_interview_based/", "is_self": true, "image_urls": [], "selftext": "Hello everyone. We had our final interview to adjust the status yesterday 4/16/25 but we have been told that Trump administration asked USCIC to put a pause on Green Card application based on marriage because my wife paroled to the U.S. They said you just have to wait. I'm a u.s citizen and my wife was paroled to the United States. Has any one had the same situation recently? ", "subreddit": "USCIS"}
{"post_id": "1jfjfdu", "title": "I became a citizen today! Ask away…", "author": "u/HarrisonHoude", "score": 406, "num_comments": 124, "created": "2025-03-20T07:27:22+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jfjfdu/i_became_a_citizen_today_ask_away/", "is_self": false, "image_urls": ["https://i.redd.it/qwb47m88rspe1.jpeg"], "selftext": "I’m now a citizen! Now Dual, American and Canadian.\nO1 visa to EB1 green card and now finally a citizen… weird timing with America being absolutely BS to Canada 🇨🇦, I’ll proudly be a dual citizen! \n\nApplied just before the 5 year mark for N-400, single, no kids, was very close with my travel dates outside the USA being just under 2.5 / 5 in usa. \n\nCivics test & interview at LA office was so easy, officer was direct, 10 minutes … got approved and went for my oath right away downstairs. Had my certificate in 2-3 hours total, most of it was just waiting around … \n\nAnyways, DONE with all this crappy immigration paperwork and uscis FOREVER!!!!!! Thank you to the threads here I been lurking for many answers. I’ll try to answer any questions or just celebrate with y’all here before trying to never think about this process ever again. ", "subreddit": "USCIS"}
{"post_id": "1jt2hjy", "title": "Green Card Re-Entry, Apr 06 2025, With Misdemeanor arrest record.", "author": "u/psean1977", "score": 400, "num_comments": 180, "created": "2025-04-06T19:37:30+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jt2hjy/green_card_reentry_apr_06_2025_with_misdemeanor/", "is_self": true, "image_urls": [], "selftext": "I have an arrest for solicitation in California from Oct 2019. I was charged for a misdemeanor. Did a pre-trial diversion and had my arrest records sealed. The case was dismissed without any conviction after 1st hearing.\n\nI was granted Green card 2 years later where I had declared this arrest.\n\nI have re-entered country twice in the last 5 years, and was asked about the arrest both times during secondary questioning. And , let go after I answered their questions honestly.\n\nI had to travel to mexico for an emergency on Apr 1 2025, and I just reentered US at SFO.\n\nIt was a routine secondary inspection that lasted less than 10 minutes. They did not even ask me about my arrest record. ", "subreddit": "USCIS"}
{"post_id": "1mjkol6", "title": "New USCIS policy re: Adjudication of I-130s for removable aliens", "author": "u/renegaderunningdog", "score": 404, "num_comments": 348, "created": "2025-08-06T23:47:40+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1mjkol6/new_uscis_policy_re_adjudication_of_i130s_for/", "is_self": true, "image_urls": [], "selftext": "There have been a number of posts on this topic citing poorly written popular press articles. In an effort to clarify things, I am making this post to explain the policy update and to centralize discussion. All outstanding threads on the subject will be locked and all new threads on the subject will be removed.\n\nOn August 1st, USCIS issued [Policy Memo PA-2025-12](https://www.uscis.gov/sites/default/files/document/policy-manual-updates/20250801-FamilyBasedImmigrants.pdf).\n\nOf particular note is this bullet in the Policy Highlights:\n\n- Explains that USCIS may issue an [Notice to Appear] if the alien beneficiary is otherwise removable since a family-based immigrant visa petition accords no immigration status or relief from removal.\n\nThis is a summary of a new section in the [Policy Manual](https://www.uscis.gov/policy-manual/volume-6-part-b-chapter-5#S-C-3)\n\n\"If USCIS determines the alien beneficiary is removeable and amenable to removal from the United States USCIS may issue a Notice to Appear (NTA) placing the beneficiary in removal proceedings. Petitioners and alien beneficiaries should be aware that a family-based petition accords no immigration status nor does it bar removal.\"\n\nIt has always been true that an approved or pending I-130 does **not** in and of itself provide an immigration benefit. However, historically, USCIS has not used I-130 filings to find removable aliens to deport. The change is that they now will.\n\n**Who is not affected by this change**:\n\n1. Anyone who is filing or has filed an I-130 where the beneficiary is outside the United States.\n2. Anyone who is filing or has filed an I-130 where the beneficiary remains in status.\n3. Anyone who is filing an I-130 and an I-485 simultaneously.\n4. Anyone who *has already* filed an I-130 and an I-485 (even if not concurrently).\n5. Anyone who is filing or has filed an I-130 where the beneficiary continues to have some sort of formal protection from deportation (e.g. DACA, TPS, Military Deferred Action or Parole In Place)\n6. Anyone who is filing or has filed an I-130 where the beneficiary is already in removal proceedings. (they can't NTA you twice)\n\n**Anyone who is filing or has filed an I-130 where the beneficiary is in the United States and does not fall into the above categories should be concerned.** This might include people such as:\n\n1. Beneficiaries who intend to seek an I-601A waiver to ultimately depart for consular processing.\n2. Beneficiaries who are waiting for the petitioner to naturalize before filing I-485 (e.g. out-of-status spouses of LPRs)\n3. Beneficiaries who are eligible to concurrently file I-485 but are not for some reason (We occasionally get posts from people on here who say they can't afford both forms at the same time. That's much more risky now)\n4. Beneficiaries who are grandfathered aliens eventually able to adjust through 245(i) but need their petition to become current before they can file I-485.\n5. Beneficiaries who have final orders of removal. While not explicitly stated, if USCIS is using I-130s to find aliens they can serve with NTAs, I don't see why they wouldn't use I-130s to find aliens already ordered deported.\n\nRemember, when you file an I-130 for a beneficiary in the United States you are effectively raising your hand and telling the government who this person is, where they are, and that their immigration history is worth looking at. If they are removable that just got more risky. Petitioners probably should not file I-130s for people who do not fall into one of the six unaffected categories above without legal advice.", "subreddit": "USCIS"}
{"post_id": "1nbvfzg", "title": "Just got tis message", "author": "u/Muted-Resort-8654", "score": 400, "num_comments": 108, "created": "2025-09-08T18:18:38+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1nbvfzg/just_got_tis_message/", "is_self": false, "image_urls": ["https://i.redd.it/fkups4l7gznf1.png"], "selftext": "Went to see the status of my case and is still being processed but why would you send something like this? It stinks of cruelty to people who are triying their best to do things the right way", "subreddit": "USCIS"}
{"post_id": "1n97330", "title": "Journey is complete!", "author": "u/Farstrydr", "score": 402, "num_comments": 50, "created": "2025-09-05T14:40:02+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1n97330/journey_is_complete/", "is_self": false, "image_urls": ["https://i.redd.it/ihunzc5hycnf1.jpeg"], "selftext": "Had my own Oath Ceremony yesterday, while I am proud to now call myself an American, I feel the whole ceremony had an anti climactic feel to it.\nLiterally listen to a guy speak, repeat (not recite) the oath and that was it. Done!", "subreddit": "USCIS"}
{"post_id": "1ij44z4", "title": "I have been waiting for this post 🙏🎉", "author": "u/Adept-Current2707", "score": 399, "num_comments": 105, "created": "2025-02-06T14:45:06+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1ij44z4/i_have_been_waiting_for_this_post/", "is_self": false, "image_urls": ["https://i.redd.it/uxpbqie17jhe1.jpeg"], "selftext": "I just received the wonderful news of my approval! To everyone out there still waiting, please don’t lose hope. I believe your moment will come too. Keep pushing forward; you’re not alone in this journey. \n\n", "subreddit": "USCIS"}
{"post_id": "1hvbfgv", "title": "My time has come", "author": "u/Excellence3333", "score": 393, "num_comments": 119, "created": "2025-01-06T22:10:30+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hvbfgv/my_time_has_come/", "is_self": false, "image_urls": ["https://i.redd.it/ts5or3v86gbe1.jpeg"], "selftext": "Hi family, I’m the one that always congratulate people here with I’m the next to testify next in Jesus name to it. Jesus Christ gave me my new year, it came so early. I applied since 2020 and finally I’m greener. To God be the glory. Keep the faith alive and pray for all still in the waiting process. Christ who did it for me will do it for you as well. Thank you all for the encouragement and support we get here, it’s what keeps us going. ", "subreddit": "USCIS"}
{"post_id": "1hb7gqy", "title": "It’s confirmed! ", "author": "u/Benlaprof", "score": 396, "num_comments": 208, "created": "2024-12-10T17:44:02+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1hb7gqy/its_confirmed/", "is_self": false, "image_urls": ["https://i.redd.it/o150tee3626e1.jpeg"], "selftext": "It is finally confirmed ✅ Thank God! \n\nDoes anyone know how long it typically takes for the actual card to be produced and delivered? I just can’t wait to visit my family.\n\nMeanwhile, I give every member of this amazing Reddit family my congratulations 🎉🎊 in advance of their own approvals which will hopefully be announced here soon. Thanks to everyone for their positive contributions and encouragement throughout the waiting period.\n\nTimelines:\n\nPD: 07/16/2024\n\nBiometrics scheduled: 07/26/2024\n\nBiometrics completed: 08/12/2024\n\nApproval: 12/10/2024\n\nNo RFEs\n\nNo EAD or AP approvals till date. \n\nProcessing center: NBC\n\nField Office: Greer, SC. \n", "subreddit": "USCIS"}
{"post_id": "1gzr7oh", "title": "I just want to cry 😭", "author": "u/toomuchthaitea", "score": 399, "num_comments": 228, "created": "2024-11-25T19:19:08+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1gzr7oh/i_just_want_to_cry/", "is_self": false, "image_urls": ["https://i.redd.it/l4kr0eudl33e1.jpeg"], "selftext": null, "subreddit": "USCIS"}
{"post_id": "1kclf31", "title": "Approved!!!", "author": "u/One_Account1839", "score": 399, "num_comments": 127, "created": "2025-05-01T22:23:11+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1kclf31/approved/", "is_self": false, "image_urls": ["https://i.redd.it/evk9pm4cx8ye1.jpeg"], "selftext": "I can’t believe it! Approved in only 104 days!! My interview was yesterday and I got the email today!🎉🎉 ", "subreddit": "USCIS"}
{"post_id": "1jl6w0z", "title": "Approved without interview!", "author": "u/baepreet", "score": 394, "num_comments": 182, "created": "2025-03-27T15:41:09+00:00", "permalink": "https://www.reddit.com/r/USCIS/comments/1jl6w0z/approved_without_interview/", "is_self": false, "image_urls": ["https://i.redd.it/rk02zccp59re1.jpeg"], "selftext": "We had a receipt date of 11/29/24 - adjusting from K1. We only sent in our marriage certificate as evidence. Sending everyone good vibes and hoping same happens for you soon 🫶🏽🧿🙏🏽", "subreddit": "USCIS"}
